         MACRO                                                          00010000
&LBL     HMASMLPR &TYPE=EQU                                             00020000
*************************************************************           00030000
*                                                           *           00040000
*        LIST PARAMETER                                     *           00050000
*                                                           *           00060000
*************************************************************           00070000
         AIF   ('&TYPE' EQ 'EQU').EQU                                   00080000
         AIF   ('&TYPE' EQ 'DC19').DC19A                                00090000
LISTPARM DS    0XL27                                                    00100000
         AGO   .LIST010                                                 00110000
.DC19A   ANOP  ,                                                        00120000
LISTPARM DS    0XL19                                                    00130000
.LIST010 ANOP  ,                                                        00140000
LISTPRM1 DS    BL1'0'                                                   00150000
LISTALL1 EQU   LISTPRM1+0  B'10000000'                                  00160000
LISTCDS  EQU   LISTPRM1+0  B'01000000'                                  00170000
LISTACDS EQU   LISTPRM1+0  B'00100000'                                  00180000
LISTSCDS EQU   LISTPRM1+0  B'00010000'                                  00190000
LISTCRQ  EQU   LISTPRM1+0  B'00001000'                                  00200000
LISTACRQ EQU   LISTPRM1+0  B'00000100'                                  00210000
LISTPTS  EQU   LISTPRM1+0  B'00000010'                                  00220000
         DC    BL1'0'                                                   00230000
LISTLOG  EQU   LISTPRM1+1  B'01000000'                                  00240000
LISTPRM2 DS    BL1'0'                                                   00250000
LISTALL2 EQU   LISTPRM2+0  B'10000000'                                  00260000
LISTASM  EQU   LISTPRM2+0  B'01000000'                                  00270000
LISTLMD  EQU   LISTPRM2+0  B'00100000'                                  00280000
LISTMAC  EQU   LISTPRM2+0  B'00010000'                                  00290000
LISTMOD  EQU   LISTPRM2+0  B'00001000'                                  00300000
LISTSRC  EQU   LISTPRM2+0  B'00000100'                                  00310000
LISTDLB  EQU   LISTPRM2+0  B'00000010'                                  00320000
LISTSYS  EQU   LISTPRM2+0  B'00000001'                                  00330000
         DC    BL1'0'                                                   00340000
LISTSMD  EQU   LISTPRM2+1  B'10000000'                                  00350000
LISTFMD  EQU   LISTPRM2+1  B'01000000'                                  00360000
LISTMCS  EQU   LISTPRM2+1  B'00100000'                                  00370000
LISTPRM3 DS    BL1'0'                                                   00380000
LISTALL3 EQU   LISTPRM3+0  B'10000000'                                  00390000
LISTNOAP EQU   LISTPRM3+0  B'01000000'                                  00400000
LISTNOAC EQU   LISTPRM3+0  B'00100000'                                  00410000
LISTRES  EQU   LISTPRM3+0  B'00010000'                                  00420000
LISTFUNC EQU   LISTPRM3+0  B'00001000'                                  00430000
LISTPTF  EQU   LISTPRM3+0  B'00000100'                                  00440000
LISTAPAR EQU   LISTPRM3+0  B'00000010'                                  00450000
LISTUSER EQU   LISTPRM3+0  B'00000001'                                  00460000
         DC    BL1'0'                                                   00470000
LISTNSUP EQU   LISTPRM3+1  B'10000000'                                  00480000
LISTDEL  EQU   LISTPRM3+1  B'01000000'                                  00490000
LISTBYP  EQU   LISTPRM3+1  B'00010000'                                  00500000
LISTERR  EQU   LISTPRM3+1  B'00001000'                                  00510000
LISTSUP3 EQU   LISTPRM3+1  B'00000100'                                  00520000
LISTSUP  EQU   LISTPRM3+1  B'00000010'                                  00530000
LISTPRM4 DS    BL1'0'                                                   00540000
LISTSEL  EQU   LISTPRM4+0  B'10000000'                                  00550000
LISTXREF EQU   LISTPRM4+0  B'01000000'                                  00560000
LISTDATE DS    0CL12                                                    00570000
LISTBDAT DS    0CL6                                                     00580000
LISTBMM  DC    XL2'0'                                                   00590000
LISTBDD  DC    XL2'0'                                                   00600000
LISTBYY  DC    XL2'0'                                                   00610000
LISTEDAT DS    0CL6                                                     00620000
LISTEMM  DC    XL2'0'                                                   00630000
LISTEDD  DC    XL2'0'                                                   00640000
LISTEYY  DC    XL2'0'                                                   00650000
LISTFL   DC    XL1'0'                                                   00660000
LISTFL80 EQU   LISTFL      B'10000000'                                  00670000
LISTFL40 EQU   LISTFL      B'01000000'                                  00680000
LISTFL20 EQU   LISTFL      B'00100000'                                  00690000
         AIF   ('&TYPE' EQ 'DC19').DC19B                                00700000
LISTFMID DC    XL7'0'                                                   00710000
         AGO   .LIST020                                                 00720000
.DC19B   ANOP  ,                                                        00730000
.LIST020 ANOP  ,                                                        00740000
         MEXIT ,                                                        00750000
.EQU     ANOP  ,                                                        00760000
LISTPARM EQU   0                                                        00770000
LISTPRM1 EQU   LISTPARM                                                 00780000
LISTCDS  EQU   LISTPRM1                                                 00790000
LISTACDS EQU   LISTPRM1                                                 00800000
LISTSCDS EQU   LISTPRM1                                                 00810000
LISTCRQ  EQU   LISTPRM1                                                 00820000
LISTACRQ EQU   LISTPRM1                                                 00830000
LISTPTS  EQU   LISTPRM1                                                 00840000
LISTLOG  EQU   LISTPRM1+1                                               00850000
LISTPRM2 EQU   LISTPARM+2                                               00860000
LISTALL2 EQU   LISTPRM2+0                                               00870000
LISTASM  EQU   LISTPRM2+0                                               00880000
LISTLMD  EQU   LISTPRM2+0                                               00890000
LISTMAC  EQU   LISTPRM2+0                                               00900000
LISTMOD  EQU   LISTPRM2+0                                               00910000
LISTSRC  EQU   LISTPRM2+0                                               00920000
LISTDLB  EQU   LISTPRM2+0                                               00930000
LISTSYS  EQU   LISTPRM2+0                                               00940000
LISTSMD  EQU   LISTPRM2+1                                               00950000
LISTFMD  EQU   LISTPRM2+1                                               00960000
LISTMCS  EQU   LISTPRM2+1                                               00970000
LISTPRM3 EQU   LISTPARM+4                                               00980000
LISTNOAP EQU   LISTPRM3                                                 00990000
LISTNOAC EQU   LISTPRM3                                                 01000000
LISTRES  EQU   LISTPRM3                                                 01010000
LISTFUNC EQU   LISTPRM3                                                 01020000
LISTPTF  EQU   LISTPRM3                                                 01030000
LISTAPAR EQU   LISTPRM3                                                 01040000
LISTUSER EQU   LISTPRM3                                                 01050000
LISTSUP  EQU   LISTPARM+5                                               01060000
LISTNSUP EQU   LISTSUP                                                  01070000
LISTDEL  EQU   LISTSUP                                                  01080000
LISTBYP  EQU   LISTSUP                                                  01090000
LISTERR  EQU   LISTSUP                                                  01100000
LISTSUP3 EQU   LISTSUP                                                  01110000
LISTPRM4 EQU   LISTPARM+6                                               01120000
LISTSEL  EQU   LISTPRM4                                                 01130000
LISTXREF EQU   LISTPRM4                                                 01140000
LISTDATE EQU   LISTPARM+7                                               01150000
LISTBDAT EQU   LISTDATE                                                 01160000
LISTEDAT EQU   LISTDATE+6                                               01170000
LISTFL   EQU   LISTPARM+19                                              01180000
LISTFL80 EQU   LISTFL                                                   01190000
LISTFL40 EQU   LISTFL                                                   01200000
LISTFL20 EQU   LISTFL                                                   01210000
LISTFMID EQU   LISTPARM+20                                              01220000
         MEND  ,                                                        01230000
