         MACRO                                                          00010000
         HMASMCRP &TYPE=EQU                                             00020000
*************************************************************           00030000
*                                                           *           00040000
*                                                           *           00050000
*                                                           *           00060000
*************************************************************           00070000
         AIF   ('&TYPE' EQ 'EQU').EQU                                   00080000
HMASMCRP DS    0CL106                                                   00090000
CRPUXNUM DC    FL1'0'                                                   00100000
         DC    XL3'0'                                                   00110000
CRPSCPAD DC    AL4(0)                                                   00120000
CRPINDS  DC    FL1'0'                                                   00130000
CRPOUTDS DC    FL1'0'                                                   00140000
CRPRETRN DC    FL1'0'                                                   00150000
         DC    XL3'0'                                                   00160000
CRPFLG1  DS    0BL2                                                     00170000
CRPBFPRM DC    BL1'0'                                                   00180000
CRPLOGCK EQU   CRPBFPRM                                                 00190000
CRPPTS   EQU   CRPBFPRM                                                 00200000
CRPLOG   EQU   CRPBFPRM                                                 00210000
CRPPRINT EQU   CRPBFPRM                                                 00220000
CRPOTHER EQU   CRPBFPRM                                                 00230000
CRPOFFST EQU   CRPBFPRM                                                 00240000
CRPSCNCL EQU   CRPBFPRM                                                 00250000
CRPEOFEN DC    BL1'0'                                                   00260000
CRPTRMEX EQU   CRPEOFEN                                                 00270000
CRPNOWPP EQU   CRPEOFEN                                                 00280000
CRPLIST  EQU   CRPEOFEN                                                 00290000
CRPRPT   EQU   CRPEOFEN                                                 00300000
CRPFLG2  DS    0BL2                                                     00310000
CRPINSW0 DS    0BL1                                                     00320000
CRPEOFSW DC    BL1'0'                                                   00330000
CRPINSW1 EQU   CRPFLG2+0                                                00340000
CRPEXADD EQU   CRPINSW1+0                                               00350000
CRPINSW2 EQU   CRPFLG2+0                                                00360000
CRPWRTLG EQU   CRPINSW2+0                                               00370000
CRPINSW3 EQU   CRPFLG2+0                                                00380000
CRPEOF1  EQU   CRPINSW3+0                                               00390000
CRPINSW4 EQU   CRPFLG2+0                                                00400000
CRPINSW5 EQU   CRPFLG2+0                                                00410000
CRPINSW6 EQU   CRPFLG2+0                                                00420000
CRPINSW7 EQU   CRPFLG2+0                                                00430000
CRPINSW8 DC    BL1'0'                                                   00440000
CRPINSW9 EQU   CRPINSW8                                                 00450000
CRPINSWA EQU   CRPINSW8                                                 00460000
CRPINSWB EQU   CRPINSW8                                                 00470000
CRPINSWC EQU   CRPINSW8                                                 00480000
CRPINSWD EQU   CRPINSW8                                                 00490000
CRPINSWE EQU   CRPINSW8                                                 00500000
CRPINSWF EQU   CRPINSW8                                                 00510000
CRPBUFFR DS    0CL80                                                    00520000
CRPBFCTL DS    0CL72                                                    00530000
CRPBFDTA DC    XL71'0'                                                  00540000
CRPBFCNT DC    XL1'0'                                                   00550000
CRPBFSEQ DC    XL8'0'                                                   00560000
CRPDDNAM DC    XL8'0'                                                   00570000
         MEXIT ,                                                        00580000
.EQU     ANOP  ,                                                        00590000
HMASMCRP EQU   0                                                        00600000
CRPSCPAD EQU   HMASMCRP+4                                               00610000
CRPINDS  EQU   HMASMCRP+8                                               00620000
CRPRETRN EQU   HMASMCRP+10                                              00630000
CRPFLG1  EQU   HMASMCRP+14                                              00640000
CRPFLG2  EQU   HMASMCRP+16                                              00650000
CRPINSW0 EQU   CRPFLG2                                                  00660000
CRPINSW1 EQU   CRPFLG2                                                  00670000
CRPINSW2 EQU   CRPFLG2                                                  00680000
CRPINSW3 EQU   CRPFLG2                                                  00690000
CRPBUFFR EQU   HMASMCRP+18                                              00700000
CRPBFCTL EQU   CRPBUFFR                                                 00710000
CRPBFDTA EQU   CRPBFCTL                                                 00720000
CRPBFCNT EQU   CRPBFCTL+71                                              00730000
CRPDDNAM EQU   HMASMCRP+98                                              00740000
CRPBFSEQ EQU   CRPBUFFR+72                                              00750000
CRPINSWF EQU   CRPFLG2+1                                                00760000
CRPINSWE EQU   CRPFLG2+1                                                00770000
CRPINSWD EQU   CRPFLG2+1                                                00780000
CRPINSWC EQU   CRPFLG2+1                                                00790000
CRPINSWB EQU   CRPFLG2+1                                                00800000
CRPINSWA EQU   CRPFLG2+1                                                00810000
CRPINSW9 EQU   CRPFLG2+1                                                00820000
CRPINSW8 EQU   CRPFLG2+1                                                00830000
CRPINSW7 EQU   CRPFLG2                                                  00840000
CRPINSW6 EQU   CRPFLG2                                                  00850000
CRPINSW5 EQU   CRPFLG2                                                  00860000
CRPINSW4 EQU   CRPFLG2                                                  00870000
CRPEOF1  EQU   CRPINSW3                                                 00880000
CRPWRTLG EQU   CRPINSW2                                                 00890000
CRPEXADD EQU   CRPINSW1                                                 00900000
CRPEOFSW EQU   CRPINSW0                                                 00910000
CRPRPT   EQU   CRPFLG1+1                                                00920000
CRPLIST  EQU   CRPFLG1+1                                                00930000
CRPNOWPP EQU   CRPFLG1+1                                                00940000
CRPTRMEX EQU   CRPFLG1+1                                                00950000
CRPEOFEN EQU   CRPFLG1+1                                                00960000
CRPSCNCL EQU   CRPFLG1                                                  00970000
CRPOFFST EQU   CRPFLG1                                                  00980000
CRPOTHER EQU   CRPFLG1                                                  00990000
CRPPRINT EQU   CRPFLG1                                                  01000000
CRPLOG   EQU   CRPFLG1                                                  01010000
CRPPTS   EQU   CRPFLG1                                                  01020000
CRPLOGCK EQU   CRPFLG1                                                  01030000
CRPBFPRM EQU   CRPFLG1                                                  01040000
CRPOUTDS EQU   HMASMCRP+9                                               01050000
CRPUXNUM EQU   HMASMCRP                                                 01060000
         MEND  ,                                                        01070000
