         MACRO                                                          00000100
         HMASMATT                                                       00000200
*************************************************************           00000300
*                                                           *           00000400
*                                                           *           00000500
*                                                           *           00000600
*************************************************************           00000700
HMASMATT DS    0XL92                                                    00000800
ATTID    DC    XL4'0'       0        X'00'                              00000900
ATTCCA   DC    A(0)         4        X'04'                              00001000
ATT08    DC    A(0)         8        X'08'                              00001100
ATT12    DC    A(0)        12        X'0C'                              00001200
ATT16    DC    A(0)        16        X'10'                              00001300
ATTDDADR DC    A(0)        20        X'14'                              00001400
ATT24    DC    XL2'0'      24        X'18'                              00001500
ATT26    DC    XL2'0'      26        X'1A'                              00001600
ATT28    DC    A(0)        28        X'1C'                              00001700
ATT32    DC    A(0)        32        X'20'                              00001800
ATTECB1  DC    A(0)        36        X'24'                              00001900
ATT40    DC    A(0)        40        X'28'                              00002000
ATTTCB   DC    A(0)        44        X'2C'                              00002100
ATTECBL  DC    2A(0)       48        X'30'                              00002200
ATT56    DC    2A(0)       56        X'38'                              00002300
ATT64    DC    H'0'        64        X'40'                              00002400
ATTRC    DC    H'0'        66        X'42'                              00002500
ATT68    DC    A(0)        68        X'44'                              00002600
ATT72    DC    X'0'        72        X'48'                              00002700
ATT73    DC    XL3'0'      73        X'49'                              00002800
ATT76    DC    X'0'        76        X'4C'                              00002900
ATT77    DC    XL3'0'      77        X'4D'                              00003000
ATT80    DC    H'0'        80        X'50'                              00003100
ATT82    DC    X'0'        82        X'52'                              00003200
ATT83    DC    X'0'        83        X'53'                              00003300
ATT84    DC    2A(0)       84        X'54'                              00003400
         MEND                                                           00003500
