         MACRO                                                          00000100
&LBL     HMASMRDP &TYPE=DC                                              00000200
*************************************************************           00000300
*                                                           *           00000400
*        READ DIRECTORY PARMETER                            *           00000500
*                                                           *           00000600
*************************************************************           00000700
         AIF   ('&TYPE' EQ 'EQU').EQU                                   00000800
HMASMRDP DS    0XL26                                                    00000900
RDPDSID  DC    FL1'0'                                                   00001000
RDPFUNCT DC    FL1'0'                                                   00001100
RDPRETRN DC    FL1'0'                                                   00001200
@NM00173 DC    FL1'0'                                                   00001300
RDPBUFAD DC    AL4(0)                                                   00001400
RDPWKAD  DC    AL4(0)                                                   00001500
RDPENTS  DC    FL4'0'                                                   00001600
RDPALLOC DC    FL4'0'                                                   00001700
RDPUSED  DC    FL4'0'                                                   00001800
RDPTYPE  DC    BL2'0'                                                   00001900
         MEXIT                                                          00002000
.EQU     ANOP  ,                                                        00002100
HMASMRDP EQU   0                                                        00002200
RDPDSID  EQU   HMASMRDP                                                 00002300
RDPFUNCT EQU   HMASMRDP+1                                               00002400
RDPRETRN EQU   HMASMRDP+2                                               00002500
RDPBUFAD EQU   HMASMRDP+4                                               00002600
RDPALLOC EQU   HMASMRDP+16                                              00002700
RDPUSED  EQU   HMASMRDP+20                                              00002800
RDPTYPE  EQU   HMASMRDP+24                                              00002900
RDPENTS  EQU   HMASMRDP+12                                              00003000
RDPWKAD  EQU   HMASMRDP+8                                               00003100
@NM00001 EQU   HMASMRDP+3                                               00003200
         MEND                                                           00003300
