*/********************************************************************/ 00050004
*/*                                                                  */ 00100004
*/*   MACRO NAME = IDABUFC                                           */ 00150004
*/*                                                                  */ 00200004
*/*   DESCRIPTIVE NAME = VSAM BUFFER CONTROL BLOCK HEADER (IDABUFDR) */ 00250004
*/*              VSAM BUFFER CONTROL BLOCK (IDABUFC)                 */ 00260004
*/*                                                                  */ 00300004
*/*   FUNCTION = THIS MACRO CONTAINS:                                */ 00350004
*/*              IDABUFDR = ORIGIN OF THE COMMON BUFFER AND THE      */ 00360004
*/*               PREFORMAT BUFFER CHAINS                            */ 00370004
*/*              IDABUFC = DESCRIBES THE BUFFER                      */ 00380004
*/*                                                                  */ 00400004
*/*   CONTROL BLOCK STRUCTURE = IDABUFDR IS POINTED TO BY IDAAMB     */ 00450004
*/*                                                                  */ 00500004
*/*   INCLUDED MACROS = NONE                                         */ 00550004
*/*                                                                  */ 00600004
*/*   METHOD OF ACCESS = PL/S - NO DECLARES NECESSARY                */ 00650004
*/*                                                                  */ 00700004
*/*   CREATED BY = VSAM OPEN                                         */ 00750004
*/*                                                                  */ 00800004
*/*   STATUS = VS/1 RELEASE 4  (CHANGE FLAG @X04SVXX)                */ 00850004
*/*                                                                  */ 00900004
*/*   DATE OF LAST CHANGE = 9 AUG 74                                 */ 00950004
*/********************************************************************/ 00960004
*  DCL 1 IDABUFDR BASED BDY(WORD),         /* BUFFER HEADER          */ 00970004
*        2 BUFDRID CHAR(1),                /* BUFFER HEADER ID      */  00980004
*        2 BUFDRNO PTR(8),                 /* NUMBER OF BUFFERS     */  00990004
*        2 BUFDRLEN FIXED(15),             /* LENGTH OF CNTL BLK    */  00992004
*        2 BUFDRPFB PTR(31),               /* FIRST PREFORMAT BUFC  */  00994004
*        2 BUFDRPFN PTR(8),                /* NO. OF PREFORMAT BUFCS*/  00996004
*        2 BUFDRCIX PTR(8),                /* NO OF COMMON IX BFRS  */  00998004
*          3 BUFDRMAX PTR(8),              /* MAX BFRS PER SEQ PLH  */  00998404
*        2 BUFDRTSB CHAR(1),               /* HDR TEST AND SET BYTE */  00998804
*        2 BUFDRFLG BIT(8),                /* BFR HEADER FLAGS      */  00999204
*          3 BUFDRREL BIT(1),              /* BFR REL FLG           */  00999604
*          3 BUFDRAVL BIT(1),              /* BFR AVAILABLE          */ 00999704
*          3 * BIT(6),                     /* UNUSED                 */ 00999804
*        2 BUFDBUFC PTR(31),               /* PTR TO 1ST BUFC@X04SVLC*/ 00999904
*        2 *        CHAR(4);               /* RESERVED              */  48000000
*/********************************************************************/ 48050004
*/* BUFFER CONTROL BLOCK                                             */ 48060004
*/********************************************************************/ 48100004
*  DCL 1 IDABUFC  BASED BDY(DWORD),        /* BUFC ENTRY     @X04SVLC*/ 48600004
*        2 BUFCAVL CHAR(1),                /* BUFFER TEST/SET BYTE  */  49200000
*          3 BUFCUCNT FIXED(8),            /* USE COUNT      @X04SVLC*/ 49250004
*        2 BUFCFLG1 BIT(8),                /* BUFC FLAGS--BYTE ONE  */  49800000
*          3 BUFCUPG BIT(1),               /* UPGRADE SET BUFC          50400004
*                                                           @X04SVLC*/  50450004
*          3 BUFCSEG BIT(1),               /* SEGMENTED REC IN BFR  */  51000000
*          3 BUFCINS BIT(1),               /* BUFC FOR INSERTS ONLY */  51600000
*          3 BUFCER1 BIT(1),               /* READ ERROR OCCURRED   */  52200000
*          3 BUFCER2 BIT(1),               /* WRITE ERROR OCCURRED  */  52800000
*          3 BUFCVAL BIT(1),               /* BUFCDDDD IS VALID     */  53400000
*          3 BUFCEXC BIT(1),               /* BFR IN EXCL CNTL      */  54000000
*          3 BUFCEPT BIT(1),               /* POST BIT               */ 54600000
*        2 BUFCIOFL BIT(8),                /* I/O MGR COMMUN FLAGS   */ 55200000
*          3 BUFCMW  BIT(1),               /* MUST WRITE THIS CINV   */ 55800000
*          3 BUFCFMT BIT(1),               /* FORMAT WRITE BUFC      */ 56400000
*          3 BUFCRRD BIT(1),               /* READ REQUIRED          */ 57000000
*          3 BUFCREAL BIT(1),              /* BUFCBAD IS A REAL ADDR */ 57600000
*          3 BUFCWC  BIT(1),               /* WRITE CHECK OPTION     */ 58200000
*          3 BUFCXEDB BIT(1),              /* NO EDB FOUND FOR RBA */   58800000
*          3 BUFCPFCP BIT(1),              /* PREFORMAT CP COMPLETE  */ 59400000
*          3 BUFCFIX  BIT(1),              /* BUFFER FIXED           */ 60000000
*        2 BUFCFLG2 BIT(8),         /* FLAG BYTE--TWO        @X04SVLC*/ 60600004
*          3 BUFCXDDR BIT(1),       /* SUPRESS DDR ON ERRORS @X04SVLC*/ 60610004
*          3 BUFCNLAS BIT(1),       /* NON-EXIST PG RD IND   @X04SVLC*/ 60620004
*          3 BUFCBSYR BIT(1),       /* BUSY READING          @X04SVLC*/ 60650004
*          3 BUFCBSYW BIT(1),       /* BUSY WRITING          @X04SVLC*/ 60700004
*          3 * BIT(4),              /* UNUSED                @X04SVLC*/ 60750004
*        2 BUFCPLH PTR(31),         /* POINTER TO PLH        @X04SVLC*/ 61200004
*          3 BUFCAMB PTR(31),       /* PTR TO AMB            @X04SVLC*/ 61210004
*        2 BUFCDDDD PTR(32),        /* INPUT RBA             @X04SVLC*/ 61800004
*        2 BUFCORBA PTR(32),        /* OUTPUT RBA            @X04SVLC*/ 63000004
*        2 BUFCCPA PTR(31),         /* CHAN PGM AREA ADDRESS @X04SVLC*/ 63600004
*        2 BUFCBAD PTR(31),         /* BUFFER ADDRESS        @X04SVLC*/ 64200004
*        2 BUFCNXT1 PTR(31),        /* NEXT BUFC IN I/O CHN  @X04SVLC*/ 64800004
*        2 BUFCINV    PTR(31),      /* INVOKERS FLD FOR ASM AND DB/DC   64804904
*                                                            @X04SVLC*/ 64805304
*          3 BUFCWLEN FIXED(15),    /* BUFC DATA LEN FOR VBP @X04SVLC*/ 64806004
*        2 BUFCDSPC   PTR(31),      /* DSPCT PTR FOR VBP.    @X04SVLC*/ 64808804
*        2 BUFCIDXL FIXED(8),       /* INDEX LEVEL           @X04SVLC*/ 64811604
*        2 BUFCNXT2 PTR(24),        /* NEXT LOGICAL BUFFER   @X04SVLC*/ 64814404
*        2 BUFXIRBA FIXED(32),      /* EXCL INPUT RBA        @X04SVLC*/ 64817204
*        2 BUFXORBA FIXED(32),      /* EXCL OUTPUT RBA       @X04SVLC*/ 64820004
*        2 BUFCHAIN PTR(31),        /* NEXT BUFC IN POOL     @X04SVLC*/ 64850004
*        2 BUFCMDBT FIXED(32),      /* MODIFICATION MASK     @X04SVLC*/ 64950004
*        2 BUFCUCUP PTR(31),        /* NXT BUFC UP USE CHN   @X04SVLC*/ 64960004
*        2 BUFCUCDN PTR(31),        /* NXT BUFC DOWN USE CHN @X04SVLC*/ 64970004
*        2 BUFCEND CHAR(0)BDY(DWORD);/* ROUND LEN TO DWORD   @X04SVLC*/ 65000004
*        DCL BUFCRSC1 CHAR(8)DEFINED(BUFCAVL);/* CDS RESOURCE           65100004
*                                                            @X04SVLC*/ 65150004
         MACRO ,                                                        90000100
         IDABUFC ,                                                      90000200
*                                                                       90000300
*         ASSEMBLER DSECT FOR BUFC/BUFDR                                90000400
*         COPIED FROM SYM601.F01 AND MANUALLY CONVERTED TO ASM          90000500
*                                                                       90000600
IDABUFDR DSECT ,                                                        90000700
BUFDRID  DS    XL1                       BUFFER HEADER ID               90000800
BUFDRNO  DS    XL1                       NUMBER OF BUFFERS              90000900
BUFDRLEN DS    XL2                       LENGTH OF CNTL BLK             90001000
BUFDRPFB DS    A                         FIRST PREFORMAT BUFC           90001100
BUFDRPFN DS    XL1                       NO. OF PREFORMAT BUFCS         90001200
BUFDRCIX DS    0XL1                      NO OF COMMON IX BFRS           90001300
BUFDRMAX DS    XL1                       MAX BFRS PER SEQ PLH           90001400
BUFDRTSB DS    XL1                       HDR TEST AND SET BYTE          90001500
BUFDRFLG DS    XL1                       BFR HEADER FLAGS               90001600
BUFDRREL EQU   X'80'                     BFR REL FLG                    90001700
BUFDRAVL EQU   X'40'                     BFR AVAILABLE                  90001800
BUFDBUFC DS    A                         PTR TO 1ST BUFC@X04SVLC        90001900
         DS    A                         RESERVED                       90002000
BUFDRLNG EQU   *-IDABUFDR                                               90002100
*                                                                       90002200
*                                                                       90002300
*                                                                       90002400
IDABUFC  DSECT ,                         BUFFER CONTROL BLOCK           90002500
BUFCRSC1 DS    0D                        CDS RESOURCE                   90002600
BUFCAVL  DS    0X                        BUFFER TEST/SET BYTE           90002700
BUFCUCNT DS    XL1                       USE COUNT                      90002800
BUFCFLG1 DS    XL1                       BUFC FLAGS--BYTE ONE           90002900
BUFCUPG  EQU   X'80'                     UPGRADE SET BUFC               90003000
BUFCSEG  EQU   X'40'                     SEGMENTED REC IN BFR           90003100
BUFCINS  EQU   X'20'                     BUFC FOR INSERTS ONLY          90003200
BUFCER1  EQU   X'10'                     READ ERROR OCCURRED            90003300
BUFCER2  EQU   X'08'                     WRITE ERROR OCCURRED           90003400
BUFCVAL  EQU   X'04'                     BUFCDDDD IS VALID              90003500
BUFCEXC  EQU   X'02'                     BFR IN EXCL CNTL               90003600
BUFCEPT  EQU   X'01'                     POST BIT                       90003700
BUFCIOFL DS    XL1                       I/O MGR COMMUN FLAGS           90003800
BUFCMW   EQU   X'80'                     MUST WRITE THIS CINV           90003900
BUFCFMT  EQU   X'40'                     FORMAT WRITE BUFC              90004000
BUFCRRD  EQU   X'20'                     READ REQUIRED                  90004100
BUFCREAL EQU   X'10'                     BUFCBAD IS A REAL ADDR         90004200
BUFCWC   EQU   X'08'                     WRITE CHECK OPTION             90004300
BUFCXEDB EQU   X'04'                     NO EDB FOUND FOR RBA           90004400
BUFCPFCP EQU   X'02'                     PREFORMAT CP COMPLETE          90004500
BUFCFIX  EQU   X'01'                     BUFFER FIXED                   90004600
BUFCFLG2 DS    XL1                       FLAG BYTE--TWO                 90004700
BUFCXDDR EQU   X'80'                     SUPRESS DDR ON ERRORS          90004800
BUFCNLAS EQU   X'40'                     NON-EXIST PG RD IND            90004900
BUFCBSYR EQU   X'20'                     BUSY READING                   90005000
BUFCBSYW EQU   X'10'                     BUSY WRITING                   90005100
BUFCPLH  DS    0A                        POINTER TO PLH                 90005200
BUFCAMB  DS    A                         PTR TO AMB                     90005300
BUFCDDDD DS    A                         INPUT RBA                      90005400
BUFCORBA DS    A                         OUTPUT RBA                     90005500
BUFCCPA  DS    A                         CHAN PGM AREA ADDRESS          90005600
BUFCBAD  DS    A                         BUFFER ADDRESS                 90005700
BUFCNXT1 DS    A                         NEXT BUFC IN I/O CHN           90005800
BUFCWLEN DS    0H                        BUFC DATA LEN FOR VBP          90005900
BUFCINV  DS    A                         INVOKERS FLD FOR ASM AND DB/DC 90006000
BUFCDSPC DS    A                         DSPCT PTR FOR VBP.             90006100
BUFCIDXL DS    X                         INDEX LEVEL                    90006200
BUFCNXT2 DS    XL3                       NEXT LOGICAL BUFFER            90006300
BUFXIRBA DS    A                         EXCL INPUT RBA                 90006400
BUFXORBA DS    A                         EXCL OUTPUT RBA                90006500
BUFCHAIN DS    A                         NEXT BUFC IN POOL              90006600
BUFCMDBT DS    A                         MODIFICATION MASK              90006700
BUFCUCUP DS    A                         NXT BUFC UP USE CHN            90006800
BUFCUCDN DS    A                         NXT BUFC DOWN USE CHN          90006900
         DS    0D                        ROUND LEN TO DWORD             90007000
BUFCLEN  EQU   *-IDABUFC                                                90007100
         MEND  ,                                                        90007200
