*/********************************************************************/ 00050004
*/*                                                                  */ 00100004
*/*   MACRO NAME = IDAEDB                                            */ 00150004
*/*                                                                  */ 00200004
*/*   DESCRIPTIVE NAME =EXTENT DEFINITION BLOCK                      */ 00250004
*/*                                                                  */ 00300004
*/*   FUNCTION = DESCRIBES LOGICAL EXTENTS OF A VSAM DATA SET        */ 00350004
*/*                                                                  */ 00450004
*/*   CONTROL BLOCK STRUCTURE = THE IDAEDB IS POINTED TO BY THE      */ 00500004
*/*              IDAAMB                                              */ 00550004
*/*                                                                  */ 00600004
*/*   INCLUDED MACROS = NONE                                         */ 00650004
*/*                                                                  */ 00700004
*/*   METHOD OF ACCESS = PL/S - NO DECLARES NECESSARY                */ 00750004
*/*                                                                  */ 00800004
*/*   CREATED BY = VSAM OPEN                                         */ 00850004
*/*                                                                  */ 00900004
*/*   STATUS = VS/1 RELEASE 4  (CHANGE FLAG @X04SVXX)                */ 00950004
*/*            VS/2 RELEASE 3  (CHANGE FLAG @Y30SDXX)                */ 01050004
*/*                                                                  */ 01060004
*/*   DATE OF LAST CHANGE = 30 AUG 74                                */ 01100004
*/*                                                                  */ 01150004
*/********************************************************************/ 01200004
*/********************************************************************/ 01250004
*/* EXTENT DEFINITION BLOCK HEADER                                   */ 01300004
*/********************************************************************/ 01350004
*        DCL 1 IDAEDBHD BASED,                                          42000000
*              2 EDBID       PTR(8),    /* EDB IDENTIFIER           */  43000000
*              2 EDBNO       PTR(8),    /* NUMBER OF ENTRIES        */  44000000
*              2 EDBLEN      FIXED(15), /* LENGTH OF ENTRY          */  45000000
*              2 EDBLPMBC    PTR(31);   /* PTR TO FIRST LPMB        */  46000000
*/********************************************************************/ 46050004
*/* EXTENT DEFINITION BLOCK                                          */ 46060004
*/********************************************************************/ 46100004
*        DCL 1 IDAEDB BASED,            /* ENTRY DEFINITION         */  47000000
*              2 *           CHAR(2),   /* NOT USED          @Y30DSJH*/ 48000004
*              2 EDBFLG1     BIT(8),    /* EDB FLAGS FOR MVM @Y30DSJH*/ 48002004
*                3 EDBLKR    BIT(1),    /* CATLG LOW KEY RNG @Y30DSJH*/ 48004004
*                3 EDBTOFLW  BIT(1),    /* TRACK OVERFLOW    @Y30DSJH*/ 48006004
*                3 EDBPSDS   BIT(1),    /* PAGE SPACE D.S.   @Y30DSJH*/ 48008004
*                3 *         BIT(5),    /* UNUSED            @Y30DSJH*/ 48010004
*              2 EDBM        PTR(8),    /* ENTENT NUMBER            */  49000000
*              2 EDBLPMBA    PTR(31),   /* ADDRESS OF LPMB          */  50000000
*              2 EDBSTTRK    PTR(31),   /* EXTENT RELATIVE TRK ADDR */  51000000
*              2 EDBLORBA    PTR(32),   /* LO RBA LIMIT             */  52000000
*              2 EDBHIRBA    PTR(32),   /* HI RBA LIMIT             */  53000004
*              2 EDBTKBAL    FIXED(31); /* MVM TRACK BAL CTR @Y30DSJH*/ 53002004
         MACRO ,                                                        90000100
         IDAEDB ,                                                       90000200
*                                                                       90000300
*         ASSEMBLER DSECT FOR EDB                                       90000400
*         COPIED FROM SYM601.F01 AND MANUALLY CONVERTED TO ASM          90000500
*                                                                       90000600
IDAEDBHD DSECT ,                         EXTENT DEFINITION BLOCK HEADER 90000700
EDBID    DS    XL1                       EDB IDENTIFIER=X'90'           90000800
EDBIDC   EQU   X'90'                                                    90000900
EDBNO    DS    XL1                       NUMBER OF ENTRIES              90001000
EDBLEN   DS    H                         LENGTH OF ENTRY                90001100
EDBLPMBC DS    A                         POINTER TO FIRST LPMB          90001200
EDBHDLEN EQU   *-IDAEDBHD                                               90001300
*                                                                       90001400
*                                                                       90001500
*                                                                       90001600
IDAEDB   DSECT ,                         EXTENT DEFINITION BLOCK        90001700
         DS    CL2                       NOT USED                       90001800
EDBFLG1  DS    X                         EDB FLAGS FOR MVM              90001900
EDBLKR   EQU   X'80'                     CATLG LOW KEY RNG              90002000
EDBTOFLW EQU   X'40'                     TRACK OVERFLOW                 90002100
EDBPSDS  EQU   X'20'                     PAGE SPACE D.S.                90002200
EDBM     DS    XL1                       EXTENT NUMBER                  90002300
EDBLPMBA DS    A                         ADDRESS OF LPMB                90002400
EDBSTTRK DS    A                         EXTENT RELATIVE TRK ADDR       90002500
EDBLORBA DS    A                         LO RBA LIMIT                   90002600
EDBHIRBA DS    A                         HI RBA LIMIT                   90002700
EDBTKBAL DS    A                         MVM TRACK BAL CTR              90002800
EDBLENG  EQU   *-IDAEDB                                                 90002900
         MEND  ,                                                        90003000
