*/********************************************************************/ 00050004
*/*                                                                  */ 00100004
*/*   MACRO NAME = IDALPMB                                           */ 00150004
*/*                                                                  */ 00200004
*/*   DESCRIPTIVE NAME = LOGICAL TO PHYSICAL MAPPING BLOCK           */ 00250004
*/*                                                                  */ 00300004
*/*   FUNCTION = USED TO MAP THE PHYSICAL ATTRIBUTES OF A VSAM DATA  */ 00350004
*/*                SET                                               */ 00352004
*/*                                                                  */ 00400004
*/*   CONTROL BLOCK STRUCTURE = POINTED TO BY THE IDAEDB             */ 00450004
*/*                                                                  */ 00500004
*/*   INCLUDED MACROS = NONE                                         */ 00550004
*/*                                                                  */ 00600004
*/*   METHOD OF ACCESS = PL/S - NO DECLARES NECESSARY                */ 00650004
*/*                                                                  */ 00700004
*/*   CREATED BY = VSAM OPEN                                         */ 00750004
*/*                                                                  */ 00800004
*/*   STATUS = VS/1 RELEASE 4  (CHANGE FLAG @X04SVXX)                */ 00850004
*/*                                                                  */ 00900004
*/*   DATE OF LAST CHANGE = 13 AUG 74                                */ 00950004
*/*                                                                  */ 01000004
*/********************************************************************/ 01050004
*  DCL 1 IDALPMB BASED,                    /* LOGICAL TO PHYSICAL  */   02000000
*                                          /* MAPPING BLOCK        */   04000000
*        2 LPMBID CHAR(1),                 /* LPMB IDENTIFER       */   06000000
*        2 LPMBFLGS BIT(8),                /* FLAG BYTE ONE        */   08000000
*          3 LPMBRPS BIT(1),               /* ON FOR RPS DEVICE    */   10000000
*          3 LPMREPL BIT(1),               /* REPLICATED RECORDS   */   12000000
*          3 LPMSS   BIT(1),               /* SEQUENCE SET W/DATA  */   14000000
*          3 LPMBTOFL BIT(1),              /* MVM TRK OFLOW  @Y30DSJH*/ 14002004
*          3 LPMBSSTH BIT(1),              /* ON--SET SECTOR TABLE      14002400
*                                             IS HERE        @X04SVMR*/ 14002800
*          3 *        BIT(3),              /* UNUSED         @Y30DSJH*/ 14004000
*        2 LPMBLEN FIXED(15),              /* LENGTH OF LPMB       */   16000000
*        2 LPMAUSZ FIXED(31),              /* BYTES PER ALLOC UNIT */   18000000
*        2 LPMBPTRK FIXED(31),             /* BYTES PER TRACK      */   20000000
*        2 LPMBLKSZ FIXED(31),             /* PHYSICAL BLOCKSIZE   */   22000000
*        2 LPMTRKAU FIXED(15),             /* TRACKS PER ALLOC UNIT*/   24000000
*        2 LPMTPC FIXED(15),               /* TRACKS PER CYLINDER  */   26000000
*        2 LPMBLKTR FIXED(15),             /* BLOCKS PER TRACK     */   28000000
*        2 * FIXED(15),                    /* NOT USED       @X04SVLC*/ 30000004
*        2 LPMBEXT PTR(31),                /* RESERVED FOR PTR TO LPMB  30050004
*                                             EXTENSION WHEN DEFINED    30100000
*                                                            @X04SVLC*/ 30110004
*        2 LPMBSST CHAR(*);                /* SET SECTOR TAB @X04SVLC*/ 30200004
         MACRO ,                                                        90000100
         IDALPMB ,                                                      90000200
*                                                                       90000300
*         ASSEMBLER DSECT FOR LPMB                                      90000400
*         COPIED FROM SYM601.F01 AND MANUALLY CONVERTED TO ASM          90000500
*                                                                       90000600
IDALPMB  DSECT ,                         LOGICAL TO PHYSICAL            90000700
LPMBID   DS    XL1                       LPMB IDENTIFER                 90000800
LPMBFLGS DS    XL1                       FLAG BYTE ONE                  90000900
LPMBRPS  EQU   X'80'                     ON FOR RPS DEVICE              90001000
LPMREPL  EQU   X'40'                     REPLICATED RECORDS             90001100
LPMSS    EQU   X'20'                     SEQUENCE SET W/DATA            90001200
LPMBTOFL EQU   X'10'                     MVM TRK OFLOW                  90001300
LPMBSSTH EQU   X'08'                     ON--SET SECTOR TABLE IS HERE   90001400
LPMBLEN  DS    H                         LENGTH OF LPMB                 90001500
LPMAUSZ  DS    A                         BYTES PER ALLOC UNIT           90001600
LPMBPTRK DS    A                         BYTES PER TRACK                90001700
LPMBLKSZ DS    A                         PHYSICAL BLOCKSIZE             90001800
LPMTRKAU DS    H                         TRACKS PER ALLOC UNIT          90001900
LPMTPC   DS    H                         TRACKS PER CYLINDER            90002000
LPMBLKTR DS    H                         BLOCKS PER TRACK               90002100
         DS    H                         NOT USED                       90002200
LPMBEXT  DS    A                         RESERVED FOR PTR TO LPMB       90002300
*                                        EXTENSION WHEN DEFINED         90002400
LPMBSST  DS    0X                        SET SECTOR TAB                 90002500
LPMBLENG EQU   *-IDALPMB                                                90002600
         MEND  ,                                                        90002700
