*/********************************************************************/ 00050004
*/*                                                                  */ 00100004
*/*   MACRO NAME = IDAVSRT                                           */ 00150004
*/*                                                                  */ 00200004
*/*   DESCRIPTIVE NAME = VSAM SHARED RESOURCE TABLE.                 */ 00250004
*/*                                                                  */ 00300004
*/*   FUNCTION = THE VSRT CONTAINS POINTERS TO BUFFER AND PLH POOLS  */ 00350004
*/*              AS WELL AS POINTERS TO VARIOUS BLOCKS BUILT BY THE  */ 00400004
*/*              BLDVRP ROUTINES.                                    */ 00450004
*/*                                                                  */ 00500004
*/*   CONTROL BLOCK STRUCTURE = CHAINED OFF THE VAT (LSR OPTION) OR  */ 00510004
*/*                             THE AMCBS (GSR OPTION).              */ 00520004
*/*                                                                  */ 00530004
*/*   INCLUDED MACROS = NONE                                         */ 00540004
*/*                                                                  */ 00542004
*/*   METHOD OF ACCESS = PL/S - RESPECIFY IDAVSRT BASED.             */ 00544004
*/*                                                                  */ 00546004
*/*   CREATED BY: VSAM OPEN MODULE IDA0192Y.                         */ 00548004
*/*                                                                  */ 00548404
*/*   STATUS = VS2 RELEASE 4.                                @Z40ESSR*/ 00548804
*/*                                                                  */ 00549204
*/*   DATE OF LAST CHANGE = 31 JAN. 75.                      @Z40ESSR*/ 00549604
*/*                                                                  */ 00570003
*/********************************************************************/ 00580003
*   DCL 1 IDAVSRT BASED BDY (WORD), /* VSAM SHARED RESOURCE POOL     */ 00590003
*       2 VSRTBKID CHAR (1),        /* BLOCK ID                      */ 00600004
*       2 VSRTKEY FIXED(8),         /* KEY OF GSR USER       @Z40ESSR*/ 00650004
*       2 VSRTLEN FIXED (15),       /* VSRT LENGTH IN BYTES          */ 00700004
*       2 VSRTID CHAR (8),          /* BLOCK IDENTIFIER              */ 00750004
*       2 VSRTFLGS,                 /* FLAG BYTES                    */ 00800004
*         3 VSRTGSRF BIT (1),       /* ON INDICATES GSR OPTION       */ 00850004
*         3 VSRTLSRF BIT (1),       /* ON INDICATES LSR OPTION       */ 00900004
*         3 VSRTIOBF BIT (1),       /* ON INDICATES IOB'S FIXED      */ 00910004
*         3 VSRTBFRF BIT (1),       /* ON INDICATES BUFFERS FIXED    */ 00920004
*         3 * BIT (12),             /* RESERVED                      */ 00950004
*       2 VSRTKL FIXED (8),         /* MAX KEY LENGTH                */ 01000004
*       2 VSRTSTRN FIXED (8),       /* STRNO FROM BLDVRP MACRO       */ 01050004
*       2 VSRTPLHH PTR (31),        /* POINTER TO PLH HEADER         */ 01100004
*       2 VSRTBUFH PTR (31),        /* POINTER TO BUFFER HEADER      */ 01150004
*       2 VSRTCPAH PTR (31),        /* POINTER TO CPA HEADER         */ 01200004
*       2 VSRTWAH PTR (31),         /* POINTER TO WORKAREA HEADER    */ 01250004
*       2 VSRTVIOT PTR (31),        /* POINTER TO VIOT (0 IN VS1)    */ 01300004
*       2 VSRTASCB PTR(31),     /* ADDRS OF ORIGINATING ASCB IF GSR. */ 01310003
*       2 VSRTNEXT PTR(31),         /* ADDR OF NEXT VSRT             */ 01320004
*       2 VSRTCSL (*),              /* ENTRIES FOR GOTTEN STORAGE    */ 01350004
*         3 VSRTCSLF,               /* FLAGS                         */ 01400004
*           4 VSRTCSFX BIT (1),     /* ON INDICATES FIXED STORAGE    */ 01450004
*           4 VSRTCSVS BIT (1),     /* INDICATES BLOCK IS VSRT       */ 01500004
*           4 VSRTCSBF BIT (1),     /* INDICATES BLOCK IS BUFFER     */ 01550004
*             5 VSRTCSGT BIT(1), /*GSR KEY(VSRTKEY) CORE IND @Z40ESSR*/ 01560004
*           4 VSRTCSPF BIT (1),     /* INDICATES  PFL BLOCK          */ 01600004
*             5 VSRTCSVG BIT(1),    /* INDIC VGTT PREFIX BLK @Z30SSDP*/ 01610003
*           4 VSRTCSWS BIT (1),     /* INDICATES BLOCK IS WORKING       01650004
*                                      STORAGE                       */ 01660004
*           4 VSRTCSPL BIT (1),     /* INDICATES BLOCK IS PLH'S      */ 01670004
*           4 VSRTCSIO BIT (1),     /* INDICATES BLOCK IS IOB'S      */ 01680004
*           4 VSRTCSBH BIT (1),     /* INDICATES BLOCK IS BUFFER     */ 01690004
*         3 VSRTCSAD PTR (24),      /* POINTER TO GOTTEN STORAGE     */ 01700004
*         3 VSRTCSSP FIXED (8),     /* SUBPOOL NUMBER                */ 01750004
*         3 VSRTCSLN FIXED (24);    /* LENGTH OF GOTTEN STORAGE      */ 01800003
         MACRO ,                                                        90000100
         IDAVSRT  ,                                                     90000200
*                                                                       90000300
*         ASSEMBLER DSECT FOR VSRT                                      90000400
*         COPIED FROM SYM601.F01 AND MANUALLY CONVERTED TO ASM          90000500
*                                                                       90000600
IDAVSRT  DSECT ,                         VSAM SHARED RESOURCE POOL      90000700
VSRTBKID DS    XL1                       BLOCK ID =X'15'                90000800
IDXVSRT  EQU   X'15'                     BLOCK ID                       90000900
VSRTKEY  DS    XL1                       KEY OF GSR USER                90001000
VSRTLEN  DS    H                         VSRT LENGTH IN BYTES           90001100
VSRTID   DS    CL8                       BLOCK IDENTIFIER               90001200
VSRTFLGS DS    XL2                       FLAG BYTES                     90001300
VSRTGSRF EQU   X'80'                     ON INDICATES GSR OPTION        90001400
VSRTLSRF EQU   X'40'                     ON INDICATES LSR OPTION        90001500
VSRTIOBF EQU   X'20'                     ON INDICATES IOB'S FIXED       90001600
VSRTBFRF EQU   X'10'                     ON INDICATES BUFFERS FIXED     90001700
VSRTKL   DS    XL1                       MAX KEY LENGTH                 90001800
VSRTSTRN DS    XL1                       STRNO FROM BLDVRP MACRO        90001900
VSRTPLHH DS    A                         POINTER TO PLH HEADER          90002000
VSRTBUFH DS    A                         POINTER TO BUFFER HEADER       90002100
VSRTCPAH DS    A                         POINTER TO CPA HEADER          90002200
VSRTWAH  DS    A                         POINTER TO WORKAREA HEADER     90002300
VSRTVIOT DS    A                         POINTER TO VIOT (0 IN VS1)     90002400
VSRTASCB DS    A                         ADR OF ORIGINATING ASCB IF GSR 90002500
VSRTNEXT DS    A                         ADDR OF NEXT VSRT              90002600
VSRTCSL  DS    0XL8                      ENTRIES FOR GOTTEN STORAGE     90002700
VSRTCSLF DS    XL1                       FLAGS                          90002800
VSRTCSFX EQU   X'80'                     ON INDICATES FIXED STORAGE     90002900
VSRTCSVS EQU   X'40'                     INDICATES BLOCK IS VSRT        90003000
VSRTCSBF EQU   X'20'                     INDICATES BLOCK IS BUFFER      90003100
VSRTCSGT EQU   X'20'                     GSR KEY(VSRTKEY) CORE IND      90003200
VSRTCSPF EQU   X'10'                     INDICATES  PFL BLOCK           90003300
VSRTCSVG EQU   X'10'                     INDIC VGTT PREFIX BLK          90003400
VSRTCSWS EQU   X'08'                     INDICATES BLOCK IS WORKING     90003500
*                                        STORAGE                        90003600
VSRTCSPL EQU   X'04'                     INDICATES BLOCK IS PLH'S       90003700
VSRTCSIO EQU   X'02'                     INDICATES BLOCK IS IOB'S       90003800
VSRTCSBH EQU   X'01'                     INDICATES BLOCK IS BUFFER      90003900
VSRTCSAD DS    XL3                       POINTER TO GOTTEN STORAGE      90004000
VSRTCSSP DS    XL1                       SUBPOOL NUMBER                 90004100
VSRTCSLN DS    XL3                       LENGTH OF GOTTEN STORAGE       90004200
VSRTLENG EQU   *-IDAVSRT                                                90004300
         MEND  ,                                                        90004400
