*   /*****************************************************************/ 00100000
*   /*                                                               */ 00200000
*   /* THE VIOT (VALID IOMB TABLE) CONTAINS THE ADDRESS OF EACH      */ 00300000
*   /* VALID IOMB WITHIN THE SHARED RESOURCE POOL.  THIS BLOCK IS    */ 00400000
*   /* POINTED TO BY THE VSRT AND BY ALL AMB'S UTILIZING THE SHARED  */ 00500000
*   /* RESOURCE POOL.  THE VIOT IS ONLY DEFINED FOR VS2.             */ 00600000
*   /*                                                               */ 00700000
*   /* VS2 RELEASE 3, 4/30/74, LEVEL=0                               */ 00800000
*   /*                                                               */ 00900000
*   /* METHOD OF ACCESS - RESPECIFY IDAVIOT AND VIOPTR BASED.        */ 01000000
*   /*                                                               */ 01100000
*   /*****************************************************************/ 01200000
*   DCL 1 IDAVIOT BASED BDY(WORD),  /* VALID IOMB TABLE              */ 01300000
*         2 VIOHDR,                 /* CONTROL BLOCK HEADER          */ 01400000
*           3 VIOID  CHAR(1),       /* BLOCK ID - CONSTANT X'16'     */ 01500000
*           3 *      CHAR(1),       /* RESERVED                      */ 01600000
*           3 VIOLEN FIXED(15);     /* LENGTH OF VIOT                */ 01700000
*   DCL VIOPTR BASED PTR(31);       /* PTR TO VALID IOMB             */ 01800000
         MACRO ,                                                        90000100
         IDAVIOT ,                                                      90000200
*                                                                       90000300
*         ASSEMBLER DSECT FOR VIOT                                      90000400
*         COPIED FROM SYM601.F01 AND MANUALLY CONVERTED TO ASM          90000500
*                                                                       90000600
IDAVIOT  DSECT ,                         VALID IOMB TABLE               90000700
VIOHDR   DS    0F                        CONTROL BLOCK HEADER           90000800
VIOID    DS    XL1                       BLOCK ID - CONSTANT X'16'      90000900
*        DS    XL1                       RESERVED                       90001000
VIOLEN   DS    H                         LENGTH OF VIOT                 90001100
VIOLENG  EQU   *-IDAVIOT                                                90001200
VIOPTR   DS    A                         LIST IF VALID IOMB ADDRESSES   90001300
         MEND  ,                                                        90001400
