         MACRO                                                          00000100
         IKJEGTWA ,                                                     00000200
***************************************************************         00000300
*                                                             *         00000400
*       TEST WORK AREA POINTED TO BY LWATEST                  *         00000500
*                                                             *         00000600
***************************************************************         00000700
TSWA     DSECT ,                                                        00000800
         DS    A                                                        00000900
TSWAECB  DS    A                                                        00001000
TSWATCB  DS    A                                                        00001100
         DS    A                                                        00001200
TSWAFLG  DS    X                                                        00001300
TSWAFL80 EQU   X'80'                                                    00001400
TSWAFL40 EQU   X'40'                                                    00001500
         MEND                                                           00001600
