         MACRO                                                          00010000
         ILRPCT  &PLS=YES                                               00020000
         AIF   ('&PLS' EQ 'NO').PLS010                                  00030000
PCT      EQU   0          PERFORMANCE CHARACTERISTICS TABLE             00040000
PCTID    EQU   PCT        'PCT ' IDENTIFIER                             00050000
PCTDTYPE EQU   PCT+4      DEVICE TYPE (EBCDIC)                          00060000
PCTSMAX  EQU   PCT+10     DEVICE MAX SLOTS                              00070000
PCTDTYPX EQU   PCT+12     DEVICE TYPE                                   00080000
PCTCYLSZ EQU   PCT+14     SLOTS PER CYLINDER                            00090000
PCTNEXT  EQU   PCT+16     CHAIN PTR FOR QUEUE OF PCTS BASED IN PART     00100000
PCTDMASK EQU   PCT+20     MASK TO PRESET NON-EXISTING SLOTS             00110000
PCTDPGWT EQU   PCT+28     PAGING WEIGHT FOR THIS DEVICE TYPE            00120000
PCTSSECN EQU   PCT+30     NUMBER OF UNIQUE SET SECTOR VALUES            00130000
PCTRQTIM EQU   PCT+32     MIN TIME TO READ OR WRITE ONE 4096-BYTE SLOT  00140000
PCTMAXTK EQU   PCT+36     MAXIMUM RELATIVE TRACK POSITION               00150000
PCTMSSB  EQU   PCT+38     MINIMUM BYTE VARIANCE TO INSERT SET SECTOR    00160000
PCTABLE  EQU   PCT+40     SECTOR VALUE TABLE                            00170000
PCTSECT  EQU   PCTABLE    TABLE OF SECTOR VALUES FOR THIS DEVICE TYPE   00180000
PCTSLTNM EQU   PCTSECT    RELATIVE SLOT NUMBER ON CYL                   00190000
PCTSECNM EQU   PCTSECT+1  X'80' = OVERFLOW TRACK                        00200000
PCTSLOT  EQU   PCTSLTNM   SLOT NUMBER (0-X'7F')                         00210000
PCTFOVFL EQU   PCTSLTNM   SECTOR VALUE CORRESPONDING TO SLOT NUMBER     00220000
PCTTRBA  EQU   PCTSECT+2  REL BYTE ON TRACK                             00230000
         MEXIT                                                          00240000
.PLS010  ANOP                                                           00250000
PCT      DSECT ,          PERFORMANCE CHARACTERISTICS TABLE             00260000
PCTID    DS    CL4        'PCT ' IDENTIFIER                             00270000
PCTDTYPE DS    CL6        DEVICE TYPE (EBCDIC)                          00280000
PCTSMAX  DS    H          DEVICE MAX SLOTS                              00290000
PCTDTYPX DS    H          DEVICE TYPE                                   00300000
PCTCYLSZ DS    H          SLOTS PER CYLINDER                            00310000
PCTNEXT  DS    A          CHAIN PTR FOR QUEUE OF PCTS BASED IN PART     00320000
PCTDMASK DS    XL8        MASK TO PRESET NON-EXISTING SLOTS             00330000
PCTDPGWT DS    H          PAGING WEIGHT FOR THIS DEVICE TYPE            00340000
PCTSSECN DS    H          NUMBER OF UNIQUE SET SECTOR VALUES            00350000
PCTRQTIM DS    F          MIN TIME TO READ OR WRITE ONE 4096-BYTE SLOT  00360000
PCTMAXTK DS    H          MAXIMUM RELATIVE TRACK POSITION               00370000
PCTMSSB  DS    H          MINIMUM BYTE VARIANCE TO INSERT SET SECTOR    00380000
PCTABLE  DS    0X         SECTOR VALUE TABLE                            00390000
PCTSECT  DS    0X         TABLE OF SECTOR VALUES FOR THIS DEVICE TYPE   00400000
PCTSLTNM DS    X          RELATIVE SLOT NUMBER ON CYL                   00410000
PCTSECNM EQU   X'80'      OVERFLOW TRACK                                00420000
PCTSLOT  EQU   X'7F'      SLOT NUMBER (0-X'7F')                         00430000
PCTFOVFL DS    X          SECTOR VALUE CORRESPONDING TO SLOT NUMBER     00440000
PCTTRBA  DS    H          REL BYTE ON TRACK                             00450000
         MEND                                                           00460000
