         MACRO                                                          00050046
&LABEL   IOSUNHLD   &OPERAND,&SAVE                                      00100046
         AIF     ('&LABEL' EQ '').S0                                    00150046
&LABEL   DS    0H                                                       00200046
.S0      ANOP                                                           00250046
****************************************************************        00300046
*                                                              *        00350046
*        IOSUNHLD WILL UNHOLD ALL REQUESTS FOR A DEVICE.       *        00400046
*                                                              *        00450046
****************************************************************        00500046
.*                                                             *        00550046
.*       IOSUNHLD SHOULD BE USED ONLY IN THE SIO EXIT.         *        00600046
.*       THE OPERAND 'ALL' MUST BE SPECIFIED.  THE SECOND      *        00650046
.*       OPERAND CAN BE 'SAVE' OR CAN BE OMITTED. REGISTERS    *        00700046
.*       14 AND 15 ARE USED IN THE MACRO EXPANSION TO CALL     *        00750046
.*       THE SUBROUTINE.  IF 'SAVE' IS SPECIFIED THESE REGIS-  *        00800046
.*       TERS WILL BE SAVED AND RESTORED; IF NO SECOND OPER-   *        00850046
.*       AND IS CODED, THE REGISTERS ARE NOT SAVED.            *        00900046
.*       IOSSIO WITH THE 'ENTRY' OPERAND AND A DSECT FOR       *        00950046
.*       IOCOM MUST BE INCLUDED IN THE SAME ASSEMBLY           *        01000046
.*       WITH IOSUNHLD.                                        *        01050046
.*                                                             *        01100046
.***************************************************************        01150046
         AIF        ('&OPERAND' NE 'ALL').S3 OPERAND ALL?               01200046
         AIF        ('&SAVE' EQ 'SAVE').S1 REGS 14 & 15 USED            01250046
         AIF        (N'&SYSLIST EQ 1).S2  REGS14 & 15 NOT USED          01300046
.S05     IHBERMAC   1007,ALL            *INVALID OPERAND FOR            01350046
.*                                      *ALL OPTION                     01400046
         MEXIT                                                          01450046
.S1      AIF        (N'&SYSLIST GT 2).S05                               01500046
         ST    14,64(,SAVER)       * SAVE                               01550046
         ST    15,68(,SAVER)       * REGISTERS                          01600046
         L     15,IOCUNHLD-IOCOM(,IOCOMR) * GO TO OF UNHOLD RTN         01650046
         BALR  14,15                      * WITH RETURN                 01700046
         L     14,64(,SAVER)       * RESTORE                            01750046
         L     15,68(,SAVER)       * REGISTERS                          01800046
         MEXIT                                                          01850046
.S2      L     15,IOCUNHLD-IOCOM(,IOCOMR) * GO TO OF UNHOLD RTN         01900046
         BALR  14,15                      * WITH RETURN                 01950046
         MEXIT                                                          02000046
.S3      IHBERMAC  1006,ALL               * ALL OPERAND REQUIRED        02050046
.*                                        * NOT SPECIFIED               02100046
         MEND                                                           02150046
