         MACRO  ,                                                       00010000
         IQAAOS &DSECT=YES,&ENTRY=                                      00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************        PROCESSOR ENTRY              **************** 00070001
*********************************************************************** 00080000
*********************************************************************** 00090000
*                                                                     * 00100000
* FUNCTION:                                                           * 00110000
*    PROCESSOR ENTRY                                                  * 00120001
*    ADDRESSABLE FROM DSVAVT -> IQAAVT -> IQAAOS ENTRIES BY CPUID     * 00130001
*                                                                     * 00140000
*********************************************************************** 00150000
         LCLC  &P                                                       00160000
         AIF   ('&DSECT' EQ 'YES').DSECT                                00170000
&P       SETC  'AOS'.'&ENTRY'                                           00180000
IQA&P    DC    0F'0'                                                    00190000
         AGO   .NDSECT                                                  00200000
.DSECT   ANOP  ,                                                        00210000
&P       SETC  'AOS'                                                    00220000
AOS      DSECT ,                                                        00230000
.NDSECT  ANOP  ,                                                        00240000
&P.ID    DC    C'AOS'                                                   00250000
&P.003   DC    X'0'                                                     00260004
         AIF   ('&DSECT' NE 'YES').NEQU003                              00270009
&P.00380 EQU   X'80'                                                    00280006
&P.00340 EQU   X'40'                                                    00290006
&P.00320 EQU   X'20'                                                    00300006
&P.00310 EQU   X'10'                                                    00310006
&P.00308 EQU   X'08'                                                    00320006
&P.00304 EQU   X'04'                                                    00330006
&P.00302 EQU   X'02'                                                    00340006
&P.00301 EQU   X'01'                                                    00350006
.NEQU003 ANOP  ,                                                        00360009
&P.004   DC    14A(0)                  (R0,R13)                         00370004
&P.03C   DC    A(0)                                                     00380004
&P.040   DC    A(0)                    TCBGRS                           00390004
&P.044   DC    15A(0)                  TCBGRS                           00400004
&P.080   DC    A(0)                                                     00410004
&P.084   DC    A(0)                    C5D8E440                         00420004
&P.088   DC    D'0'                                                     00430004
&P.090   DC    D'0'                                                     00440004
&P.098   DC    D'0'                                                     00450004
&P.0A0   DC    D'0'                                                     00460004
&P.0A8   DC    D'0'                                                     00470004
&P.0B0   DC    D'0'                                                     00480004
&P.0B8   DC    D'0'                                                     00490004
&P.0C0   DC    D'0'                                                     00500004
&P.0C8   DC    0D'00',A(0)             FLCPOPSW                         00510007
&P.0CC   DC    A(0)                                                     00520004
&P.0D0   DC    A(0)                                                     00530004
&P.0D4   DC    A(0)                                                     00540004
&P.0D8   DC    A(0)                                                     00550004
&P.0DC   DC    A(0)                                                     00560004
&P.0E0   DC    A(0)                                                     00570004
&P.0E4   DC    A(0)                                                     00580004
&P.0E8   DC    A(0)                                                     00590004
&P.0EC   DC    A(0)                                                     00600004
&P.0F0   DC    X'FFFFFFFF'                                              00610004
&P.0F4   DC    A(0)                                                     00620004
&P.0F8   DC    A(0)                                                     00630004
&P.0FC   DC    A(0)                                                     00640004
&P.100   DC    D'0'                                                     00650004
&P.108   DC    0D'00',A(0)                                              00660004
&P.10C   DC    A(0)                                                     00670004
&P.110   DC    A(0)                                                     00680004
&P.114   DC    A(0)                                                     00690004
&P.118   DC    A(0)                                                     00700004
&P.11C   DC    A(0)                                                     00710004
&P.120   DC    A(0)                                                     00720004
&P.124   DC    XL8'0'                                                   00730004
&P.12C   DC    X'0'   ****************                                  00740004
&P.12D   DC    X'0'                  *                                  00750004
&P.12E   DC    X'0'                  *                                  00760004
&P.12F   DC    X'0'                  *                                  00770004
&P.130   DC    A(0)   ****************                                  00780004
&P.134   DC    X'0'                                                     00790004
&P.135   DC    X'0'                                                     00800004
&P.136   DC    X'0'                                                     00810004
&P.137   DC    X'0'                                                     00820004
&P.138   DC    A(0)                                                     00830004
&P.13C   DC    X'0'                                                     00840004
&P.13D   DC    XL3'0'                                                   00850004
&P.140   DC    XL20'0'                                                  00860004
&P.154   DC    XL8'0'                                                   00870004
         AIF   ('&DSECT' EQ 'YES').ENT1C                                00880000
&P.15C   DC    V(IQAWQL&ENTRY)                                          00890004
         AGO   .ENT1D                                                   00900000
.ENT1C   ANOP  ,                                                        00910000
&P.15C   DC    A(0)                    V(IQAWQL0/1)                     00920004
.ENT1D   ANOP  ,                                                        00930000
&P.160   DC    0D'0',A(0)                                               00940004
&P.164   DC    A(0)                                                     00950004
&P.168   DC    0D'0',A(0)                                               00960004
&P.16C   DC    A(0)                                                     00970004
&P.170   DC    0D'0',A(0)              X'040C'                          00980004
&P.174   DC    A(0)                    A(CVT0DS)                        00990004
&P.178   DC    0D'0',A(0)                                               01000004
&P.17C   DC    A(0)                                                     01010004
&P.180   DC    A(0)                                                     01020004
&P.184   DC    X'0'                                                     01030004
&P.185   DC    X'0'                                                     01040004
&P.186   DC    H'0'                                                     01050004
&P.188   DC    A(0)                                                     01060004
&P.18C   DC    A(0)                                                     01070004
&P.190   DC    A(0)                                                     01080004
&P.194   DC    A(0)                                                     01090004
&P.198   DC    A(0)                                                     01100004
&P.19C   DC    A(0)                                                     01110004
&P.1A0   DC    A(0)                                                     01120004
&P.1A4   DC    A(0)                                                     01130004
&P.1A8   DC    A(0)                    X'FFFFF801'                      01140004
&P.1AC   DC    A(0)                    IQAOIE00.A000184                 01150004
&P.1B0   DC    X'00'                                                    01160004
         AIF   ('&DSECT' NE 'YES').NEQU1B0                              01170009
&P.1B080 EQU   X'80'                                                    01180009
&P.1B040 EQU   X'40'                                                    01190009
&P.1B020 EQU   X'20'                                                    01200009
&P.1B010 EQU   X'10'                                                    01210009
&P.1B008 EQU   X'08'                                                    01220009
&P.1B004 EQU   X'04'                                                    01230009
&P.1B002 EQU   X'02'                                                    01240009
&P.1B001 EQU   X'01'                                                    01250009
.NEQU1B0 ANOP  ,                                                        01260009
&P.1B1   DC    X'00'                                                    01270004
         AIF   ('&DSECT' NE 'YES').NEQU1B1                              01280009
&P.1B180 EQU   X'80'                                                    01290009
&P.1B140 EQU   X'40'                                                    01300009
&P.1B120 EQU   X'20'                                                    01310009
&P.1B110 EQU   X'10'                                                    01320009
&P.1B108 EQU   X'08'                                                    01330009
&P.1B104 EQU   X'04'                                                    01340009
&P.1B102 EQU   X'02'                                                    01350009
&P.1B101 EQU   X'01'                                                    01360009
.NEQU1B1 ANOP  ,                                                        01370009
&P.1B2   DC    H'0'                                                     01380004
&P.1B4   DC    A(0)                                                     01390004
&P.1B8   DC    0D'0',A(0)                                               01400004
&P.1BC   DC    A(0)                                                     01410004
&P.1C0   DC    X'0'   ****************                                  01420004
&P.1C1   DC    X'0'                  *                                  01430004
&P.1C2   DC    X'0'                  *                                  01440004
&P.1C3   DC    X'0'                  *                                  01450004
&P.1C4   DC    A(0)   ****************                                  01460004
&P.1C8   DC    X'00'                                                    01470004
&P.1C9   DC    X'00'                                                    01480008
&P.1CA   DC    H'0'                                                     01490004
&P.1CC   DC    H'0'                                                     01500004
&P.1CE   DC    H'0'                                                     01510004
&P.1D0   DC    A(0)                                                     01520004
&P.1D4   DC    A(0)                                                     01530004
&P.1D8   DC    D'0'   ****************                                  01540004
&P.1E0   DC    5A(0)                 *                                  01550004
&P.1F4   DC    A(0)                  *                                  01560004
&P.1F8   DC    A(0)                  *                                  01570004
&P.1FC   DC    A(0)                  *                                  01580004
&P.200   DC    A(0)                  *                                  01590004
&P.204   DC    A(0)                  *                                  01600004
&P.208   DC    A(0)                  *                                  01610004
&P.20C   DC    A(0)                  *                                  01620004
&P.210   DC    A(0)                  *                                  01630004
&P.214   DC    A(0)   ****************                                  01640004
&P.218   DC    D'0'                                                     01650004
&P.220   DC    A(0)                                                     01660004
&P.224   DC    A(0)                                                     01670004
&P.228   DC    D'0'                    (R0,R1)                          01680004
&P.230   DC    12A(0)                  (R2,R13)                         01690004
&P.260   DC    A(0)                                                     01700004
&P.264   DC    A(0)                                                     01710004
&P.268   DC    D'0'                                                     01720004
&P.270   DC    A(0)                                                     01730004
&P.274   DC    2A(0)                                                    01740004
&P.27C   DC    12A(0)                  (R2,R13)                         01750004
&P.2AC   DC    A(0)                                                     01760004
&P.2B0   DC    A(0)                                                     01770004
&P.2B4   DC    A(0)                                                     01780004
&P.2B8   DC    D'0'                                                     01790004
&P.2C0   DC    D'0'                                                     01800004
&P.2C8   DC    X'0'                    OPCODE                           01810004
&P.2C9   DC    X'0'                    LENGTH                           01820004
&P.2CA   DC    X'0'                                                     01830004
&P.2CB   DC    X'0'                                                     01840004
&P.2CC   DC    H'0'                                                     01850004
&P.2CE   DC    H'0'                                                     01860004
&P.2D0   DC    A(0)                                                     01870004
&P.2D4   DC    A(0)                                                     01880004
&P.2D8   DC    A(0)                                                     01890004
&P.2DC   DC    A(0)                                                     01900004
&P.2E0   DC    A(0)                                                     01910004
&P.2E4   DC    A(0)                                                     01920004
&P.2E8   DC    D'0'                                                     01930004
&P.2F0   DC    H'0'                                                     01940004
&P.2F2   DC    H'0'                                                     01950004
&P.2F4   DC    A(0)                                                     01960004
&P.2F8   DC    A(0)                                                     01970004
&P.2FC   DC    A(0)                                                     01980004
&P.300   DC    A(0)                                                     01990004
&P.304   DC    A(0)                                                     02000004
&P.308   DC    A(0)                                                     02010004
&P.30C   DC    A(0)                                                     02020004
&P.310   DC    A(0)                                                     02030004
&P.314   DC    A(0)                                                     02040004
&P.318   DC    X'0'                                                     02050004
&P.319   DC    X'0'                                                     02060004
&P.31A   DC    X'0'                                                     02070004
&P.31B   DC    X'0'                                                     02080004
&P.31C   DC    A(0)                                                     02090004
&P.320   DC    2A(0)                                                    02100004
&P.328   DC    0D'0',A(0)                                               02110004
&P.32C   DC    A(0)                                                     02120004
&P.330   DC    2A(0)                                                    02130004
&P       IQAERB DSECT=NO,MOD=XXXXX,DATE=06/16/73,TIME=09.15             02140003
&P.END   EQU   *                                                        02150000
         MEND  ,                                                        02160000
