         MACRO  ,                                                       00010000
&LBL     IQABUF2A                                                       00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************          IQABUF2A                   **************** 00070000
*********************************************************************** 00080000
*********************************************************************** 00090000
B2A      DSECT ,                                                        00100000
B2A000   DS    XL2                                                      00110000
B2A002   DS    0X                                                       00120000
         DS    XL512                                                    00130000
B2A202   DS    XL2                                                      00140000
B2A204   DS    0X                                                       00150000
         DS    XL400                                                    00160000
B2A394   DS    XL1                                                      00170000
B2A395   DS    XL1                                                      00180000
B2A396   DS    XL1                                                      00190000
B2A397   DS    XL1                                                      00200000
B2A398   DS    XL4                                                      00210000
B2A39C   DS    XL4                                                      00220000
B2A3A0   DS    XL4                                                      00230000
B2A3A4   DS    XL4                                                      00240000
B2A3A8   DS    XL4                                                      00250000
B2A3AC   DS    XL4                                                      00260000
B2A3B0   DS    XL4                                                      00270000
B2A3B4   DS    XL4                                                      00280000
B2A3B8   DS    XL4                                                      00290000
B2A3BC   DS    XL4                                                      00300000
B2A3C0   DS    XL4                                                      00310000
         DS    XL508                                                    00320000
B2A5C0   DS    XL2                                                      00330000
B2A5C2   DS    XL1                                                      00340000
B2A5C3   DS    XL1                                                      00350000
B2A5C4   DS    0X                                                       00360000
         DS    XL2                                                      00370000
B2A5C6   DS    0X                                                       00380000
         DS    XL2                                                      00390000
B2A5C8   DS    XL4                                                      00400000
B2A5CC   DS    XL4                                                      00410000
B2A5D0   DS    XL4                                                      00420000
B2A5D4   DS    XL1                                                      00430000
B2A5D5   DS    XL1                                                      00440000
B2A5D6   DS    XL1                                                      00450000
         DS    XL253                                                    00460000
B2A6D4   DS    XL1                                                      00470000
B2A6D5   DS    XL1                                                      00480000
         DS    XL254                                                    00490000
B2A7D4   DS    XL1                                                      00500000
         DS    XL2091                                                   00510000
B2ALEN   EQU   *-B2A                                                    00520000
         MEND  ,                                                        00530000
