         MACRO  ,                                                       00010000
         IQADDT ,                                                       00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************        DEVICE TYPE TABLE            **************** 00070000
*********************************************************************** 00080000
*********************************************************************** 00090000
DDT      DSECT                                                          00100000
DDTTRK   DS    H                       TRACKS PER CYLINDER              00110001
DDTCYLS  DS    H                       CYLINDERS PER DEVICE             00120001
DDTBLKS  DS    X                       BLOCKS PER TRACK                 00130001
DDTDEVT  DS    X                       UCB DEVICE TYPE                  00140001
*                                                                       00150001
         DS    X                                                        00160000
DDTIX    DS    X                       INDEX 0/4/8                      00170001
DDTLEN   EQU   *-DDT                                                    00180000
         MEND ,                                                         00190000
