         MACRO  ,                                                       00010000
&LBL     IQAID &DATE=,&TIME=,&BR=YES,&STYLE=1,&LENGTH=NO                00020000
.********************************************************************** 00030000
.********************************************************************** 00040000
.*****************          OS/VS2 R2                  **************** 00050000
.*****************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
.*****************      MODULE IDENTIFICATION          **************** 00070000
.********************************************************************** 00080000
.********************************************************************** 00090000
.*       STYLE=1 C'csect',C'date',C':',C'time'                        * 00100000
.*       STYLE=2 C'csect',C'date',C'   ',C'time'                      * 00110000
.*       STYLE=3 C'csect'                                             * 00120000
.*       STYLE=4 C'csect',C'  ',C'date'                               * 00130000
.*       STYLE=5 C'csect',C'date',C'time'                             * 00140000
.*                                                                    * 00150000
.*       LENGTH=YES generates length of identifier                    * 00160000
.*       BR=YES generates branch around identifier                    * 00170000
.*                                                                    * 00180000
.********************************************************************** 00190000
         LCLC  &C,&D,&T,&L,&S,&I                                        00200000
&C       SETC  '&SYSECT'                                                00210000
&L       SETC  '&SYSECT'(4,3)                                           00220000
         AIF   (T'&DATE EQ 'O').SYSD                                    00230000
&D       SETC  '&DATE'                                                  00240000
         AGO   .TIM                                                     00250000
.SYSD    ANOP  ,                                                        00260000
&D       SETC  '&SYSDATE'                                               00270000
.TIM     ANOP                                                           00280000
         AIF   (T'&TIME EQ 'O').SYST                                    00290000
&T       SETC  '&TIME'                                                  00300000
         AGO   .SEP                                                     00310000
.SYST    ANOP  ,                                                        00320000
&T       SETC  '&SYSTIME'                                               00330000
.SEP     ANOP                                                           00340000
         AIF   ('&STYLE' EQ '1').STYL1                                  00350000
         AIF   ('&STYLE' EQ '2').STYL2                                  00360000
         AIF   ('&STYLE' EQ '3').STYL3                                  00370000
         AIF   ('&STYLE' EQ '4').STYL4                                  00380000
         AIF   ('&STYLE' EQ '5').STYL5                                  00390000
         MNOTE 8,'IQAID STYLE INVALID &STYLE'                           00400000
         MEXIT ,                                                        00410000
.STYL1   ANOP                                                           00420000
&I       SETC  '&C&D:&T'                                                00430000
         AGO   .GEN                                                     00440000
.STYL2   ANOP                                                           00450000
&I       SETC  '&C&T   &D'                                              00460000
         AGO   .GEN                                                     00470000
.STYL3   ANOP                                                           00480000
&I       SETC  '&C'                                                     00490000
         AGO   .GEN                                                     00500000
.STYL4   ANOP                                                           00510000
&I       SETC  '&C  &D'                                                 00520000
         AGO   .GEN                                                     00530000
.STYL5   ANOP                                                           00540000
&I       SETC  '&C&D&T'                                                 00550000
         AGO   .GEN                                                     00560000
.GEN     ANOP                                                           00570000
         AIF   ('&BR' NE 'YES').NOBR1                                   00580000
         USING *,R15                                                    00590000
         B     &L.BGN                                                   00600000
         DROP  R15                                                      00610000
.NOBR1   ANOP                                                           00620000
         AIF   ('&LENGTH' NE 'YES').NOLEN                               00630000
         DC    AL1(L'&L.ID)                                             00640000
.NOLEN   ANOP                                                           00650000
&L.ID    DC    C'&I'                                                    00660000
         AIF   ('&BR' NE 'YES').NOBR2                                   00670000
&L.BGN   DC    0H'0'                                                    00680000
.NOBR2   ANOP                                                           00690000
         MEND  ,                                                        00700000
