         MACRO  ,                                                       00010000
         IQALCA &DSECT=YES                                              00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************             LCA                     **************** 00070002
*********************************************************************** 00080000
*********************************************************************** 00090000
         LCLC  &P                                                       00100000
         AIF   ('&DSECT' EQ 'YES').DSECT                                00110000
&P       SETC  'LCA'                                                    00120000
IQALCA00 DC    0F'0'                                                    00130000
         AGO   .NDSECT                                                  00140000
.DSECT   ANOP  ,                                                        00150000
&P       SETC  'LCA'                                                    00160000
&P       DSECT ,                                                        00170000
.NDSECT  ANOP  ,                                                        00180000
&P.000   DC    CL8' '                                                   00190000
&P.008   DC    A(0)                                                     00200000
&P.00C   DC    CL8' '                                                   00210000
&P.014   DC    A(0)                                                     00220000
&P.018   DC    X'80'                                                    00230001
         AIF   ('&DSECT' NE 'YES').NEQU18                               00240003
&P.01880 EQU   X'80'                                                    00250003
&P.01840 EQU   X'40'                                                    00260003
&P.01820 EQU   X'20'                                                    00270003
&P.01810 EQU   X'10'                                                    00280003
&P.01808 EQU   X'08'                                                    00290003
&P.01804 EQU   X'04'                                                    00300003
&P.01802 EQU   X'02'                                                    00310003
&P.01801 EQU   X'01'                                                    00320003
.NEQU18  ANOP  ,                                                        00330003
&P.019   DC    X'00'                                                    00340001
         AIF   ('&DSECT' NE 'YES').NEQU19                               00350003
&P.01980 EQU   X'80'                                                    00360003
&P.01940 EQU   X'40'                                                    00370003
&P.01920 EQU   X'20'                                                    00380003
&P.01910 EQU   X'10'                                                    00390003
&P.01908 EQU   X'08'                                                    00400003
&P.01904 EQU   X'04'                                                    00410003
&P.01902 EQU   X'02'                                                    00420003
&P.01901 EQU   X'01'                                                    00430003
.NEQU19  ANOP  ,                                                        00440003
&P.01A   DC    X'00'                                                    00450000
&P.01B   DC    X'00'                                                    00460001
&P.01C   DC    A(0)                    V(IQAWQL0)/CVT0DS                00470001
&P.020   DC    5CL8' '                                                  00480000
&P.048   DC    H'0'                                                     00490000
&P.04A   DC    X'00'                                                    00500001
&P.04B   DC    X'00'                   INDEX INTO LCA04C                00510001
&P.04C   DC    A(&P.04B)               1ST ENTRY                        00520001
         DC    23A(0)                  2ND-24TH ENTRY                   00530001
&P.0AC   DC    A(0)                                                     00540000
&P.0B0   DC    A(0)                                                     00550000
&P.0B4   DC    CL120' '                                                 00560000
&P.12C   DC    A(0)                                                     00570000
&P.130   DC    A(0)                                                     00580000
&P.134   DC    CL8' '                                                   00590001
&P.13C   DC    X'0'                                                     00600000
&P.13D   DC    X'0'                                                     00610000
&P.13E   DC    X'0'                                                     00620000
&P.13F   DC    X'0'                                                     00630000
&P.140   DC    A(0)                                                     00640000
&P.144   DC    A(0)                                                     00650000
&P.148   DC    A(0)                                                     00660000
&P.14C   DC    A(0)                                                     00670000
&P.150   DC    A(0)                                                     00680000
&P.154   DC    A(0)                                                     00690000
&P.158   DC    A(0)                                                     00700000
         MEND  ,                                                        00710000
