         MACRO  ,                                                       00010000
         IQASTT &DSECT=YES                                              00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************             STT                     **************** 00070001
*********************************************************************** 00080000
*********************************************************************** 00090000
.*                                                                      00100000
         AIF   ('&DSECT' EQ 'YES').DS010                                00110000
IQASTT00 CSECT ,                                                        00120000
         AGO   .DS020                                                   00130000
.DS010   ANOP  ,                                                        00140000
STT00    DSECT ,                                                        00150000
.DS020   ANOP  ,                                                        00160000
         DC    256A(1)                                                  00170000
.*                                                                      00180000
         AIF   ('&DSECT' EQ 'YES').DS110                                00190000
         ENTRY IQASTTP0                                                 00200000
IQASTTP0 DC    0H'0'                                                    00210000
         AGO   .DS120                                                   00220000
.DS110   ANOP  ,                                                        00230000
STTP0    DSECT ,                                                        00240000
.DS120   ANOP  ,                                                        00250000
STTP000  DC    AL2(8)                                                   00260001
STTP002  DC    AL2(8)                                                   00270001
STTP004  DC    AL2(8)                                                   00280001
STTP006  DC    AL2(8)                                                   00290000
STTP008  DC    AL2(8)                                                   00300001
STTP00A  DC    AL2(8)                                                   00310001
STTP00C  DC    AL2(8)                                                   00320000
STTP00E  DC    AL2(8)                                                   00330000
STTP010  DC    AL2(8)                                                   00340000
STTP012  DC    AL2(8)                                                   00350000
STTP014  DC    AL2(8)                                                   00360000
STTP016  DC    AL2(8)                                                   00370000
STTP018  DC    AL2(8)                                                   00380000
STTP01A  DC    AL2(8)                                                   00390000
STTP01C  DC    AL2(8)                                                   00400000
STTP01E  DC    AL2(8)                                                   00410000
.*                                                                      00420000
         AIF   ('&DSECT' EQ 'YES').DS210                                00430000
         ENTRY IQASTTX0                                                 00440000
IQASTTX0 DC    0H'0'                                                    00450000
         AGO   .DS220                                                   00460000
.DS210   ANOP  ,                                                        00470000
STTX0    DSECT ,                                                        00480000
.DS220   ANOP  ,                                                        00490000
         DC    8AL2(0,0)                                                00500000
         DC    8AL2(8,8)                                                00510000
         DC    8AL2(0,0)                                                00520000
         DC    8AL2(8,8)                                                00530000
         DC    8AL2(0,0)                                                00540000
         DC    8AL2(8,8)                                                00550000
         DC    8AL2(0,0)                                                00560000
         DC    8AL2(8,8)                                                00570000
         DC    8AL2(0,0)                                                00580000
         DC    8AL2(8,8)                                                00590000
         DC    8AL2(0,0)                                                00600000
         DC    8AL2(8,8)                                                00610000
         DC    8AL2(0,0)                                                00620000
         DC    8AL2(8,8)                                                00630000
         DC    8AL2(0,0)                                                00640000
         DC    8AL2(8,8)                                                00650000
         DC    8AL2(0,0)                                                00660000
         DC    8AL2(8,8)                                                00670000
         DC    8AL2(0,0)                                                00680000
         DC    8AL2(8,8)                                                00690000
         DC    8AL2(0,0)                                                00700000
         DC    8AL2(8,8)                                                00710000
         DC    8AL2(0,0)                                                00720000
         DC    8AL2(8,8)                                                00730000
         DC    8AL2(0,0)                                                00740000
         DC    8AL2(8,8)                                                00750000
         DC    8AL2(0,0)                                                00760000
         DC    8AL2(8,8)                                                00770000
         DC    8AL2(0,0)                                                00780000
.*                                                                      00790000
         AIF   ('&DSECT' EQ 'YES').DS310                                00800000
         ENTRY IQASTTPF                                                 00810000
IQASTTPF DC    0H'0'                                                    00820000
         AGO   .DS320                                                   00830000
.DS310   ANOP  ,                                                        00840000
STTPF    DSECT ,                                                        00850000
.DS320   ANOP  ,                                                        00860000
         DC    8AL2(8,8)                                                00870000
         DC    8AL2(0,0)                                                00880000
         MEND  ,                                                        00890000
