         MACRO  ,                                                       00010000
&LBL     IQASIB &DSECT=YES,&LENGTH=                                     00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************             SIB                     **************** 00070001
*********************************************************************** 00080000
*********************************************************************** 00090000
         LCLC  &P,&N,&L                                                 00100000
         AIF   ('&DSECT' EQ 'YES').DSECT                                00110000
         AIF   (T'&LENGTH NE 'O').LENOK                                 00120000
         MNOTE 8,'IQASIB LENGTH NOT SPECIFIED'                          00130000
         MEXIT ,                                                        00140000
.LENOK   ANOP  ,                                                        00150000
&L       SETC  '&LENGTH'                                                00160000
         AIF   ('&LBL' EQ 'CO').NAMCO                                   00170000
         AIF   ('&LBL' EQ 'CD').NAMCD                                   00180000
         AIF   ('&LBL' EQ 'TI').NAMTI                                   00190000
         AIF   ('&LBL' EQ 'ER').NAMER                                   00200000
         MNOTE 8,'IQASIB LABEL INVALID &LBL'                            00210000
         MEXIT ,                                                        00220000
.NAMCO   ANOP  ,                                                        00230000
&N       SETC  'CONSOLE'                                                00240000
         AGO   .NAMEND                                                  00250000
.NAMCD   ANOP  ,                                                        00260000
&N       SETC  'CARD'                                                   00270000
         AGO   .NAMEND                                                  00280000
.NAMTI   ANOP  ,                                                        00290000
&N       SETC  'TIN'                                                    00300000
&L       SETC  '&LENGTH+80'                                             00310000
         AGO   .NAMEND                                                  00320000
.NAMER   ANOP  ,                                                        00330000
&N       SETC  'CONSOLE'                                                00340000
.NAMEND  ANOP  ,                                                        00350000
&P       SETC  'IQASIB&LBL'                                             00360000
         ENTRY &P                                                       00370000
&P       DC    0F'0'                                                    00380000
         DC    X'00'                                                    00390000
         DC    AL2(&LENGTH)                                             00400000
         DC    X'00'                                                    00410000
         DC    A(IQABUF&LBL)                                            00420000
         DC    A(IQABUF&LBL+&L)                                         00430000
         DC    CL8'&N'                                                  00440000
         DC    A(0)                                                     00450000
         AIF   ('&LBL' NE 'TI').NOEXT                                   00460000
         DC    A(IQABUF&LBL+&LENGTH)                                    00470000
.NOEXT   ANOP  ,                                                        00480000
         MEXIT ,                                                        00490000
.*                                                                      00500000
.DSECT   ANOP  ,                                                        00510000
SIB      DSECT ,                                                        00520000
SIB000   DC    X'00'                                                    00530000
SIB001   DC    AL2(0)                  LENGTH                           00540000
SIB003   DC    X'00'                                                    00550000
SIB004   DC    A(0)                    BUFFER                           00560000
SIB008   DC    A(0)                                                     00570000
SIB00C   DC    CL8' '                  NAME                             00580000
SIB014   DC    A(0)                    IOT ADDRESS                      00590000
SIB018   DC    A(0)                                                     00600000
         MEND  ,                                                        00610000
