         MACRO  ,                                                       00010000
&LBL     IQATIB &DSECT=YES                                              00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************             TIB                     **************** 00070001
*********************************************************************** 00080000
*********************************************************************** 00090000
         LCLC  &P                                                       00100000
         AIF   ('&DSECT' EQ 'YES').DSECT                                00110000
&LBL     DC    0F'0'                                                    00120000
         DC    X'00'                                                    00130000
         DC    X'20'                                                    00140000
         DC    X'02'                                                    00150000
         DC    X'00'                                                    00160000
         DC    A(0)                                                     00170000
         DC    A(0)                                                     00180000
         DC    A(0)                                                     00190000
         DC    A(0)                                                     00200000
         DC    A(IQASIBCO)                                              00210000
         DC    CL8' '                                                   00220000
         MEXIT ,                                                        00230000
.DSECT   ANOP  ,                                                        00240000
TIB      DSECT ,                                                        00250000
TIB000   DC    X'00'                                                    00260000
TIB001   DC    X'00'                                                    00270000
TIB002   DC    X'00'                                                    00280000
TIB003   DC    X'00'                                                    00290000
TIB004   DC    A(0)                                                     00300000
TIB008   DC    A(0)                                                     00310000
TIB00C   DC    A(0)                                                     00320000
TIB010   DC    A(0)                                                     00330000
TIB014   DC    A(0)                    A(IQASIBCO)                      00340000
TIB018   DC    CL8' '                                                   00350000
         MEND  ,                                                        00360000
