         MACRO  ,                                                       00010000
&LBL     IQAVARC &LENGTH=,&VALUE=,&NAME=,&ALIGN=YES                     00020000
.********************************************************************** 00030000
.********************************************************************** 00040000
.*****************          OS/VS2 R2                  **************** 00050000
.*****************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
.*****************       VARIABLE CONSTANT             **************** 00070000
.********************************************************************** 00080000
.********************************************************************** 00090000
         AIF   ('&ALIGN' NE 'YES').NOALGN                               00100000
         DC    0A(0)                                                    00110000
.NOALGN  ANOP  ,                                                        00120000
         AIF   (T'&LENGTH NE 'O').LEN                                   00130000
         AIF   (T'&NAME EQ 'O').ERRLN1                                  00140000
&LBL     DC    AL1(L'&NAME)                                             00150000
         AGO   .VALUE                                                   00160000
.LEN     ANOP  ,                                                        00170000
&LBL     DC    AL1(&LENGTH)                                             00180000
.VALUE   ANOP  ,                                                        00190000
         AIF   (T'&VALUE EQ 'O').VALZERO                                00200000
         AIF   ('&VALUE' EQ 'BLANK').VALBLNK                            00210000
         AIF   ('&VALUE' EQ 'ZEROS').VALZERO                            00220000
         AIF   (T'&LENGTH NE 'O').LENVAL                                00230000
&NAME    DC    C&VALUE                                                  00240000
         AGO   .VALEND                                                  00250000
.LENVAL  ANOP  ,                                                        00260000
&NAME    DC    CL&LENGTH&VALUE                                          00270000
         AGO   .VALEND                                                  00280000
.VALZERO ANOP  ,                                                        00290000
         AIF   (T'&LENGTH EQ 'O').ERRLN2                                00300000
&NAME    DC    XL&LENGTH'0'                                             00310000
         AGO   .VALEND                                                  00320000
.VALBLNK ANOP  ,                                                        00330000
         AIF   (T'&LENGTH EQ 'O').ERRLN2                                00340000
&NAME    DC    CL&LENGTH' '                                             00350000
.VALEND  ANOP  ,                                                        00360000
         MEXIT ,                                                        00370000
.ERRLN1  ANOP  ,                                                        00380000
         MNOTE 8,'IQAVARC - LENGTH= REQUIRED IF NAME= MISSING'          00390000
         MEXIT ,                                                        00400000
.ERRLN2  ANOP  ,                                                        00410000
         MNOTE 8,'IQAVARC - LENGTH= REQUIRED IF VALUE=BLANK/ZEROS'      00420000
         MEXIT ,                                                        00430000
         MEND  ,                                                        00440000
