         MACRO  ,                                                       00010000
         IQAWQL &DSECT=YES                                              00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************             WQL                     **************** 00070001
*********************************************************************** 00080000
*********************************************************************** 00090000
         AIF   ('&DSECT' EQ 'YES').DSECT                                00110000
IQAWQL   DC    0F'0'                                                    00130002
         AGO   .NDSECT                                                  00140000
.DSECT   ANOP  ,                                                        00150000
WQL      DSECT ,                                                        00170002
.NDSECT  ANOP  ,                                                        00180000
WQLID    DC    C'WQL'                                                   00190002
WQL003   DC    X'0'                                                     00200002
WQL004   DC    X'0'                                                     00210002
WQL005   DC    X'0'                                                     00220002
WQL00580 EQU   X'80'                                                    00221003
WQL00540 EQU   X'40'                                                    00222003
WQL00520 EQU   X'20'                                                    00223003
WQL00510 EQU   X'10'                                                    00224003
WQL00508 EQU   X'08'                                                    00225003
WQL00504 EQU   X'04'                                                    00226003
WQL00502 EQU   X'02'                                                    00227003
WQL00501 EQU   X'01'                                                    00228003
WQL006   DC    X'0'                                                     00230002
WQL00680 EQU   X'80'                                                    00240003
WQL00640 EQU   X'40'                                                    00241003
WQL00620 EQU   X'20'                                                    00242003
WQL00610 EQU   X'10'                                                    00243003
WQL00608 EQU   X'08'                                                    00244003
WQL00604 EQU   X'04'                                                    00245003
WQL00602 EQU   X'02'                                                    00246003
WQL00601 EQU   X'01'                                                    00247003
WQL007   DC    X'0'                                                     00250002
WQL00780 EQU   X'80'                                                    00251003
WQL00740 EQU   X'40'                                                    00252003
WQL00720 EQU   X'20'                                                    00253003
WQL00710 EQU   X'10'                                                    00254003
WQL00708 EQU   X'08'                                                    00255003
WQL00704 EQU   X'04'                                                    00256003
WQL00702 EQU   X'02'                                                    00257003
WQL00701 EQU   X'01'                                                    00258003
WQL008   DC    A(0)                                                     00260002
WQL00C   DC    A(0)                    FMQA ENTRY                       00270002
WQL010   DC    A(0)                                                     00290002
WQL014   DC    A(0)                                                     00300002
WQLEND   EQU   *                                                        00310002
         MEND  ,                                                        00320000
