         MACRO  ,                                                       00010000
         IQAWSB &DSECT=YES                                              00020000
*********************************************************************** 00030000
*********************************************************************** 00040000
******************          OS/VS2 R2                  **************** 00050000
******************     DYNAMIC SUPPORT SYSTEM          **************** 00060000
******************             WSB                     **************** 00070001
*********************************************************************** 00080000
*********************************************************************** 00090000
         AIF   ('&DSECT' EQ 'YES').DSECT                                00100000
IQAWSB00 DC    A(0)                                                     00110000
         DC    A(0)                                                     00120000
         DC    A(0)                                                     00130000
         DC    A(0)                                                     00140000
         DC    A(0)                                                     00150000
         DC    A(IQAFAB01)                                              00160000
         DC    A(IQATIB01)                                              00170000
         DC    A(0)                                                     00180000
         DC    A(0)                                                     00190000
         MEXIT ,                                                        00200000
.DSECT   ANOP  ,                                                        00210000
WSB      DSECT ,                                                        00220000
WSB000   DC    A(0)                                                     00230000
WSB004   DC    A(0)                    IQASCB ???                       00240000
WSB008   DC    A(0)                                                     00250000
WSB00C   DC    A(0)                                                     00260000
WSB010   DC    A(0)                                                     00270000
WSB014   DC    A(0)                    A(IQAFAB01)                      00280000
WSB018   DC    A(0)                    A(IQATIB01)                      00290000
WSB01C   DC    A(0)                                                     00300000
WSB020   DC    A(0)                                                     00310000
         MEND  ,                                                        00320000
