*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IFCSCHAR CSECT                                                          00000060
         USING *,R9                                                     00000070
A000000  DC    A(A00009C)                                               00000080
         DC    A(A0002F8)                                               00000110
A000008  DC    A(0)                                                     00000130
         DC    H'110'                                                   00000140
         STM   R14,R12,12(R13)                                          00000160
         CLC   8(4,R2),A000092                                          00000170
         BE    A000096                                                  00000180
         CLC   0(4,R3),A000092                                          00000190
         BNE   A00002C                                                  00000200
         MVC   0(4,R3),8(R2)                                            00000210
A00002C  CLC   8(4,R2),0(R3)                                            00000220
         BL    A00004A                                                  00000230
         CLC   8(4,R2),4(R3)                                            00000240
         BNH   A000096                                                  00000250
         MVC   4(4,R3),8(R2)                                            00000260
         B     A000096                                                  00000270
A00004A  MVC   0(4,R3),8(R2)                                            00000280
         B     A000096                                                  00000290
         STM   R14,R12,12(R13)                                          00000300
         MVC   0(3,R3),49(R2)                                           00000310
         B     A000096                                                  00000320
         STM   R14,R12,12(R13)                                          00000330
         TM    3(R2),64                                                 00000340
         BO    A000084                                                  00000350
         LA    R7,A0000A8                                               00000360
         LH    R5,0(R3)                                                 00000370
         LA    R6,1                                                     00000380
         AR    R5,R6                                                    00000390
         STH   R5,0(R3)                                                 00000400
         B     A000096                                                  00000410
A000084  LA    R7,A0001CA                                               00000420
         ST    R7,A000008                                               00000430
         B     A000096                                                  00000440
         DC    X'FFFF'                                                  00000450
A000092  EQU *,4                                                        00000460
         DC    H'0'                                                     00000470
         DC    H'0'                                                     00000480
A000096  LM    R14,R12,12(R13)                                          00000490
         BR    R14                                                      00000500
A00009C  DC    X'8000000E'                                              00000510
         DC    F'32768'                                                 00000520
         DC    X'00540004'                                              00000530
A0000A8  DC    X'80000062'                                              00000540
         DC    X'00060080'                                              00000550
         DC    X'00'                                                    00000560
         DC    C' '                                                     00000570
         DC    H'0007'                                                  00000580
         DC    X'00'                                                    00000590
         DC    C' '                                                     00000600
         DC    X'00'                                                    00000610
         DC    C' '                                                     00000620
         DC    X'00080020'                                              00000630
         DC    X'00'                                                    00000640
         DC    C' '                                                     00000650
         DC    H'0009'                                                  00000660
         DC    X'001000'                                                00000670
         DC    C' '                                                     00000680
         DC    X'000A0008'                                              00000690
         DC    X'00'                                                    00000700
         DC    C' '                                                     00000710
         DC    H'0011'                                                  00000720
         DC    X'000400'                                                00000730
         DC    C' '                                                     00000740
         DC    X'000C0002'                                              00000750
         DC    X'00'                                                    00000760
         DC    C' '                                                     00000770
         DC    H'0013'                                                  00000780
         DC    X'000100'                                                00000790
         DC    C' '                                                     00000800
         DC    X'000E0080'                                              00000810
         DC    X'0041000F'                                              00000820
         DC    X'00'                                                    00000830
         DC    C' '                                                     00000840
         DC    H'0065'                                                  00000850
         DC    X'00100020'                                              00000860
         DC    X'00410011'                                              00000870
         DC    X'00100041'                                              00000880
         DC    X'00120008'                                              00000890
         DC    X'00410013'                                              00000900
         DC    X'00040041'                                              00000910
         DC    X'00140002'                                              00000920
         DC    X'00410015'                                              00000930
         DC    F'65601'                                                 00000940
         DC    X'00160080'                                              00000950
         DC    X'00420017'                                              00000960
         DC    X'00'                                                    00000970
         DC    C' '                                                     00000980
         DC    H'0066'                                                  00000990
         DC    X'00180020'                                              00001000
         DC    X'00420019'                                              00001010
         DC    X'00100042'                                              00001020
         DC    X'001A0008'                                              00001030
         DC    X'0042001B'                                              00001040
         DC    X'00040042'                                              00001050
         DC    X'001C0002'                                              00001060
         DC    X'0042001D'                                              00001070
         DC    F'65602'                                                 00001080
         DC    X'001E0080'                                              00001090
         DC    X'0043001F'                                              00001100
         DC    X'00'                                                    00001110
         DC    C' '                                                     00001120
         DC    H'0067'                                                  00001130
         DC    X'00200020'                                              00001140
         DC    X'00430021'                                              00001150
         DC    X'00100043'                                              00001160
         DC    X'00220008'                                              00001170
         DC    X'00430023'                                              00001180
         DC    X'00040043'                                              00001190
         DC    X'00240002'                                              00001200
         DC    X'00430025'                                              00001210
         DC    F'65603'                                                 00001220
         DC    X'00260080'                                              00001230
         DC    X'00440027'                                              00001240
         DC    X'00'                                                    00001250
         DC    C' '                                                     00001260
         DC    H'0068'                                                  00001270
         DC    X'00280020'                                              00001280
         DC    X'00440029'                                              00001290
         DC    X'00100044'                                              00001300
         DC    X'002A0008'                                              00001310
         DC    X'0044002B'                                              00001320
         DC    X'00040044'                                              00001330
         DC    X'002C0002'                                              00001340
         DC    X'0044002D'                                              00001350
         DC    F'65604'                                                 00001360
         DC    X'002E0080'                                              00001370
         DC    X'0045002F'                                              00001380
         DC    X'00'                                                    00001390
         DC    C' '                                                     00001400
         DC    H'0069'                                                  00001410
         DC    X'00300020'                                              00001420
         DC    X'00450031'                                              00001430
         DC    X'00100045'                                              00001440
         DC    X'00320008'                                              00001450
         DC    X'00450033'                                              00001460
         DC    X'00040045'                                              00001470
         DC    X'00340002'                                              00001480
         DC    X'00450035'                                              00001490
         DC    H'0001'                                                  00001500
A0001CA  EQU *,4                                                        00001510
         DC    H'0069'                                                  00001520
         DC    X'0036FFFF'                                              00001530
         DC    X'00'                                                    00001540
         DC    C' '                                                     00001550
         DC    H'0003'                                                  00001560
         DC    X'00370080'                                              00001570
         DC    X'00'                                                    00001580
         DC    C' '                                                     00001590
         DC    H'0056'                                                  00001600
         DC    X'00'                                                    00001610
         DC    C' '                                                     00001620
         DC    X'00'                                                    00001630
         DC    C' '                                                     00001640
         DC    X'00390020'                                              00001650
         DC    X'00'                                                    00001660
         DC    C' '                                                     00001670
         DC    H'0058'                                                  00001680
         DC    X'001000'                                                00001690
         DC    C' '                                                     00001700
         DC    X'003B0008'                                              00001710
         DC    X'00'                                                    00001720
         DC    C' '                                                     00001730
         DC    H'0060'                                                  00001740
         DC    X'000400'                                                00001750
         DC    C' '                                                     00001760
         DC    X'003D0002'                                              00001770
         DC    X'00'                                                    00001780
         DC    C' '                                                     00001790
         DC    H'0062'                                                  00001800
         DC    X'000100'                                                00001810
         DC    C' '                                                     00001820
         DC    X'003F0080'                                              00001830
         DC    X'004100'                                                00001840
         DC    C' '                                                     00001850
         DC    X'00'                                                    00001860
         DC    C' '                                                     00001870
         DC    H'0065'                                                  00001880
         DC    X'00410020'                                              00001890
         DC    X'00410042'                                              00001900
         DC    X'00100041'                                              00001910
         DC    X'00430008'                                              00001920
         DC    X'00410044'                                              00001930
         DC    X'00040041'                                              00001940
         DC    X'00450002'                                              00001950
         DC    X'00410046'                                              00001960
         DC    F'65601'                                                 00001970
         DC    X'00470080'                                              00001980
         DC    X'00420048'                                              00001990
         DC    X'00'                                                    00002000
         DC    C' '                                                     00002010
         DC    H'0066'                                                  00002020
         DC    X'00490020'                                              00002030
         DC    X'0042004A'                                              00002040
         DC    X'00100042'                                              00002050
         DC    X'00'                                                    00002060
         DC    C'.'                                                     00002070
         DC    H'0008'                                                  00002080
         DC    X'004200'                                                00002090
         DC    C'<'                                                     00002100
         DC    X'00040042'                                              00002110
         DC    X'00'                                                    00002120
         DC    C'('                                                     00002130
         DC    H'0002'                                                  00002140
         DC    X'004200'                                                00002150
         DC    C'+'                                                     00002160
         DC    F'65602'                                                 00002170
         DC    X'004F0080'                                              00002180
         DC    X'004300'                                                00002190
         DC    C'&&'                                                    00002200
         DC    X'00'                                                    00002210
         DC    C' '                                                     00002220
         DC    H'0067'                                                  00002230
         DC    X'00510020'                                              00002240
         DC    X'00430052'                                              00002250
         DC    X'00100043'                                              00002260
         DC    X'00530008'                                              00002270
         DC    X'00430054'                                              00002280
         DC    X'00040043'                                              00002290
         DC    X'00550002'                                              00002300
         DC    X'00430056'                                              00002310
         DC    F'65603'                                                 00002320
         DC    X'00570080'                                              00002330
         DC    X'00440058'                                              00002340
         DC    X'00'                                                    00002350
         DC    C' '                                                     00002360
         DC    H'0068'                                                  00002370
         DC    X'00590020'                                              00002380
         DC    X'004400'                                                00002390
         DC    C'!'                                                     00002400
         DC    X'00100044'                                              00002410
         DC    X'00'                                                    00002420
         DC    C'$'                                                     00002430
         DC    H'0008'                                                  00002440
         DC    X'004400'                                                00002450
         DC    C'*'                                                     00002460
         DC    X'00040044'                                              00002470
         DC    X'00'                                                    00002480
         DC    C')'                                                     00002490
         DC    H'2'                                                     00002500
         DC    X'004400'                                                00002510
         DC    C';'                                                     00002520
         DC    F'65604'                                                 00002530
         DC    X'00'                                                    00002540
         DC    C'¬'                                                     00002550
         DC    H'0128'                                                  00002560
         DC    X'004500'                                                00002570
         DC    C'-'                                                     00002580
         DC    X'00'                                                    00002590
         DC    C' '                                                     00002600
         DC    H'69'                                                    00002610
         DC    X'00'                                                    00002620
         DC    C'/'                                                     00002630
         DC    H'32'                                                    00002640
         DC    X'00450062'                                              00002650
         DC    X'00100045'                                              00002660
         DC    X'00630008'                                              00002670
         DC    X'00450064'                                              00002680
         DC    X'00040045'                                              00002690
         DC    X'00650002'                                              00002700
         DC    X'00450066'                                              00002710
         DC    F'65605'                                                 00002720
         DC    X'0067FF00'                                              00002730
A0002F8  DC    A(A00045C)                                               00002740
         DC    C'IFCSCHAR'                                              00002750
         DC    A(0)                                                     00002760
         DC    A(0)                                                     00002770
         DC    X'905890'                                                00002780
         DC    C'8'                                                     00002790
         DC    X'1B554354'                                              00002800
         DC    H'0'                                                     00002810
         DC    C'i&&'                                                   00002820
         DC    X'00084354'                                              00002830
         DC    F'70229'                                                 00002840
         DC    X'47709062'                                              00002850
         DC    X'41'                                                    00002860
         DC    C'-'                                                     00002870
         DC    X'00'                                                    00002880
         DC    C' '                                                     00002890
         DC    H'6966'                                                  00002900
         DC    C'K'                                                     00002910
         DC    X'05'                                                    00002920
         DC    X'3000'                                                  00002930
         DC    C'j'                                                     00002940
         DC    X'54'                                                    00002950
         DC    X'47'                                                    00002960
         DC    C'0'                                                     00002970
         DC    X'9062'                                                  00002980
         DC    X'905890'                                                00002990
         DC    C'8K'                                                    00003000
         DC    X'03'                                                    00003010
         DC    X'3000'                                                  00003020
         DC    C'j!'                                                    00003030
         DC    X'47'                                                    00003040
         DC    C'0'                                                     00003050
         DC    X'90629058'                                              00003060
         DC    X'90'                                                    00003070
         DC    C'8'                                                     00003080
         DC    X'4854'                                                  00003090
         DC    H'0'                                                     00003100
         DC    C'+&&'                                                   00003110
         DC    X'90'                                                    00003120
         DC    C'03'                                                    00003130
         DC    X'22'                                                    00003140
         DC    X'300090'                                                00003150
         DC    C'5L'                                                    00003160
         DC    X'00'                                                    00003170
         DC    X'3002'                                                  00003180
         DC    X'3000'                                                  00003190
         DC    C'q'                                                     00003200
         DC    X'58'                                                    00003210
         DC    X'90'                                                    00003220
         DC    C'8'                                                     00003230
         DC    H'2046'                                                  00003240
         DC    H'2046'                                                  00003250
         DC    C'3'                                                     00003260
         DC    X'73'                                                    00003270
         DC    X'90'                                                    00003280
         DC    C'0 '                                                    00003290
         DC    X'00'                                                    00003300
         DC    C'L'                                                     00003310
         DC    X'00'                                                    00003320
         DC    X'90'                                                    00003330
         DC    C'7'                                                     00003340
         DC    X'90'                                                    00003350
         DC    C'0K'                                                    00003360
         DC    X'05'                                                    00003370
         DC    X'300090'                                                00003380
         DC    C'1'                                                     00003390
         DC    H'2046'                                                  00003400
         DC    C'3'                                                     00003410
         DC    X'73'                                                    00003420
         DC    X'90'                                                    00003430
         DC    C'0 '                                                    00003440
         DC    X'00'                                                    00003450
         DC    C'L'                                                     00003460
         DC    X'00'                                                    00003470
         DC    X'90'                                                    00003480
         DC    C'7'                                                     00003490
         DC    X'90'                                                    00003500
         DC    C'0K'                                                    00003510
         DC    X'02'                                                    00003520
         DC    X'300090'                                                00003530
         DC    C'5K'                                                    00003540
         DC    X'01'                                                    00003550
         DC    X'3005'                                                  00003560
         DC    X'90'                                                    00003570
         DC    C'3'                                                     00003580
         DC    H'2046'                                                  00003590
         DC    C'N'                                                     00003600
         DC    X'01'                                                    00003610
         DC    C' '                                                     00003620
         DC    X'00'                                                    00003630
         DC    C'j'                                                     00003640
         DC    X'52'                                                    00003650
         DC    H'1934'                                                  00003660
         DC    X'1BFF07FE'                                              00003670
         DC    X'90ECD00C'                                              00003680
         DC    X'18CD41D0'                                              00003690
         DC    C'j'                                                     00003700
         DC    X'08'                                                    00003710
         DC    C'&&'                                                    00003720
         DC    X'CD'                                                    00003730
         DC    H'4'                                                     00003740
         DC    C'&&'                                                    00003750
         DC    X'DC'                                                    00003760
         DC    X'00085832'                                              00003770
         DC    H'4'                                                     00003780
         DC    C'&&'                                                    00003790
         DC    X'3C'                                                    00003800
         DC    X'001C4800'                                              00003810
         DC    C'j&&'                                                   00003820
         DC    H'6162'                                                  00003830
         DC    X'41101000'                                              00003840
         DC    X'0A0A1233'                                              00003850
         DC    X'478090E0'                                              00003860
         DC    X'41'                                                    00003870
         DC    C'&&j>&&&&'                                              00003880
         DC    X'900C'                                                  00003890
         DC    X'41'                                                    00003900
         DC    C'&&m'                                                   00003910
         DC    X'07'                                                    00003920
         DC    C'&&&&'                                                  00003930
         DC    X'9010'                                                  00003940
         DC    X'58DD0004'                                              00003950
         DC    C'q'                                                     00003960
         DC    X'EC'                                                    00003970
         DC    X'D00C'                                                  00003980
         DC    X'07FE0000'                                              00003990
         DC    A(0)                                                     00004000
         DC    A(0)                                                     00004010
         DC    A(0)                                                     00004020
         DC    A(0)                                                     00004030
         DC    A(0)                                                     00004040
         DC    A(0)                                                     00004050
         DC    A(0)                                                     00004060
         DC    A(0)                                                     00004070
         DC    A(0)                                                     00004080
         DC    A(0)                                                     00004090
         DC    A(0)                                                     00004100
         DC    A(0)                                                     00004110
         DC    A(0)                                                     00004120
         DC    A(0)                                                     00004130
         DC    A(0)                                                     00004140
         DC    A(0)                                                     00004150
         DC    A(0)                                                     00004160
         DC    A(0)                                                     00004170
         DC    A(0)                                                     00004180
         DC    A(0)                                                     00004190
         DC    A(0)                                                     00004200
         DC    A(0)                                                     00004210
         DC    A(0)                                                     00004220
         DC    A(0)                                                     00004230
         DC    A(0)                                                     00004240
         DC    X'00'                                                    00004250
         DC    C'2'                                                     00004260
         DC    X'FFFF'                                                  00004270
         DC    C'SHARED3848'                                            00004280
         DC    H'0'                                                     00004290
         DC    X'00180018'                                              00004300
A00045C  DC    AL2(1,1,1,1)                                             00004310
         DC    A(A000700)                                               00004330
         DC    F'256'                                                   00004340
         DC    X'0B8B0001'                                              00004350
         DC    X'FFFB0911'                                              00004360
         DC    X'04FFFE2D'                                              00004370
         DC    X'28FFFF01'                                              00004380
         DC    X'23012A00'                                              00004390
         DC    X'2300FA00'                                              00004400
         DC    X'3301FFFF'                                              00004410
         DC    X'170A04FF'                                              00004420
         DC    X'FE170BFF'                                              00004430
         DC    X'FF051A01'                                              00004440
         DC    C'_'                                                     00004450
         DC    X'00'                                                    00004460
         DC    C'='                                                     00004470
         DC    X'01'                                                    00004480
         DC    X'AD00'                                                  00004490
         DC    C'='                                                     00004500
         DC    X'04'                                                    00004510
         DC    X'FFFE2A0A'                                              00004520
         DC    X'FFFF0101'                                              00004530
         DC    X'FFFB0909'                                              00004540
         DC    X'00AD003C'                                              00004550
         DC    X'02FFFE28'                                              00004560
         DC    X'0100CA80'                                              00004570
         DC    X'3302FFFB'                                              00004580
         DC    X'111101ED'                                              00004590
         DC    X'006A02FF'                                              00004600
         DC    X'FF010600'                                              00004610
         DC    X'8D004A01'                                              00004620
         DC    X'FFFF011E'                                              00004630
         DC    X'03FFFE2D'                                              00004640
         DC    X'37FFFF01'                                              00004650
         DC    X'14022D00'                                              00004660
         DC    X'4A01FFFF'                                              00004670
         DC    X'010102FF'                                              00004680
         DC    X'FE1406FF'                                              00004690
         DC    X'FF0C2806'                                              00004700
         DC    X'FFFE2228'                                              00004710
         DC    X'FFFF0127'                                              00004720
         DC    X'FFFB0909'                                              00004730
         DC    X'02'                                                    00004740
         DC    C'('                                                     00004750
         DC    H'74'                                                    00004760
         DC    X'03'                                                    00004770
         DC    C'('                                                     00004780
         DC    H'74'                                                    00004790
         DC    X'04'                                                    00004800
         DC    C'('                                                     00004810
         DC    H'74'                                                    00004820
         DC    H'770'                                                   00004830
         DC    C'_'                                                     00004840
         DC    X'00'                                                    00004850
         DC    X'4A03'                                                  00004860
         DC    C'_'                                                     00004870
         DC    X'00'                                                    00004880
         DC    X'4A04'                                                  00004890
         DC    C'_'                                                     00004900
         DC    X'00'                                                    00004910
         DC    X'4A03028D'                                              00004920
         DC    X'004A038D'                                              00004930
         DC    X'004A048D'                                              00004940
         DC    X'004A0302'                                              00004950
         DC    X'AD004A03'                                              00004960
         DC    X'AD004A04'                                              00004970
         DC    X'AD004A03'                                              00004980
         DC    X'02CD004A'                                              00004990
         DC    X'03CD004A'                                              00005000
         DC    X'04CD004A'                                              00005010
         DC    X'0302ED00'                                              00005020
         DC    X'4A03ED00'                                              00005030
         DC    X'4A04ED00'                                              00005040
         DC    X'4A03030D'                                              00005050
         DC    X'004A040D'                                              00005060
         DC    X'004A050D'                                              00005070
         DC    X'004A04FF'                                              00005080
         DC    X'FB111103'                                              00005090
         DC    X'2D004A04'                                              00005100
         DC    X'2D004A05'                                              00005110
         DC    X'2D004A01'                                              00005120
         DC    X'FFFF0C28'                                              00005130
         DC    X'05FFFF01'                                              00005140
         DC    X'27FFFB09'                                              00005150
         DC    H'2309'                                                  00005160
         DC    C'('                                                     00005170
         DC    X'00'                                                    00005180
         DC    X'4A06'                                                  00005190
         DC    C'('                                                     00005200
         DC    X'00'                                                    00005210
         DC    X'4A07'                                                  00005220
         DC    C'('                                                     00005230
         DC    X'00'                                                    00005240
         DC    X'4A0305'                                                00005250
         DC    C'_'                                                     00005260
         DC    X'004A06'                                                00005270
         DC    C'_'                                                     00005280
         DC    X'004A07'                                                00005290
         DC    C'_'                                                     00005300
         DC    X'004A0305'                                              00005310
         DC    X'8D004A06'                                              00005320
         DC    X'8D004A07'                                              00005330
         DC    X'8D004A03'                                              00005340
         DC    X'05AD004A'                                              00005350
         DC    X'06AD004A'                                              00005360
         DC    X'07AD004A'                                              00005370
         DC    X'0305CD00'                                              00005380
         DC    X'4A06CD00'                                              00005390
         DC    X'4A07CD00'                                              00005400
         DC    X'4A0305ED'                                              00005410
         DC    X'004A06ED'                                              00005420
         DC    X'004A07ED'                                              00005430
         DC    X'004A0306'                                              00005440
         DC    X'0D004A07'                                              00005450
         DC    X'0D004A08'                                              00005460
         DC    X'0D004A04'                                              00005470
         DC    X'FFFB1111'                                              00005480
         DC    X'062D004A'                                              00005490
         DC    X'072D004A'                                              00005500
         DC    X'082D004A'                                              00005510
         DC    X'01FFFB8B'                                              00005520
         DC    X'110001FF'                                              00005530
         DC    X'FF011E04'                                              00005540
         DC    X'FFFE2D37'                                              00005550
         DC    X'FFFF0114'                                              00005560
         DC    X'FFFB1111'                                              00005570
         DC    X'08'                                                    00005580
         DC    C'('                                                     00005590
         DC    H'74'                                                    00005600
         DC    X'01FFFF01'                                              00005610
         DC    X'0102FFFE'                                              00005620
         DC    X'1406FFFF'                                              00005630
         DC    X'0C2806FF'                                              00005640
         DC    X'FE2228FF'                                              00005650
         DC    X'FF0127FF'                                              00005660
         DC    X'FB090908'                                              00005670
         DC    C'_'                                                     00005680
         DC    X'00'                                                    00005690
         DC    X'4A09'                                                  00005700
         DC    C'_'                                                     00005710
         DC    X'00'                                                    00005720
         DC    X'4A0A'                                                  00005730
         DC    C'_'                                                     00005740
         DC    X'00'                                                    00005750
         DC    X'4A03'                                                  00005760
         DC    X'088D004A'                                              00005770
         DC    X'098D004A'                                              00005780
         DC    X'0A8D004A'                                              00005790
         DC    X'0308AD00'                                              00005800
         DC    X'4A09AD00'                                              00005810
         DC    X'4A0AAD00'                                              00005820
         DC    X'4A0308CD'                                              00005830
         DC    X'004A09CD'                                              00005840
         DC    X'004A0ACD'                                              00005850
         DC    X'004A0308'                                              00005860
         DC    X'ED004A09'                                              00005870
         DC    X'ED004A0A'                                              00005880
         DC    X'ED004A03'                                              00005890
         DC    X'090D004A'                                              00005900
         DC    X'0A0D004A'                                              00005910
         DC    X'0B0D004A'                                              00005920
         DC    X'03092D00'                                              00005930
         DC    X'4A0A2D00'                                              00005940
         DC    X'4A0B2D00'                                              00005950
         DC    X'4A04FFFB'                                              00005960
         DC    X'111109'                                                00005970
         DC    C'('                                                     00005980
         DC    X'004A0A'                                                00005990
         DC    C'('                                                     00006000
         DC    X'004A0B'                                                00006010
         DC    C'('                                                     00006020
         DC    X'004A01FF'                                              00006030
         DC    X'FF0C2805'                                              00006040
         DC    X'FFFF0127'                                              00006050
         DC    X'FFFB0909'                                              00006060
         DC    X'0B'                                                    00006070
         DC    C'_'                                                     00006080
         DC    H'74'                                                    00006090
         DC    X'0C'                                                    00006100
         DC    C'_'                                                     00006110
         DC    H'74'                                                    00006120
         DC    X'0D'                                                    00006130
         DC    C'_'                                                     00006140
         DC    H'0074'                                                  00006150
         DC    X'030B8D00'                                              00006160
         DC    X'4A0C8D00'                                              00006170
         DC    X'4A0D8D00'                                              00006180
         DC    X'4A030BAD'                                              00006190
         DC    X'004A0CAD'                                              00006200
         DC    X'004A0DAD'                                              00006210
         DC    X'004A030B'                                              00006220
         DC    X'CD004A0C'                                              00006230
         DC    X'CD004A0D'                                              00006240
         DC    X'CD004A03'                                              00006250
         DC    X'0BED004A'                                              00006260
         DC    X'0CED004A'                                              00006270
         DC    X'0DED004A'                                              00006280
         DC    X'030C0D00'                                              00006290
         DC    X'4A0D0D00'                                              00006300
         DC    X'4A0E0D00'                                              00006310
         DC    X'4A030C2D'                                              00006320
         DC    X'004A0D2D'                                              00006330
         DC    X'004A0E2D'                                              00006340
         DC    X'004A04FF'                                              00006350
         DC    X'FB11110C'                                              00006360
         DC    C'('                                                     00006370
         DC    X'00'                                                    00006380
         DC    X'4A0D'                                                  00006390
         DC    C'('                                                     00006400
         DC    X'00'                                                    00006410
         DC    X'4A0E'                                                  00006420
         DC    C'('                                                     00006430
         DC    X'00'                                                    00006440
         DC    X'4A01'                                                  00006450
         DC    X'0E8D00'                                                00006460
         DC    C'u'                                                     00006470
         DC    X'FF000000'                                              00006480
         DC    X'000000'                                                00006490
         DC    C'$'                                                     00006500
A000700  DC    C' $ $OUTBOARD SUMMARY*MODEL-*SER'                       00006501
         DC    C'IAL NO.$DAY YEAR*DAY YEAR$DATE R'                      00006510
         DC    C'ANGE  - *TO$DEVICE TYPE$PRIMARY '                      00006520
         DC    C'  CHANNEL UNIT ADDRESS  $ALTERNA'                      00006530
         DC    C'TE CHANNEL UNIT ADDRESS  $TOTAL '                      00006540
         DC    C'NUMBER OF RECORDS$PERMANENT ERRO'                      00006550
         DC    C'R SUMMARY*++++++++++++++++++++++'                      00006560
         DC    C'+++++$TOTAL NUMBER OF PERM ERROR'                      00006570
         DC    C' RECORDS$SENSE BYTE SUMMARY$BYTE'                      00006580
         DC    C' 0*BYTE 1*BYTE 2$COMMAND REJECT*'                      00006590
         DC    C'NOT USED*ENCU A PARITY ERROR $NO'                      00006600
         DC    C'T USED*MASTER KEY A PARITY ERROR'                      00006610
         DC    C' *ENCU B PARITY ERROR $BUS OUT C'                      00006620
         DC    C'HECK*MASTER KEY B PARITY ERROR *'                      00006630
         DC    C'ENGINE A COMPARE CHECK$EQUIPMENT'                      00006640
         DC    C' CHECK*CONTROL UNIT INPUT PARITY'                      00006650
         DC    C' ERROR*ENGINE B COMPARE CHECK$DA'                      00006660
         DC    C'TA CHECK*ENGINE A INPUT PARITY E'                      00006670
         DC    C'RROR *ENCU A COMPARE CHECK$OVERR'                      00006680
         DC    C'UN*ENGINE B INPUT PARITY ERROR *'                      00006690
         DC    C'ENCU B COMPARE CHECK$LENGTH CHEC'                      00006700
         DC    C'K*WORKING KEY A PARITY ERROR *OU'                      00006710
         DC    C'TBUFFER PARITY ERROR$VERIFY MAST'                      00006720
         DC    C'ER KEY*WORKING KEY B PARITY ERRO'                      00006730
         DC    C'R *OUTTAGS AND INTAGS UNEQUAL$BY'                      00006740
         DC    C'TE 3*BYTE 4*BYTE 5$NOT USED*CONT'                      00006750
         DC    C'ROL STORE CHECK*INVALID COMMAND '                      00006760
         DC    C'SEQUENCE$SHORT CHANNEL TAG*NOT U'                      00006770
         DC    C'SED*INVALID COMMAND$NO CHANNEL R'                      00006780
         DC    C'ESPONSE*SAR CHECK*NOT USED$LOW C'                      00006790
         DC    C'OUNT*DATA TRANSFER TIME OUT*NOT '                      00006800
         DC    C'USED$SVC/DATA OUT SEQUENCE CHECK'                      00006810
         DC    C'*DEVIC END TIME OUT*NOT USED$MUL'                      00006820
         DC    C'TIPLE OF 8 CHECK*CLOCK CHECK*NOT'                      00006830
         DC    C' USED$NOT USED*RING CHECK*NOT US'                      00006840
         DC    C'ED$NOT USED*NOT USED*NOT USED$$$'                      00006850
         DC    C'TEMPORARY ERROR SUMMARY*++++++++'                      00006860
         DC    C'+++++++++++++++++++$TOTAL NUMBER'                      00006870
         DC    C' OF TEMP ERROR RECORDS$SENSE BYT'                      00006880
         DC    C'E SUMMARY$BYTE 0*BYTE 1*BYTE 2$C'                      00006890
         DC    C'OMMAND REJECT*NOT USED*ENCU A PA'                      00006900
         DC    C'RITY ERROR $NOT USED*MASTER KEY '                      00006910
         DC    C'A PARITY ERROR*ENCU B PARITY ERR'                      00006920
         DC    C'OR$BUS OUT CHECK*MASTER KEY B PA'                      00006930
         DC    C'RITY ERROR*ENGINE A COMPARE CHEC'                      00006940
         DC    C'K$EQUIPMENT CHECK*CONTROL UNIT I'                      00006950
         DC    C'NPUT PARITY ERROR*ENGINE B COMPA'                      00006960
         DC    C'RE CHECK$DATA CHECK*ENGINE A INP'                      00006970
         DC    C'UT PARITY ERROR*ENCU A COMPARE C'                      00006980
         DC    C'HECK$OVERRUN*ENGINE B INPUT PARI'                      00006990
         DC    C'TY ERROR*ENCU B COMPARE CHECK$LE'                      00007000
         DC    C'NGTH CHECK*WORKING KEY A PARITY '                      00007010
         DC    C'ERROR*OUT BUFFER PARITY ERROR$VE'                      00007020
         DC    C'RIFY MASTER KEY*WORKING KEY B PA'                      00007030
         DC    C'RITY ERROR*RESERVED$BYTE 3*BYTE '                      00007040
         DC    C'4*BYTE 5$NOT USED*CONTROL STORE '                      00007050
         DC    C'CHECK*INVALID COMMAND SEQUENCE$N'                      00007060
         DC    C'OT USED*NOT USED*INVALID COMMAND'                      00007070
         DC    C'$NOT USED*SAR CHECK*NOT USED$REA'                      00007080
         DC    C'D LENGTH LESS THAN WRITE*NOT USE'                      00007090
         DC    C'D*NOT USED$NOT USED*NOT USED*NOT'                      00007100
         DC    C' USED$MULTIPLE OF 8 CHECK*CLOCK '                      00007110
         DC    C'CHECK*NOT USED$NOT USED*RING CHE'                      00007120
         DC    C'CK*NOT USED$NOT USED*NOT USED*NO'                      00007130
         DC    C'T USED$ $'                                             00007140
R0       EQU   0                                                        00007150
R1       EQU   1                                                        00007160
R2       EQU   2                                                        00007170
R3       EQU   3                                                        00007180
R4       EQU   4                                                        00007190
R5       EQU   5                                                        00007200
R6       EQU   6                                                        00007210
R7       EQU   7                                                        00007220
R8       EQU   8                                                        00007230
R9       EQU   9                                                        00007240
R10      EQU   10                                                       00007250
R11      EQU   11                                                       00007260
R12      EQU   12                                                       00007270
R13      EQU   13                                                       00007280
R14      EQU   14                                                       00007290
R15      EQU   15                                                       00007300
         END                                                            00007310
