*/*  INCLUDE SYSLIB(IECDSECT)                                  Y02134*/ 00010002
*  % GOTO PLSGEN;                       /*EXPAND PLS PORTION   Y02134*/ 00012002
*/*                                                              Y02134 00014002
         MACRO                                                          00020000
         IECDSECT &IOB=YES                                       S21940 00040000
.*                                                                      00040402
.********************************************************************** 00040802
.*                                                                      00041202
.*       VS2 RELEASE 03 DELETIONS/CHANGES                               00041303
.*0000                                                         @ZA02504 00041403
.*C53300,83200                                                 @ZA40178 00041537
.*                                                                      00042037
.*       VS2 RELEASE 03.8 DELETIONS/CHANGES/ADDITIONS                   00042137
.*A726900                                                      @ZA41849 00042237
.*A21400                                                       @ZA43489 00042337
.*                                                                      00042437
.* MODULE NAME = IECDSECT (VS2-2)                                       00042537
.*                                                                      00043037
.* DESCRIPTIVE NAME = O/C/E WORK AREA ADDRESSING MACRO                  00043537
.*                                                                      00044037
.* COPYRIGHT = NONE.                                                    00045002
.*                                                                      00047002
.* STATUS = CHANGE LEVEL 000                                            00047402
.*                                                                      00047802
.* FUNCTION = O/C/E MACRO USED TO PROVIDE ADDRESSABILITY TO INTERNAL    00048202
.*            WORK AREAS.                                               00048602
.*                                                                      00049902
.* NOTES = NONE.                                                        00050002
.*                                                                      00054802
.*      DEPENDENCIES = IEFJFCBN (JFCB = 176 BYTES IN LENGTH).           00056702
.*                     ONLY IN BAL VERSION.                      Y02134 00057102
.*                                                                      00058202
.*      RESTRICTIONS = CHANGES TO THIS MACRO MUST BE COORDINATED        00064702
.*                     WITH THE IECDSECS MACRO AND FUNCTIONS            00065602
.*                     WHICH INTERFACE INTERNALLY WITH O/C/E            00066002
.*                     ROUTINES. THIS MACRO WAS DESIGNED TO             00066402
.*                     BE USED IN A DSECT.                              00066502
.*                                                                      00066802
.*      REGISTER CONVENTIONS = NOT APPLICABLE.                          00067202
.*                                                                      00067302
.* PATCH LABEL = NOT APPLICABLE.                                        00067402
.*                                                                      00067502
.* MODULE TYPE = MACRO.                                                 00068302
.*                                                                      00068702
.*      PROCESSOR = ASSEMBLER LANGUAGE.                                 00069102
.*                                                                      00069502
.*      MODULE SIZE = DESCRIBED BY THE LABEL DSECTSIZ. THE ACTUAL       00069602
.*                    WORK AREA SIZE IS DESCRIBED BY LABELS WITHIN      00069702
.*                    IECDSECS.                                         00070002
.*                                                                      00070302
.*      ATTRIBUTES = DSECT FIELDS.                                      00070502
.*                                                                      00070702
.* ENTRY POINT = DXLBL IN BAL VERSION                            Y02134 00071002
.*               FORCORE IN PLS VERSION                          Y02134 00071102
.*                                                                      00071402
.*      PURPOSE = THIS MACRO IS TO BE USED IN CONJUNCTION WITH          00071802
.*                THE IECDSECS MACRO TO DEFINE AND MAP INTERNAL         00073702
.*                WORK AREAS USED BY O/C/E AND FUNCTIONS WHICH          00073902
.*                INTERNALLY INTERFACE WITH O/C/E. THIS MACRO IS        00074002
.*                CALLED BY O/C/E CSECTS AT ASSEMBLY TIME.              00074102
.*                                                                      00074402
.*      LINKAGE = IECDSECT IOB=(YES/NO) FOR BAL CALL             Y02134 00074502
.*                % INCLUDE SYSLIB(IECDSECT) IN PLS CALL         Y02134 00074902
.*                                                                      00076002
.*      INPUT = IOB=, IOB=YES, OR IOB=NO.                               00076402
.*                                                                      00085102
.*            IF IOB=YES OR IOB=, (DEFAULT) IS SPECIFIED, INTERNALLY    00085502
.*            DEFINED FIELDS IN THE IOB ARE GENERATED. THE LABELS       00085902
.*            FOR THESE FIELDS ARE MUTUALLY EXCLUSIVE OF THE LABELS     00086002
.*            GENERATED BY THE IOBLOCKS MACRO.                          00086302
.*            FOR A PLS CALL THE IOB AREA IS EXPANDED            Y02134 00086402
.*            WITHOUT IOB LABELS.                                Y02134 00091702
.*                                                                      00097102
.*      OUTPUT = MAPPING OF COMMON O/C/E WORK AREA.                     00102402
.*               SEE COMMENTS BELOW.                                    00107702
.*                                                                      00113002
.* EXIT NORMAL = MEND STATEMENT                                         00113402
.*                                                                      00113802
.* EXIT ERROR = IHBERMAC 183,IOB,YES                                    00113902
.*                                                                      00114602
.* EXTERNAL REFERENCES = SEE BELOW.                                     00116202
.*                                                                      00116302
.*      ROUTINES = NONE.                                                00116502
.*                                                                      00116902
.*    1 DATA AREAS = O/C/E COMMON WORK AREA.                            00119502
.*      2 DATA AREAS = VOLUME LABEL AREA.                               00120802
.*        3 DATA AREAS = ANSI VOLUME LABEL AREA.                        00121202
.*        3 DATA AREAS = FILE LABEL 1 AREA.                             00121302
.*        3 DATA AREAS = FILE LABEL 2 AREA.                             00121402
.*        3 DATA AREAS = ANSI FILE LABEL 2 AREA.                        00122002
.*        3 DATA AREAS = DATA SET CONTROL BLOCK LABEL AREA (DSCB).      00122402
.*        3 DATA AREAS = DATA SET CONTROL BLOCK FORMAT 3 KEY AREA.      00122802
.*        3 DATA AREAS = DATA SET CONTROL BLOCK FORMAT 3 RECORD AREA.   00122902
.*        3 DATA AREAS = MESSAGE AREA.                                  00123002
.*        3 DATA AREAS = MESSAGE LENGTHS.                               00123102
.*        3 DATA AREAS = MESSAGE FORMAT.                                00123202
.*      2 DATA AREAS = JOB FILE CONTROL BLOCK AREA (JFCB).              00123302
.*      2 DATA AREAS = O/C/E INTERNAL EVENT CONTROL BLOCK AREA (ECB).   00123402
.*      2 DATA AREAS = O/C/E INTERNAL INPUT/OUTPUT BLOCK AREA (IOB).    00123602
.*      2 DATA AREAS = O/C/E INTERNAL DATA EXTENT BLOCK AREA (DEB).     00124002
.*      2 DATA AREAS = O/C/E INTERNAL DATA CONTROL BLOCK AREA (DCB).    00124402
.*      2 DATA AREAS = O/C/E INTERNAL CONTROL WORDS AREA (CCW).         00124502
.*      2 DATA AREAS = O/C/E COMMON EXTENDED WORK AREAS.                00124602
.*      2 DATA AREAS = O/C/E PROTECTED CONTROL BLOCK POINTERS AREA.     00124702
.*      2 DATA AREAS = USER DCB COPY POINTERS AREA.                     00124802
.*      2 DATA AREAS = O/C/E ACCESS METHOD AREA.                        00124902
.*      2 DATA AREAS = O/C/E RECOVERY ROUTINE AUDIT TRAIL AREA.         00125002
.*                                                                      00125202
.*      CONTROL BLOCKS = DSCB,JFCB,ECB,IOB,DCB,DEB                      00125302
.*                                                                      00125402
.* TABLES = NONE.                                                       00125502
.*                                                                      00125602
.* MACROS = IHBERMAC.                                                   00125802
.*                                                                      00126002
.* CHANGE ACTIVITY = Y02080                                             00126802
.*                                                                      00128802
.********************************************************************** 00129302
.*                                                                      00129702
.*         VS2 RELEASE 3.860 DELETIONS/CHANGES                 @G60ASRB 00131437
.*C055190,096080,096086                                        @G60ASRB 00132237
.*A055191-055196,096083,096089-096095                          @G60ASRB 00132837
.*                                                                      00133237
.*         RELEASE 21 DELETIONS/CHANGES                                 00134002
.*                                                               S21940 00136602
.*         RELEASE 20 DELETIONS/CHANGES                                 00139202
.*                                                               S20038 00141802
.*                                                                      00144402
         SPACE 1                                                        00147002
*********************************************************************** 00149002
*                                                                       00149402
*        THIS MACRO IS USED TO DEFINE AND MAP THE O/C/E WORK AREA.      00149602
*                                                                       00150002
*        O/C/E = OPEN, OPEN TYPE=J, CLOSE, CLOSE TYPE=T,                00151602
*                EOV, FEOV, & RDJFCB.                                   00153602
*                                                                       00155602
*********************************************************************** 00156002
         SPACE 1                                                        00157402
*********************************************************************** 00159402
*                                                                       00159802
*        O/C/EOV MAIN WORK AREA, FORMAT AND LENGTHS                     00160002
*                                                                       00180002
*********************************************************************** 00190002
*                                                                       00200002
*    1. O/C/E COMMON WORK AREA.                       TOTAL = 612 BYTES 00210037
*      2. VOLUME LABEL AREA.                                  100 BYTES 00214402
*      **** TAPE LABELS                                                 00214902
*        3. ANSI VOLUME LABEL AREA.                                     00215402
*        3. FILE LABEL 1 AREA.                                          00216002
*        3. FILE LABEL 2 AREA.                                          00218002
*        3. ANSI FILE LABEL 2 AREA.                                     00218402
*      **** DIRECT ACCESS LABELS                                        00218502
*        3. DATA SET CONTROL BLOCK LABEL AREA (DSCB).                   00218802
*        3. DATA SET CONTROL BLOCK FORMAT 3 KEY AREA.                   00219202
*        3. DATA SET CONTROL BLOCK FORMAT 3 RECORD AREA.                00219602
*        3. MESSAGE AREA.                                               00219702
*        3. MESSAGE LENGTHS.                                            00219902
*        3. MESSAGE FORMAT.                                             00220002
*      2. JOB FILE CONTROL BLOCK AREA (JFCB).                 176 BYTES 00226602
*      2. O/C/E INTERNAL EVENT CONTROL BLOCK AREA (ECB).        4 BYTES 00228602
*      2. O/C/E INTERNAL INPUT/OUTPUT BLOCK AREA (IOB).        40 BYTES 00230602
*      2. O/C/E INTERNAL DATA EXTENT BLOCK AREA (DEB).         44 BYTES 00232602
*      2. O/C/E INTERNAL DATA CONTROL BLOCK AREA (DCB).         4 BYTES 00233002
*      2. O/C/E INTERNAL CONTROL WORDS AREA (CCW).             96 BYTES 00233102
*      2. O/C/E COMMON EXTENDED WORK AREAS.                    64 BYTES 00233202
*      2. O/C/E PROTECTED CONTROL BLOCK POINTERS AREA.         40 BYTES 00239902
*      2. USER DCB COPY POINTERS AREA.                         16 BYTES 00241902
*      2. O/C/E ACCESS METHOD AREA.                             4 BYTES 00243902
*      2. O/C/E RECOVERY ROUTINE AUDIT TRAIL AREA.             24 BYTES 00245902
*                                                             --------- 00246037
*                                           DSECTSIZ TOTAL =  612 BYTES 00246237
*                                                                       00246502
*********************************************************************** 00253202
         EJECT                                                          00303302
*********************************************************************** 00842002
*                                                                       00850002
*        VOLUME LABEL AREA - SEE 'DATA SET LABELS- FL1 AND FL2'         00860002
*                                                                       00870002
*********************************************************************** 00872002
         SPACE 1                                                        00880000
DXLBL    DS    0CL80                                                    00900000
VOLLABI  DS    CL3                 LABEL IDENTIFIER                     00920000
VOLNO    DS    CL1                 VOLUME LABEL NUMBER                  00940000
VOLSERNO DS    CL6                                                      00960000
VOLSEC   DS    CL1                                                      00980000
         DS    0CL10               RESERVED                             01000000
VOLVTOC  DS    CL5                                                      01020000
         DS    CL5                                                      01040000
         DS    CL10                RESERVED                             01060000
         DS    CL10                RESERVED                             01080000
VOLOWNER DS    CL10                OWNER NAME AND ADDRESS CODE          01100000
         DS    CL29                RESERVED                             01120000
         SPACE 1                                                        01120102
*********************************************************************** 01120402
*                                                                       01120802
*        ANSI VOLUME LABEL AREA                                         01122002
*        (ANSI AND IBM STANDARD LABEL DIFFERENCES)                      01124002
*                                                                       01126020
*********************************************************************** 01126402
         SPACE 1                                                        01126802
         ORG   DXLBL+37                                                 01128002
AVOLOWNR DS    CL14                     OWNER IDENTIFICATION            01130020
         DS    CL28                     RESERVED                        01132020
LABSTAND DS    CL1                      LABEL STANDARD LEVEL            01134020
         SPACE 1                                                        01140000
*********************************************************************** 01150002
*                                                                       01152002
*        FILE LABEL 1 AREA - SEE 'DATA SET LABEL -- FL1'                01160002
*                                                                       01170002
*********************************************************************** 01172002
         SPACE 1                                                        01180000
         ORG   DXLBL                                                    01200000
FL1LABI  DS    CL3                 LABEL IDENTIFIER                     01220000
FL1NO    DS    CL1                 FILE LABEL NUMBER                    01240000
FL1ID    DS    CL17                FILE IDENTIFIER                      01260000
FL1FILSR DS    CL6                 FILE SERIAL NUMBER                   01280000
FL1VOLSQ DS    CL4                 VOLUME SEQUENCE NUMBER               01300000
FL1FILSQ DS    CL4                 FILE SEQUENCE NUMBER                 01320000
FL1GNO   DS    CL4                 GENERATION NUMBER                    01340000
FL1VNG   DS    CL2                 VERSION NUMBER OF GENERATION         01360000
FL1CREDT DS    CL6                 CREATION DATE                        01380000
FL1EXPDT DS    CL6                 EXPIRATION DATE                      01400000
FL1FSEC  DC    C'0'                FILE SECURITY INDICATOR              01420000
FL1BLKCT DS    CL6                 BLOCK COUNT                          01440000
FL1SYSCD DS    CL13                SYSTEM CODE                          01460000
FL1RES   DS    0CL7                RESERVED FOR FUTURE USE              01480000
         DS    CL1                                                      01500000
FL1RES1  DS    CL6                                                      01520000
         SPACE 1                                                        01540000
*********************************************************************** 01550002
*                                                                       01552002
*        FILE LABEL 2 AREA - SEE 'DATA SET LABEL -- FL2'                01560002
*                                                                       01570002
*********************************************************************** 01572002
         SPACE 1                                                        01580000
         ORG   FL1ID                                                    01600000
FL2RECFM DS    CL1                 RECORD FORMAT                        01620000
FL2BLKL  DS    CL5                 BLOCK LENGTH                         01640000
FL2LRECL DS    CL5                 BLOCKING FACTOR/RECORD LENGTH        01660000
FL2DEN   DS    CL1                 DENSITY                              01680000
FL2FILP  DS    CL1                 FILE POSITION                        01700000
FL2JSID  DS    0CL17               JOB/STEP IDENTIFICATION              01720000
FL2JOBD  DS    CL8                 JOB IDENTIFICATION                   01740000
FL2JSSP  DC    C'/'                SLASH                                01760000
FL2STEPD DS    CL8                 STEP IDENTIFICATION                  01780000
FL2TRTCH DS    CL2                 TAPE RECORDING TECHNIQUE             01800000
FL2CNTRL DS    CL1                 CARRAIGE CONTROL CHARACTER           01820000
         DS    CL1                     RESERVED FOR FUTURE USE          01830017
FL2BLKA  DS    CL1                     BLOCK ATTRIBUTE                  01840017
         DS    CL1                 RESERVED                      99223  01842002
FL2DRID  DS    0CL7                TAPE DRIVE ID                 99223  01844002
         DS    CL2                 RESERVED                      99223  01846002
FL2ID    DS    CL5                 ID OF CREATING DRIVE          99223  01848002
FL2DSIND DS    CL1                 DATA SET INDICATOR FIELD      Y02083 01848402
FL2RES   DS    CL32                RESERVED FOR FUTURE USE       Y02083 01850002
         SPACE 1                                                        01850102
*********************************************************************** 01850402
*                                                                       01851020
*        ANSI FILE LABEL 2 AREA                                         01852002
*        (ANSI AND IBM STANDARD FILE LABEL 2 DIFFERENCES)               01852402
*                                                                       01853020
*********************************************************************** 01853402
         SPACE 1                                                        01853802
         ORG   DXLBL+50                                                 01854002
FL2BUFOF DS    CL2                      BUFFER OFFSET                   01855020
         SPACE 1                                                        01860000
*********************************************************************** 01870002
*                                                                       01872002
*        DATA SET CONTROL BLOCK AREA - SEE 'FORMAT 1 DSCB'              01880002
*                                                                       01892002
*********************************************************************** 01894002
         SPACE 1                                                        01900000
         ORG   DXLBL                                                    01920000
DXDSCB   DS    0CL96                                                    01940000
DSCFMTID DC    C'1'                                                     01960000
DSCFILSR DS    CL6                 FILE SERIAL NUMBER                   01980000
DSCVOLSR DS    CL2                                                      02000000
DSCCREDT DS    CL3                 CREATION DATE IN DISCONTINOUS BIN    02020000
DSCEXPDT DS    CL3                 EXPIRATION DATE IN DISCONTINOUS BIN  02040000
DSCNOEXT DS    CL1                                                      02060000
DSCBLDBL DS    CL1                                                      02080000
         DS    CL1                                                      02100000
DSCSYSCD DS    CL13                SYSTEM CODE                          02120000
DSCREFD  DS    CL3                 DATE LAST REFERENCED        @ZA43489 02140037
         DS    CL4                                                      02150037
DSCFILTY DS    CL2                 FILE TYPE                            02160000
DSCRECFM DS    CL1                 RECORD FORMAT                        02180000
DSCOPTCD DS    CL1                 OPTION CODE                          02200000
DSCBLKL  DS    CL2                 BLOCK LENGTH                         02220000
DSCLRECL DS    CL2                 RECORD LENGTH                        02240000
DSCKEYL  DS    CL1                 KEY LENGTH                           02260000
DSCRKP   DS    CL2                 KEY LOCATION                         02280000
DSCDSIND DS    CL1                                                      02300000
DSCSCALO DS    CL4                                                      02320000
DSCLSTAR DS    CL3                 LAST USED TRACK AND BLOCK ON TRACK   02340021
DSCTRBAL DS    CL2                 BYTES REMAINING ON LAST TRACK USED   02360021
         DS    CL2                 RESERVED                             02370021
DSCEXTYP DS    CL1                 EXTENT TYPE INDICATOR                02380000
DSCEXTSQ DS    CL1                 EXTENT SEQUENCE NUMBER               02400000
DSCLOWLM DS    CL4                                                      02420000
DSCUPPLM DS    CL4                                                      02440000
DSCEXT1  DS    CL10                                                     02460000
DSCEXT2  DS    CL10                                                     02480000
DSCNEXT  DS    CL5                 POINTER TO NEXT RECORD               02500000
DSCCORE  DS    CL4                 CORE ADDRESS OF NEXT DSCB RECORD     02520000
DSCBEND  EQU   *                                                        02540000
         SPACE 1                                                        02560000
*********************************************************************** 02570002
*                                                                       02572002
*        DATA SET CONTROL BLOCK (FORMAT 3) KEY AREA                     02580002
*                                                                       02592002
*********************************************************************** 02594002
         SPACE 1                                                        02600000
         ORG   DXDSCB                                                   02620000
DXDSCB3K DS    0CL40                                                    02640000
DSCBF3C  DC    X'03030303'                                              02660000
DSCBEXSK DS    0CL40                                                    02680000
DSCBEXTY DS    CL1                 EXTENT TYPE INDICATOR                02700000
DSCBEXSQ DS    CL1                 EXTENT SEQUENCE NUMBER               02720000
DSCBLLMT DS    CL4                 CCHH LOWER LIMIT                     02740000
DSCBULMT DS    CL4                 CCHH UPPER LIMIT                     02760000
DSCBEX2  DS    CL10                ADDITIONAL EXTENT                    02780000
DSCBEX3  DS    CL10                ADDITIONAL EXTENT                    02800000
DSCBEX4  DS    CL10                ADDITIONAL EXTENT                    02820000
         SPACE 1                                                        02840000
*********************************************************************** 02850002
*                                                                       02852002
*        DATA SET CONTROL BLOCK (FORMAT 3) RECORD AREA                  02860002
*                                                                       02862002
*********************************************************************** 02870002
         SPACE 1                                                        02880000
         ORG   DXDSCB                                                   02900000
DSCBFMID DC    C'3'                FORMAT ID                            02920000
DSCBEXSD DS    0CL90               ADDITIONAL EXTENTS                   02940000
DSCBEX5  DS    CL10                ADDITIONAL EXTENT                    02960000
DSCBEX6  DS    CL10                ADDITIONAL EXTENT                    02980000
DSCBEX7  DS    CL10                ADDITIONAL EXTENT                    03000000
DSCBEX8  DS    CL10                ADDITIONAL EXTENT                    03020000
DSCBEX9  DS    CL10                ADDITIONAL EXTENT                    03040000
DSCBEXA  DS    CL10                ADDITIONAL EXTENT                    03060000
DSCBEXB  DS    CL10                ADDITIONAL EXTENT                    03080000
DSCBEXC  DS    CL10                ADDITIONAL EXTENT                    03100000
DSCBEXD  DS    CL10                ADDITIONAL EXTENT                    03120000
DSCBNEXT DS    CL5                 CCHHR OF NEXT FORMAT 3 DSCB          03140000
         SPACE 1                                                        03160000
*********************************************************************** 03170002
*                                                                       03172002
*        MESSAGE AREA                                                   03180002
*                                                                       03182002
*********************************************************************** 03190002
         SPACE 1                                                        03200000
         ORG   DXDSCB                                                   03220000
REPLYLTH DS    CL1                                                      03240000
REPLYADR DS    CL3                                                      03260000
REPLYECB DS    CL4                                                      03280000
MSGLSTSZ DS    CL2  MSG LENGTH                                     DM0Q 03290018
MCSFLAGS DS    CL2  FLAG FIELD FOR MCS                             DM0Q 03300018
MESSAGEA DS    CL68 MESSAGE AREA                                   DM0Q 03310018
DESCODE  DS    CL2  DESCRIPTOR CODE FOR MCS                        DM0Q 03320018
ROUTCODE DS    CL2  ROUTING CODE FOR MCS                           DM0Q 03330018
REPLY    DS    CL12 REPLY AREA                                     DM0Q 03340018
*                                                                       03360000
         ORG   MESSAGEA                                                 03380000
         SPACE 1                                                        03390002
*********************************************************************** 03392002
*                                                                       03400000
*        DEFINITION OF LENGTH OF MESSAGE COMPONENTS                     03420002
*                                                                       03440000
*********************************************************************** 03450002
         SPACE 1                                                        03452002
MSERL    EQU   3                        MESSAGE SERIAL NUMBER LENGTH    03460000
MINSTL   EQU   6                        MSG INSTRUCTION LTH INC MSG SER 03480000
MUNL     EQU   3                        MESSAGE UNIT NAME LENGTH        03500000
MVOLL    EQU   6                        MESSAGE VOLUME SERIAL LENGTH    03520000
         SPACE 1                                                        03530002
*********************************************************************** 03532002
*                                                                       03534002
* MTXTL        LENGTH MAY BE DEFINED BY EACH MODULE TO FIT REQUIREMENT  03540000
* MSGLTH       LENGTH OF FULL MSG DEFINED BY EACH MODULE                03560000
*                                                                       03562002
*********************************************************************** 03564002
         SPACE 1                                                        03570002
*********************************************************************** 03572002
*                                                                       03574002
*        MESSAGE FORMAT IS 'IEC000A M 000,00000  (TEXT)         '       03580002
*                                                                       03582002
*********************************************************************** 03590002
         SPACE 1                                                        03592002
MSGIOSUP DC    CL3'IEC'                 I/O SUPPORT MESSAGE IDENTITY    03600000
MSGSER   DS    0CL3                     MESSAGE SERIAL NUMBER           03620000
         ORG   MSGSER+MSERL-1                                           03640000
MSGSERLO DS    CL1                      VOLUME SERIAL LO ORDER BYTE     03660000
         ORG   MSGSER                                                   03680000
MSGINSTR DC    CL6'000A M'              MESSAGE INSTRUCTION INCL MSGSER 03700000
         ORG   MSGINSTR+MINSTL-1                                        03720000
MSGACTN  DS    CL1                      MESSAGE ACTION REQD BY OPERATOR 03740000
         DC    C' '                                                     03760000
MSGUN    DC    CL3'000'                 UNIT NAME THAT MSG REFERS TO    03780000
         DC    C','                                                     03800000
MSGVOLSR DC    CL6'000000'              VOLUME SERIAL THAT MSG REFRS TO 03820000
         DC    C','                                                     03840000
MSGTEXT  DS    0CL47                                               DM0Q 03860018
         SPACE 1                                                        03880000
*********************************************************************** 03892002
*                                                                       03894002
*        JOB FILE CONTROL BLOCK AREA - SEE 'JFCB'                       03900002
*                                                                       03910002
*********************************************************************** 03912002
         SPACE 1                                                        03920000
         ORG   DSCBEND                                                  03940000
DXJBF    DS    0CL176                                                   03960000
*        IEFJFCBN                                                Y02080 03980002
         IEFJFCBN                                                       03990002
         SPACE 1                                                        03992002
*********************************************************************** 04000002
*                                                                       04010002
*        O/C/E INTERNAL CONTROL BLOCKS AREA -                           04020002
*        SEE 'ECB', 'IOB', 'DEB', 'DCB'                                 04020402
*        THE CONTROL BLOCK AREAS THAT FOLLOW (DXECB, DXIOB,             04020802
*        DXADDR, DXXXX, AND THE CHANNEL COMMAND WORDS) ARE              04021202
*        USED BY THE O/C/EOV ROUTINES TO PERFORM I/O: READ              04021602
*        AND WRITE LABELS, POSITION TAPE VOLUMES, ETC.                  04021702
*                                                                       04022002
*********************************************************************** 04030002
         SPACE 1                                                        04040000
DXECB    DS    0CL4                     EVENT CONTROL BLOCK             04060002
         DC    X'00000000'                                              04080000
         SPACE 1                                                        04100000
*********************************************************************** 04110002
*                                                                       04112002
*        O/C/E INTERNAL INPUT/OUTPUT BLOCK                              04120002
*                                                                       04130002
*********************************************************************** 04132002
*                                                                       04134002
*  IF IOB=NO IS SPECIFIED 'DXIOB CL32' WILL BE THE ONLY                 04136002
*  FIELD GENERATED IN THE IOB SECTION OF IECDSECT.                      04138002
*  IF IOB=YES IS SPECIFIED OR IF IOB= IS OMITTED ALL IOB LABELS,        04138402
*  AS DESCRIBED IN THE IOB SECTION OF THIS MACRO, WILL BE EXPANDED.     04138802
*                                                                       04139202
*********************************************************************** 04139602
         SPACE 1                                                        04140000
         AIF   ('&IOB' EQ 'NO').IECA010                          S21940 04150000
         AIF   ('&IOB' EQ 'YES').IECA005                         S21940 04152000
         IHBERMAC 183,&IOB,YES                                          04154000
.IECA005 ANOP                                                    S21940 04156000
DXIOB    DS    0CL32                                                    04160000
IOBWRITE EQU   X'40' -                  IOB USE FOR WRITE        Y02080 04170002
IOBREAD  EQU   X'20' -                  IOB USED FOR READ        Y02080 04172002
IOBFLAG1 DC    X'00'                                                    04180000
IOBUNREL EQU   X'02' -                  UNRELATED FLAG           Y02080 04190002
IOBFLAG2 DC    X'00'                                                    04200000
IOBSENSE DS    0H                                                       04220000
IOBSENS0 DS    CL1                                                      04240000
IOBSENS1 DS    CL1                 SENSE BYTE "1"                       04260000
IOBECBPT DS    XL1                                                      04280000
         DC    AL3(DXECB)                                               04300000
IOBCSW   DS    0D                                                       04320000
IOBCOMAD DC    X'00000000'         KEY,0000,COMMAND ADDRESS             04340000
IOBSTAT0 DC    X'00'               STATUS BYTE 0                        04360000
IOBSTAT1 DC    X'00'               STATUS BYTE 1                        04380000
IOBCNT   DC    X'0000'             COUNT                                04400000
IOBSIOCC DS    XL1                                                      04420000
IOBSTART DC    AL3(DXCCW)                                               04440000
IOBWGHT  DS    XL1                                                      04460000
IOBDCBPT DC    AL3(DXDCB)                                               04480000
         DS    XL1                                                      04500000
         DS    XL3                                                      04520000
IOBINCAM DC    X'0000'                                                  04540000
IOBERRCT DS    XL2                                                      04560000
         AGO   .IECA015                                          S21940 04570000
.IECA010 ANOP                                                    S21940 04570100
DXIOB    DS    CL32                                              S21940 04570400
.IECA015 ANOP                                                    S21040 04572000
         SPACE 1                                                        04572402
DXDAADDR DS    D                   DIRECT ACCESS ADDRESS (MBBCCHHR)     04580000
         SPACE 1                                                        04600000
*********************************************************************** 04610002
*                                                                       04612002
*        O/C/E INTERNAL DATA EXTENT BLOCK                               04620002
*                                                                       04622002
*********************************************************************** 04630002
         SPACE 1                                                        04640000
DYYYY    DS    0CL44                                                    04660000
DXDEB    EQU   DYYYY-4                                                  04680000
DXDEBDEB DC    X'00000000'                                              04700000
DXDEBOFL DS    0CL1                                                     04720000
DXDEBIRB DC    X'00000000'                                              04740000
DXDEBSYS DC    X'00000000'                                              04760000
DXDEBUSR DC    X'00000000'                                              04780000
DXDEBECB DC    X'00000000'                                              04800000
DXDEBID  DS    0CL1                                                     04820000
DXDEBDCB DC    AL4(DXDCB)                                               04840000
DXDCBAD  EQU   DXDEBDCB                                                 04860000
DXDEBAPP DS    CL4                                                      04880000
DXDEBMOD DS    0CL1                                                     04900000
DXDEBUCB DS    F                                                        04920000
DXDEBBIN DS    H                                                        04940000
DXDEBSCC DS    H                                                        04960000
DXDEBSHH DS    H                                                        04980000
DXDEBECC DS    H                                                        05000000
DXDEBEHH DS    H                                                        05020000
DXDEBNTR DS    H                                                        05040000
         SPACE 1                                                        05060000
*********************************************************************** 05070002
*                                                                       05072002
*        O/C/E INTERNAL DATA CONTROL BLOCK                              05080002
*                                                                       05090002
*********************************************************************** 05092002
         SPACE 1                                                        05100000
DXXXX    DS    0F                                                       05120000
DXDCB    EQU   DXXXX-44            POINTER TO RELATIVE BEGINNING OF DCB 05140000
DXDCBDEB DC    A(DXDEB)                                                 05160000
         SPACE 1                                                        05180000
*********************************************************************** 05190002
*                                                                       05192002
*        O/C/E INTERNAL CHANNEL CONTROL WORDS                           05194002
*                                                                       05196002
*********************************************************************** 05204002
         SPACE 1                                                        05220000
         CNOP  0,8                                                      05240000
DXCCW    DS    0CL96                                                    05260000
DXCCW1   DS    D                                                        05280000
DXCCW2   DS    D                                                        05300000
DXCCW3   DS    D                                                        05320000
DXCCW4   DS    D                                                        05340000
DXCCW5   DS    D                                                        05360000
DXCCW6   DS    D                                                        05380000
DXCCW7   DS    D                                                        05400000
DXCCW8   DS    D                                                        05420000
DXCCW9   DS    D                                                        05440000
DXCCW10  DS    D                                                        05460000
DXCCW11  DS    D                                                        05480000
DXCCW12  DS    D                                                        05500000
         SPACE 1                                                 Y02080 05510002
DXOLDVOL DS    CL6                      LAST VOL SER IN EOV    @G32DSMI 05516037
DXRCFLAG DS    X                        RACF FLAG BYTE         @G32DSMI 05516637
DXRCOUT  EQU   X'80'                    RACF AUTH FOR OUTPUT   @G32DSMI 05517237
DXRCINP  EQU   X'40'                    RACF AUTH FOR INPUT    @G32DSMI 05517837
DXRCDEF  EQU   X'20'                    RACDEF DELETE NEEDED   @G32DSMI 05518437
DXFLAGG1 DS    X                        FLAG BYTE              @ZA40178 05519037
DXEX0A01 EQU   X'80'                    IFG0EX0A ASKS REREAD   @G60ASRB*05519337
                                        OF DSCB NOT FOUND-NEXT @G60ASRB*05519437
                                        NOT FOUND SKIPS EXIT   @G60ASRB 05519637
         SPACE 1                                                        05520000
*********************************************************************** 05522002
*                                                                       05524002
*        O/C/E COMMON EXTENDED MAIN WORK AREA                           05530002
*                                                                       05530402
*********************************************************************** 05532002
         SPACE 1                                                        05534002
DXXCTL   DS    CL8                      TRANSFER CONTROL AREA    Y02134 05534402
         SPACE 1                                                 Y02134 05534802
DXWORK   DS    F                        WORK FIELD               Y02134 05535202
DXWORK1  DS    F                        WORK FIELD               Y02134 05535602
DXWORK2  DS    F                        WORK FIELD               Y02134 05535702
DXWORK3  DS    F                        WORK FIELD               Y02134 05535802
DXWORK4  DS    F                        WORK FIELD               Y02134 05535902
         SPACE 1                                                 Y02134 05536702
DXVOLSR  DS    0CL18                    VOLUME SERIAL NUMBERS    Y02080 05538602
DXVOLMT1 DS    0CL6                     VOLUME TO BE DISMOUNTED  Y02134 05540002
DXVOLSR1 DS    CL6                      VOLUME TO BE DISMOUNTED  Y02134 05540202
DXVOLMT2 DS    0CL6                     VOLUME TO BE MOUNTED     Y02134 05541002
DXVOLSR2 DS    CL6                      VOLUME TO BE MOUNTED     Y02134 05541802
DXVOLMT3 DS    0CL6                     LOOK AHEAD MOUNT VOLUME  Y02134 05542602
DXVOLSR3 DS    CL6                      LOOK AHEAD MOUNT VOLUME  Y02134 05543402
         SPACE 1                                                        05544202
DXVOLSEQ DS    H                        VOLUME SEQUENCE NUMBER   Y02080 05545002
DXNOUNIT DS    H                        NUMBER UNITS ALLOCATED   Y02080 05546302
DXUNITOF DS    H                        OFFSET TO CURRENT UNIT   Y02080 05546602
         SPACE 1                                                 Y02080 05550002
DXRESSW  DS    CL1                      RESIDENT ROUTINE INDICTR Y02134 05552002
DXWKEYSV DS    AL1                      SAVED KEY OF IECRES CALL Y02082 05554002
DXUKEY   DS    AL1                      O/C/E CALLERS KEY        Y02080 05555202
DXEXTSW  DS    AL1                      EXTEND SWITCH            Y02080 05555602
         SPACE 1                                                 Y02080 05556102
*********************************************************************** 05556602
*                                                                       05557002
*        POINTERS TO CONTROL BLOCKS IN PROTECTED STORAGE                05558002
*                                                                       05558402
*********************************************************************** 05566402
         SPACE 1                                                 Y02080 05574602
DXASCBAD DS    AL4                      POINTER TO ASCB          Y02080 05582602
DXTCBADR DS    AL4                      POINTER TO TCB           Y02080 05590602
DXJSCBAD DS    AL4                      POINTER TO JSCB          Y02080 05598602
DXDSABQD DS    AL4                      POINTER TO DSAB QDB      Y02080 05606602
DXDSABAD DS    AL4                      POINTER TO FIRST DSAB    Y02080 05616602
DXDSAB   DS    AL4                      POINTER TO CURRENT DSAB  Y02080 05618602
DXDEBXAD DS    AL4                      POINTER TO DEB EXTENSION Y02080 05626602
DXTIOTAD DS    AL4                      POINTER TO TIOT          Y02080 05636602
DXUCBADR DS    AL4                      POINTER TO CURRENT UCB   Y02080 05646602
DXUCBSAV DS    AL4                      SAVED UCB POINTER        Y02134 05646702
         SPACE 1                                                 Y02080 05647002
*********************************************************************** 05648902
*                                                                       05650902
*        USER DCB COPY POINTERS AREA:                                   05651102
*                                                                       05652702
*********************************************************************** 05652802
         SPACE 1                                                 Y02082 05655002
*                                                                Y02082 05656602
* ORIGINAL DCB INFO NEEDED BY INIT AND INITIAL COPY              Y02082 05656702
*                                                                Y02082 05656802
         SPACE 1                                                 Y02082 05656902
* INFO FROM COMMON INTERFACE                                     Y02082 05657002
         ORG   DXWORK                   AFTER FOUNDATION         Y02134 05657402
DXWDSORG DS    0BL2                     COPIED DATA SET ORG USED Y02082 05657802
DXWDSRG1 DS    BL1                      FIRST BYTE OF DCBDSORG   Y02082 05657902
DXWDSRG2 DS    BL1                      SECOND BYTE OF DCBDSORG  Y02082 05658002
         SPACE 1                                                 Y02082 05658202
* FOUNDATION BEFORE OPEN                                         Y02082 05658302
         ORG   DXWORK+4                 OVERLAY 16 BYTES         Y02082 05658402
DXWFOUN  DS    0CL12                    DCB FOUNDATION           Y02082 05658502
DXWDDNAM DS    CL8                      DDNAME                   Y02082 05658602
DXWOFLGS DS    BL1                      OPEN FLAGS               Y02082 05658702
DXWIFLG  DS    BL1                      ERROR FLAGS FOR IOS      Y02082 05658802
DXWMACR  DS    0BL2                     TYPE I/O MACRO INSTR     Y02082 05658902
DXWMACR1 DS    BL1                      FIRST BYTE DCBMACR1      Y02082 05659002
DXWMACR2 DS    BL1                      SECOND BYTE DCBMACR2     Y02082 05659202
         SPACE 1                                                 Y02082 05659302
* FOUNDATION AFTER OPEN                                          Y02082 05659402
         ORG   DXWORK+4                 OVERLAY 4 WORDS          Y02082 05659502
DXWTIOT  DS    H                        OFFSET TO DD ENTRY TIOT  Y02082 05659602
DXWMACRF DS    0BL2                     TYPE I/O MACRO INSTR     Y02082 05659702
DXWMACF1 DS    BL1                      FIRST BYTE DCBMACF1      Y02082 05659802
DXWMACF2 DS    BL1                      SECOND BYTE DCBMACF2     Y02082 05660002
DXWDEBAD DS    0A                       ADDR OF DEB              Y02082 05660402
DXWIFLGS DS    BL1                      ERROR FLAGS FOR IOS      Y02082 05660502
         DS    AL3                      DEB ADDR                 Y02134 05660602
         ORG   DXWORK+16                ORG PAST FOUNDATION      Y02082 05660702
DXWCOPYE DS    BL1                      COPY ERROR CODE:         Y02082 05661002
*                                       0 = GOOD, 1 = BAD        Y02082 05661402
DXWMCR   DS    0BL2                     COMMON MACREF            Y02134 05661802
DXWMCR1  DS    BL1                      FIRST BYTE OF DCB MACREF Y02134 05661902
DXWMCR2  DS    BL1                      SECOND BYTE OF DCB MACRF Y02134 05662002
         DS    0F                                                Y02082 05662102
         ORG   ,                        RESET LOCATION COUNTER   Y02082 05662202
DXUDCBAD DS    AL4                      POINTER TO USER DCB      Y02082 05662502
DXPDCBAD DS    AL4                      POINTER TO COPIED DCB    Y02082 05663802
DXUDCBPL DS    H                        LNTH OF USER DCB PREFIX  Y02082 05664202
DXUDCBML DS    H                        LNTH OF MOVED DCB        Y02082 05664602
DXPRPARC DS    AL4                      SAVED PARM LIST POINTER  Y02082 05664702
         SPACE 1                                                 Y02080 05667002
*********************************************************************** 05667602
*                                                                       05668202
*        ACCESS METHOD AREA                                      Y02080 05668902
*                                                                       05670202
*********************************************************************** 05671502
         SPACE 1                                                 Y02080 05672802
DXMSGADR DS    AL4                      POINTER TO MSG CSECT     Y02080 05674102
         SPACE 1                                                 Y02080 05675802
*********************************************************************** 05676702
*                                                                       05678002
*        RECOVERY ROUTINE DCB AUDIT TRAIL AREA                   Y02080 05679302
*                                                                       05680602
*********************************************************************** 05681902
         SPACE 1                                                 Y02080 05683202
DXATCOM1 DS    0CL4                     COMMON O/C/E AUDIT INFO  Y02144 05683302
*                                                                Y02144 05683702
DXATGENS DS    B                        GENERAL STATUS           Y02144 05684102
*                                                                Y02144 05684502
DXATDMCT EQU   X'80'                    DATA MGMT CNT INCREMENT  Y02144 05684902
DXATREFR EQU   X'40'                    ON, DON'T COPY BACK DCB  YM1275 05685302
DXATDISP EQU   X'20'                    VOLUME DISP PERFORMED    Y02144 05685702
DXATJFCB EQU   X'10'                    JFCB READ OK             Y02144 05686102
DXATVGIV EQU   X'0E'                    A.M. STRING/CI GIVEN CTL Y02144 05686502
DXATVSMG EQU   X'08'                    VSAM STRING GIVEN CONTRL Y02144 05686902
DXATVTMG EQU   X'04'                    VTAM STRING GIVEN CONTRL Y02144 05687302
DXATVCIG EQU   X'02'                    ISAM-VSAM CI GIVEN CNTRL Y02144 05687702
DXATSRET EQU   X'01'                    A.M. STRING RETURNED CTL Y02144 05688102
*                                                                Y02144 05688502
DXATCLOS DS    C                        CLOSE FINAL PROCESSING   Y02144 05688902
*                                                                Y02144 05689302
DXATDBCK EQU   X'02'                    DEB DELETED FROM DEB TBL Y02144 05689402
DXATDELT EQU   X'04'                    A.M. ROUTINES AND I/O    Y02144 05689702
*                                       APPENDAGES DELETED       Y02144 05690102
DXATUTOT EQU   X'08'                    USER TOTALING SAVE AREA  Y02144 05690502
*                                       RELEASED                 Y02144 05690902
DXATRDCB EQU   X'0C'                    DCB RESTORATION FINISHED Y02144 05691302
DXATRDEB EQU   X'10'                    DEB REMOVED FR DEB CHAIN Y02144 05691402
DXATSABS EQU   X'14'                    STARTED DECREMENTING     Y02144 05691502
*                                       OPEN COUNT IN DSAB(S)    Y02144 05691602
DXATSABF EQU   X'18'                    FINISHED DECREMENTING    Y02144 05691802
*                                       OPEN COUNT IN DSAB(S)    Y02144 05691902
DXATDMS  EQU   X'1C'                    STARTED DECREMENTING     Y02144 05692002
*                                       DATA MGMT CNT IN UCB(S)  Y02144 05692102
DXATDMF  EQU   X'20'                    FINISHED DECREMENTING    Y02144 05692302
*                                       DATA MGMT CNT IN UCB(S)  Y02144 05692402
DXATIRB  EQU   X'28'                    IRB (IF ANY) HANDLED     Y02144 05692602
DXATRRQ  EQU   X'2C'                    RELATED REQUEST Q FREED  Y02144 05692702
DXATDEB  EQU   X'30'                    DEB CORE FREED           Y02144 05692802
DXATDEBX EQU   X'34'                    DEB EXTENSION CORE FREED Y02144 05692902
*                                                                Y02144 05693002
DXATOUTA DS    B                        OUTPUT TAPE DATA SET     Y02144 05693102
*                                       STATUS                   Y02144 05693202
DXATVLHD EQU   X'80'                    VOL1 OR HDR LBL WRITTEN  Y02144 05693302
DXATHDTM EQU   X'40'                    TM WRITTEN AFTER HDR LBL Y02144 05693402
DXATDATM EQU   X'20'                    TM WRITTEN AFTER DATA    Y02144 05693502
DXATTRL1 EQU   X'10'                    TRL1 LABEL WRITTEN       Y02144 05693702
DXATTRL2 EQU   X'08'                    TRL2 LABEL WRITTEN       Y02144 05694102
DXATTTM1 EQU   X'04'                    1ST TRAILING TM WRITTEN  Y02144 05694502
DXATTTM2 EQU   X'02'                    2ND TRAILING TM WRITTEN  Y02144 05694902
DXATNSL  EQU   X'01'                    NSL OUTPUT RTN GIVEN CTL Y02144 05695302
*                                                                Y02144 05695702
DXATDACC DS    B                        DIRECT ACCESS D/S STATUS Y02144 05696102
*                                                                Y02144 05696502
DXATF1CE EQU   X'80'                    FMT 1 DSCB REREAD IF     Y02144 05696902
*                                       CLOSE EXECS CALLED EOV   Y02144 05697302
DXATTRAK EQU   X'40'                    LAST TRACK USED & TRACK  Y02144 05697702
*                                       BALANCE FIELDS IN DSCB   Y02144 05698102
*                                       UPDATED FOR OUTPUT PS    Y02144 05698502
*                                       AND PO DATA SETS         Y02144 05698902
DXATDRCT EQU   X'20'                    DIRECTORY COUNT UPDATED  Y02144 05699302
DXATUPDB EQU   X'10'                    UPDATED DSCB WRITTEN     Y02144 05699702
DXATSMF  EQU   X'08'                    SMF RTN GIVEN CONTROL    YM4614 05700102
DXATEOF  EQU   X'02'                    EOF MARK WRITTEN: PS D/S Y02144 05700902
DXATRDDB EQU   X'01'                    DSCB READ                Y02144 05701302
*                                                                Y02144 05701702
DXATCOM2 DS    0CL4                     COMMON O/C/E AUDIT INFO  Y02144 05702102
*                                                                Y02144 05702502
DXATEOV  DS    B                        EOV PROCESSING           Y02144 05702902
*                                                                Y02144 05703302
DXATCCAT EQU   X'80'                    CONCATENATION            Y02144 05703702
DXATNVOL EQU   X'40'                    NEW VOLUME               Y02144 05704102
DXATDCHN EQU   X'20'                    DEB DECHAINED            Y02144 05704502
DXATDFRE EQU   X'10'                    DEB CORE FREED           Y02144 05704602
DXATDNEW EQU   X'08'                    NEW DEB CORE GOTTEN      Y02144 05704702
DXATREMT EQU   X'04'                    DEB REMOVED FROM DEB TBL Y02144 05704802
DXATDADM EQU   X'02'                    EOV WENT TO EXTEND       Y02144 05705202
DXATVCAT EQU   X'01'                    EOV WENT TO VSAM CATLG   Y02144 05705302
*                                                                Y02144 05705402
DXATOPEN DS    B                        OPEN PROCESSING          Y02144 05705502
*                                                                Y02144 05705602
DXATIGN  EQU   X'80'                    IGNORE OPTION ACTIVE     Y02144 05708302
DXATMODS EQU   X'40'                    DCB MERGE LOOP STARTED   Y02144 05708402
DXATMODE EQU   X'20'                    DCB MERGE DONE           Y02144 05709002
DXATMODM EQU   X'10'                    DCB MOD MASK IN DEB      Y02144 05709402
*                                       EXTENSION IS VALID       Y02144 05709802
DXATDSIN EQU   X'08'                    DSAB COUNT INCR STARTED  Y02144 05711002
DXATDFIN EQU   X'04'                    DSAB COUNT INCR FINISHED Y02144 05711402
*                                                                Y02144 05711502
DXATALL  DS    B                        COMMON AUDIT FLAGS       YM7099 05712602
*                                                                YM7099 05712802
DXATFC   EQU   X'80'                    PAST PT FOR NORMAL CLOSE YM7099 05713002
*                                       MUST ATTEMPT FORCE CLOSE YM7099 05713202
*                                       ON EOV OR TCLOSE ERROR   YM7099 05713402
DXATSWAP EQU   X'40'                    SYSEVENT OKSWAP INDICATR YM8511 05713602
         DS    CL1                      RESERVED                 YM7099 05713802
DXATCOM3 DS    AL4                      RRPLIST ADDRESS          Y02144 05714602
DXATCOM4 DS    AL4                      CRSA PTR FOR RECOVERY    Y02144 05717402
         SPACE 1                                                 Y02080 05723002
DXATEXC1 DS    AL4                      EXECUTOR AUDIT TRAIL     Y02080 05725802
DXEXHASP EQU   X'80'                    HASP CONTROL IND       @ZA02504 05725903
DXEXTCAM EQU   X'40'                    TCAM CONTROL IND       @ZA41849 05726937
DXATEXC2 DS    AL4                      EXECUTOR AUDIT TRAIL     Y02080 05728602
*                                                                       05755737
**************************************************************** Y02080 05756637
*                                                                       05757037
DSECTSIZ EQU   *-DXLBL                  WORKAREA SIZE            Y02080 05763237
*                                                                       05769437
**************************************************************** Y02080 05775637
         MEND                                                           05781837
.*                                                            Y02134 */ 05788037
*%PLSGEN:;                                                   /*Y02134*/ 05794237
*/********************************************************************* 05800437
*                                                                       05806602
*        THIS MACRO IS USED TO DEFINE AND MAP THE O/C/E WORK AREA.      05856602
*                                                                       05906602
*        O/C/E = OPEN, OPEN TYPE=J, CLOSE, CLOSE TYPE=T,                05956602
*                EOV, FEOV, & RDJFCB.                                   06006602
*                                                                       06056602
*********************************************************************** 06106602
                                                                        06156602
*********************************************************************** 06206602
*                                                                       06256602
*        O/C/E WORK AREA FORMAT AND LENGTHS                             06306602
*                                                                       06356602
*********************************************************************** 06406602
*                                                                       06456602
*        VS2 RELEASE 03 DELETIONS/CHANGES                               06456703
*0000                                                          @ZA02504 06456803
*                                                                       06456903
*    1. O/C/E COMMON WORK AREA.                       TOTAL = 652 BYTES 06506637
*      2. VOLUME LABEL AREA.                                  100 BYTES 06556602
*      2. JOB FILE CONTROL BLOCK AREA (JFCB).                 176 BYTES 07206602
*      2. O/C/E INTERNAL EVENT CONTROL BLOCK AREA (ECB).        4 BYTES 07256602
*      2. O/C/E INTERNAL INPUT/OUTPUT BLOCK AREA (IOB).        40 BYTES 07306602
*      2. O/C/E INTERNAL DATA EXTENT BLOCK AREA (DEB).         44 BYTES 07356602
*      2. O/C/E INTERNAL DATA CONTROL BLOCK AREA (DCB).         4 BYTES 07406602
*      2. O/C/E INTERNAL CONTROL WORDS AREA (CCW).             96 BYTES 07456602
*      2. O/C/E COMMON EXTENDED WORK AREAS.                    64 BYTES 07506602
*      2. O/C/E PROTECTED CONTROL BLOCK POINTERS AREA.         40 BYTES 07556602
*      2. USER DCB COPY POINTERS AREA.                         16 BYTES 07606602
*      2. O/C/E ACCESS METHOD AREA.                             4 BYTES 07656602
*      2. O/C/E RECOVERY ROUTINE AUDIT TRAIL AREA.             24 BYTES 07706602
*      2. RAC INFORMATION.                                      8 BYTES 07716637
*      2. O/C/E COMMON EXTENDED WORK AREAS EXTENSION           32 BYTES 07726637
*                                                             --------- 07756602
*                                           DSECTSIZ TOTAL =  652 BYTES 07806637
*                                                                       07856602
**********************************************************************/ 07906602
*DCL 1 FORCORE BASED(RCORE) BDY(DWORD),                                 07956602
*      2 DXDSCB   CHAR(96),             /*DATA SET CONTROL BLOCK     */ 08006602
*        3 DXLBL    CHAR(80),           /*DATA SET LABEL             */ 08056602
*      2 DSCCORE  PTR(31),              /*CORE ADDRESS OF NEXT DSCB  */ 08106602
*      2 DXJBF    CHAR(176),            /*JOB FILE CONTROL BLOCK     */ 08156602
*      2 DXECB    CHAR(4),              /*INTERNAL ECB               */ 08206602
*      2 DXIOB    CHAR(32),             /*INTERNAL IOB               */ 08256602
*      2 DXDAADDR CHAR(8),              /*MBBCCHHR                   */ 08306602
*        3 *        CHAR(4),            /*FILLER               YM8551*/ 08316602
*        3 DXDEB    CHAR(4),            /*INTERNAL DEB         YM8551*/ 08326602
*      2 DXDCB    CHAR(48) BDY(WORD),   /*INTERNAL DCB               */ 08356602
*        3 *        CHAR(20),           /*FILLER               YM8551*/ 08366602
*        3 DXDEBDCB PTR(31),            /*INTERNAL DCB PTR     YM8551*/ 08376602
*        3 *        CHAR(20),           /*FILLER               YM8551*/ 08406602
*        3 DXDCBDEB PTR(31),            /*INTERNAL DCB'S DEB POINTER */ 08456602
*                                                                       08466602
*/*            O/C/E INTERNAL CCWS                                   */ 08506602
*                                                                       08556602
*      2 DXCCW    CHAR(96) BDY(DWORD),  /*CCW AREA                   */ 08606602
*        3 DXCCW1   CHAR(8) BDY(DWORD),                                 08656602
*        3 DXCCW2   CHAR(8) BDY(DWORD),                                 08706602
*        3 DXCCW3   CHAR(8) BDY(DWORD),                                 08756602
*        3 DXCCW4   CHAR(8) BDY(DWORD),                                 08806602
*        3 DXCCW5   CHAR(8) BDY(DWORD),                                 08856602
*        3 DXCCW6   CHAR(8) BDY(DWORD),                                 08906602
*        3 DXCCW7   CHAR(8) BDY(DWORD),                                 08956602
*        3 DXCCW8   CHAR(8) BDY(DWORD),                                 09006602
*        3 DXCCW9   CHAR(8) BDY(DWORD),                                 09056602
*        3 DXCCW10  CHAR(8) BDY(DWORD),                                 09106602
*        3 DXCCW11  CHAR(8) BDY(DWORD),                                 09156602
*        3 DXCCW12  CHAR(8) BDY(DWORD),                                 09206602
*                                                                       09506602
*/*            O/C/E COMMON EXTENDED WORKAREA                        */ 09556602
*                                                                       09606602
*      2 DXOLDVOL CHAR(6),              /* LAST VOL SER - EOV@G32DSMI*/ 09607437
*      2 DXRCFLAG CHAR(1),              /* RACF FLAG BYTE    @G32DSMI*/ 09607537
*        3 DXRCOUT BIT(1),              /* RACF AUTH FOR OUT @G32DSMI*/ 09607637
*        3 DXRCINP BIT(1),              /* RACF AUTH FOR IN  @G32DSMI*/ 09607737
*        3 DXRCDEF BIT(1),              /* RACDEF DELETE     @G32DSMI*/ 09607837
*        3 *       BIT(5),              /* RESERVED          @G32DSMI*/ 09607937
*      2 DXFLAGG1 CHAR(1),              /* FLAG BYTE         @ZA40178*/ 09608037
*        3 DXEX0A01 BIT(1),             /* IFG0EX0A ASKS     @G60ASRB   09608337
*                                          REREAD OF DSCB NOT@G60ASRB   09608637
*                                          FOUND-NEXT NOT    @G60ASRB   09608937
*                                          FOUND SKIPS EXIT  @G60ASRB*/ 09609237
*        3 *        BIT(7),             /* RESERVED          @G60ASRB*/ 09609537
*      2 DXXCTL   CHAR(8),              /*TRANSFER CONTROL AREA      */ 09610337
*      2 DXWORK   CHAR(4),              /*WORK FIELD                 */ 09610602
*      2 DXWORK1  CHAR(4),              /*WORK FIELD                 */ 09611002
*      2 DXWORK2  CHAR(4),              /*WORK FIELD                 */ 09616302
*      2 DXWORK3  CHAR(4),              /*WORK FIELD                 */ 09616402
*      2 DXWORK4  CHAR(4),              /*WORK FIELD                 */ 09616502
*      2 DXVOLSR CHAR(18),              /*VOLUME SERIAL NUMBERS      */ 09616602
*        3 DXVOLSR1 CHAR(6),            /*VOLUME TO BE DISMOUNTED    */ 09636602
*          4 DXVOLMT1 CHAR(6),          /*VOLUME TO BE DISMOUNTED    */ 09646602
*        3 DXVOLSR2 CHAR(6),            /*VOLUME TO BE MOUNTED       */ 09648602
*          4 DXVOLMT2 CHAR(6),          /*VOLUME TO BE MOUNTED       */ 09649002
*        3 DXVOLSR3 CHAR(6),            /*LOOK AHEAD MOUNT VOLUME    */ 09650602
*          4 DXVOLMT3 CHAR(6),          /*LOOK AHEAD MOUNT VOLUME    */ 09652602
*      2 DXVOLSEQ FIXED(15),            /*VOLUME SEQUENCE NUMBER     */ 09654602
*      2 DXNOUNIT FIXED(15),            /*NO. UNITS ALLOCATED        */ 09655002
*      2 DXUNITOF FIXED(15),            /*OFFSET TO CURRENT UNIT     */ 09705002
*      2 DXRESSW  CHAR(1),              /*RESIDENT ROUTINE INDICATOR */ 10006602
*      2 DXWKEYSV CHAR(1),              /*SAVED KEY OF IECRES CALL   */ 10016602
*      2 DXUKEY   CHAR(1),              /*CALLER'S KEY               */ 10036602
*      2 DXEXTSW  CHAR(1),              /*DADSM EXTEND SWITCH        */ 10086602
*                                                                       10186602
*/*            O/C/E PROTECTED CONTROL BLOCK POINTERS AREA           */ 10236602
*                                                                       10286602
*      2 DXASCBAD PTR(31),              /*ASCB ADDRESS               */ 10336602
*      2 DXTCBADR PTR(31),              /*TCB ADDRESS                */ 10386602
*      2 DXJSCBAD PTR(31),              /*ACTIVE JSCB ADDRESS        */ 10436602
*      2 DXDSABQD PTR(31),              /*DSAB QDB ADDRESS           */ 10486602
*      2 DXDSABAD PTR(31),              /*FIRST DSAB ADDRESS         */ 10536602
*      2 DXDSAB   PTR(31),              /*CURRENT DSAB ADDRESS       */ 10546602
*      2 DXDEBXAD PTR(31),              /*DEB EXTENSION ADDRESS      */ 10586602
*      2 DXTIOTAD PTR(31),              /*CURRENT TIOT ENTRY ADDRESS */ 10636602
*      2 DXUCBADR PTR(31),              /*UCB ADDRESS                */ 10686602
*      2 DXUCBSAV PTR(31),              /*SAVED UCB ADDRESS          */ 10696602
*        3 * CHAR(1),                   /*FLAG BYTE            YM6525*/ 10716602
*        3 DXUCBSVV PTR(24),            /*SAVED UCB ADDRESS    YM6525*/ 10720602
*                                                                       10736602
*/*            USER DCB COPY POINTERS AREA                           */ 10786602
*                                                                       10836602
*      2 DXUDCBAD PTR(31),              /*POINTER TO CALLER'S DCB    */ 10886602
*        3 * CHAR(1),                   /*FLAG BYTE            YM6525*/ 10906602
*        3 DXUACBAD PTR(24),            /*USER ADDR OF ACB/DCB YM6525*/ 10926602
*      2 DXPDCBAD PTR(31),              /*POINTER TO COPIED DCB      */ 10986602
*        3 * CHAR(1),                   /*FLAG BYTE            YM6525*/ 10990602
*        3 DXPACBAD PTR(24),            /*COPY ADDR OF ACB/DCB YM6525*/ 10994602
*      2 DXUDCBPL FIXED(15),            /*LENGTH OF USER DCB PREFIX  */ 10996602
*      2 DXUDCBML FIXED(15),            /*LENGTH OF MOVED DCB        */ 11006602
*      2 DXPRPARC PTR(31),              /*SAVED PARM LIST POINTER    */ 11036602
*                                                                       11136602
*      2 DXMSGADR PTR(31),              /*POINTER TO MSG CSECT       */ 11186602
*                                                                       11236602
*/*            RECOVERY ROUTINE DCB AUDIT TRAIL AREA                 */ 11286602
*                                                                       11336602
*      2 DXATCOM1        CHAR(4),       /*COMMON O/C/E AUDIT TRAIL   */ 11386602
*        3 DXATGENS      CHAR(1),       /*GENERAL STATUS             */ 11386702
*          4 DXATDMCT    BIT(1),        /*DATA MGMT CNT INCREMENTED  */ 11386802
*          4 DXATREFR    BIT(1),        /*ON,DON'T COPY DCB    YM1275*/ 11386902
*          4 DXATDISP    BIT(1),        /*VOLUME DISP PERFORMED      */ 11387002
*          4 DXATJFCB    BIT(1),        /*JFCB READ OK               */ 11387102
*          4 DXATVGIV    BIT(3),        /*A.M. STRING/CI GIVEN CONTRL*/ 11387202
*            5 DXATVSMG  BIT(1),        /*VSAM STRING GIVEN CONTROL  */ 11387302
*            5 DXATVTMG  BIT(1),        /*VTAM STRING GIVEN CONTROL  */ 11387402
*            5 DXATVCIG  BIT(1),        /*ISAM-VSAM CI GIVEN CONTROL */ 11387502
*          4 DXATSRET    BIT(1),        /*A.M. STRING RETURNED CONTRL*/ 11387602
*        3 DXATCLOS      FIXED(8),      /*CLOSE FINAL PROCESSING     */ 11387802
*        3 DXATOUTA      CHAR(1),       /*OUTPUT TAPE D/S STATUS     */ 11387902
*          4 DXATVLHD    BIT(1),        /*VOL1 OR HDR LABEL WRITTEN  */ 11388002
*          4 DXATHDTM    BIT(1),        /*TM WRITTEN AFTER HDR LABELS*/ 11388102
*          4 DXATDATM    BIT(1),        /*TM WRITTEN AFTER DATA      */ 11388202
*          4 DXATTRL1    BIT(1),        /*TRL1 LABEL WRITTEN         */ 11388302
*          4 DXATTRL2    BIT(1),        /*TRL2 LABEL WRITTEN         */ 11388402
*          4 DXATTTM1    BIT(1),        /*FIRST TRAILING TM WRITTEN  */ 11388502
*          4 DXATTTM2    BIT(1),        /*SECOND TRAILING TM WRITTEN */ 11388602
*          4 DXATNSL     BIT(1),        /*NSL OUTPUT RTN GIVEN CONTRL*/ 11388702
*        3 DXATDACC      CHAR(1),       /*DIRECT ACCESS D/S STATUS   */ 11388902
*          4 DXATF1CE    BIT(1),        /*FMT 1 DSCB REREAD IF CLOSE    11389002
*                                         EXECUTORS CALLED EOV       */ 11389102
*          4 DXATTRAK    BIT(1),        /*LAST TRACK USED AND TRACK     11389202
*                                         BALANCE FIELDS IN DSCB        11389302
*                                         UPDATED FOR OUTPUT PS AND     11389402
*                                         PO DATA SETS               */ 11389502
*          4 DXATDRCT    BIT(1),        /*DIRECTORY COUNT UPDATED FOR   11389602
*                                         BPAM DATA SET              */ 11389702
*          4 DXATUPDB    BIT(1),        /*UPDATED DSCB WRITTEN       */ 11389902
*          4 DXATSMF     BIT(1),        /*SMF RTN GIVEN CONTRL YM4614*/ 11390002
*          4 *           BIT(1),        /*RESERVED             YM4614*/ 11390102
*          4 DXATEOF     BIT(1),        /*EOF MARK WRITTEN FOR PS DS */ 11390202
*          4 DXATRDDB    BIT(1),        /*DSCB READ                  */ 11390302
*      2 DXATCOM2        CHAR(4),       /*COMMON O/C/E AUDIT TRAIL   */ 11436602
*        3 DXATEOV       CHAR(1),       /*EOV PROCESSING             */ 11436702
*          4 DXATCCAT    BIT(1),        /*CONCATENATION              */ 11436802
*          4 DXATNVOL    BIT(1),        /*NEW VOLUME                 */ 11436902
*          4 DXATDCHN    BIT(1),        /*DEB DECHAINED              */ 11437002
*          4 DXATDFRE    BIT(1),        /*DEB CORE FREED             */ 11437102
*          4 DXATDNEW    BIT(1),        /*NEW DEB CORE GOTTEN        */ 11437202
*          4 DXATREMT    BIT(1),        /*DEB REMOVED FROM DEB TBL   */ 11437302
*          4 DXATDADM    BIT(1),        /*EOV WENT TO EXTEND         */ 11437502
*          4 DXATVCAT    BIT(1),        /*EOV WENT TO VSAM CATLG 550Y*/ 11437602
*        3 DXATOPEN      CHAR(1),       /*OPEN PROCESSING            */ 11438002
*          4 DXATIGN     BIT(1),        /*IGNORE OPTION ACTIVE       */ 11438202
*          4 DXATMODS    BIT(1),        /*DCB MERGE LOOP STARTED     */ 11438302
*          4 DXATMODE    BIT(1),        /*DCB MERGE DONE             */ 11438702
*          4 DXATMODM    BIT(1),        /*DEBX DCB MOD MASK IS VALID */ 11438802
*          4 DXATDSIN    BIT(1),        /*DSAB COUNT INCR STARTED    */ 11439002
*          4 DXATDFIN    BIT(1),        /*DSAB COUNT INCR FINISHED   */ 11439402
*          4 *           BIT(2),        /*RESERVED                   */ 11439502
*        3 DXATALL       CHAR(1),       /*COMMON AUDIT FLAGS   YM7099*/ 11440002
*          4 DXATFC      BIT(1),        /*PAST POINT FOR NORMAL CLOSE-- 11441002
*                                         MUST ATTEMPT FORCE CLOSE ON   11441202
*                                         EOV OR TCLOSE ERROR  YM7099*/ 11441702
*          4 DXATSWAP    BIT(1),        /*SYSEVENT OKSWAP IND  YM8511*/ 11441902
*          4 *           BIT(6),        /*RESERVED             YM8511*/ 11442002
*        3 *             CHAR(1),       /*RESERVED                   */ 11460002
*      2 DXATCOM3        PTR(31),       /*RRPLIST ADDRESS            */ 11486602
*      2 DXATCOM4        PTR(31),       /*CRSA PTR USED BY RECOVERY  */ 11536602
*                                                                       11586602
*      2 DXATEXC1        CHAR(4),       /*A.M. EXECUTOR AUDIT TRAIL  */ 11636602
*        3 DXATEXB1      BIT(32),       /*A.M. EXECUTOR AUDIT TRAIL  */ 11636702
*          4 DXEXHASP BIT(1),           /*HASP IN CONTROL    @ZA02504*/ 11636803
*          4 DXEXTCAM BIT(1),           /*TCAM IN CONTROL    @ZAAPISP*/ 11656837
*      2 DXATEXC2        CHAR(4),       /*A.M. EXECUTOR AUDIT TRAIL  */ 11686602
*        3 DXATEXB2      BIT(32),       /*A.M. EXECUTOR AUDIT TRAIL  */ 11696737
*                                                                       11697137
*      2 DSECTSIZ CHAR(0) BDY(WORD);    /*END OF IECDSECT            */ 11698737
