*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
S3CNVT   CSECT                                                          00000060
         USING *,R12                                                    00000070
A000000  EQU *                                                          00000080
         STM   R14,R12,12(R13)                                          00000090
         LR    R12,R15                                                  00000100
         LA    R11,A00058C                                              00000110
         ST    R11,8(,R13)                                              00000120
         ST    R13,4(,R11)                                              00000130
         LR    R13,R11                                                  00000140
         LA    R1,A000808                                               00000150
         LA    R0,A00051A+2                                             00000160
         SVC   24                                                       00000170
         LTR   R15,R15                                                  00000180
         BE    A00002C                                                  00000190
         MVC   A000610,A000810                                          00000200
         NOPR  0                                                        00000210
A00002C  BAL   R1,A000038                                               00000220
         DC    H'0'                                                     00000230
         BALR  R14,R8                                                   00000240
         SLDA  R0,1608                                                  00000250
A000038  SVC   19                                                       00000260
         TM    A000618,16                                               00000270
         BE    A0002A0                                                  00000280
         TM    A000678,16                                               00000290
         BE    A0002A0                                                  00000300
A00004A  LA    R1,A0005E8                                               00000310
         LA    R0,A000348                                               00000320
         L     R15,48(,R1)                                              00000330
         BALR  R14,R15                                                  00000340
         TM    A0000E2,8                                                00000350
         BO    A000258                                                  00000360
         TM    A0000E2,1                                                00000370
         BO    A000080                                                  00000380
         OI    A0000E2,1                                                00000390
         CLC   A000878,A000348                                          00000400
         BNE   A000080                                                  00000410
         OI    A0000E2,2                                                00000420
         MVC   A000609,A000880                                          00000430
A000080  TM    A0000E2,2                                                00000440
         BE    A0000E4                                                  00000450
         TM    A0000E2,4                                                00000460
         BE    A0000A8                                                  00000470
         CLC   A000570,A000348                                          00000480
         BE    A0000A8                                                  00000490
         CLC   A000574,A000348                                          00000500
         BNE   A00004A                                                  00000510
         OI    A0000E2,8                                                00000520
A0000A8  OI    A0000E2,4                                                00000530
         LA    R1,A000648                                               00000540
         LA    R0,A000348                                               00000550
         L     R15,48(,R1)                                              00000560
         BALR  R14,R15                                                  00000570
         TM    A0000E2,8                                                00000580
         BE    A00004A                                                  00000590
         LA    R1,A000648                                               00000600
         LA    R0,A000818                                               00000610
         L     R15,48(,R1)                                              00000620
         BALR  R14,R15                                                  00000630
         B     A00004A                                                  00000640
         TM    A0000E2,8                                                00000650
         BE    A000258                                                  00000660
         SR    R15,R15                                                  00000670
         B     A0002E4                                                  00000680
A0000E2  EQU *                                                          00000690
         DC    H'0'                                                     00000700
A0000E4  NOP   A000258                                                  00000710
         CLC   A000570,A000348                                          00000720
         BE    A000100                                                  00000730
         CLC   A000574,A000348                                          00000740
         BE    A0001BE                                                  00000750
         B     A00004A                                                  00000760
A000100  NOP   A000116                                                  00000770
         OI    A000100+1,240                                            00000780
         MVC   A0005E3,A000391                                          00000790
         LA    R2,A000398                                               00000800
         BAL   R11,A0001E0                                              00000810
A000116  NOP   A000124                                                  00000820
         OI    A000116+1,240                                            00000830
         MVC   A000458+2(2),A00034C+2                                   00000840
A000124  CLC   A000883,A00035C                                          00000850
         BNE   A000152                                                  00000860
         MVC   A0003F8,A000498                                          00000870
         NI    A000116+1,15                                             00000880
         MVC   A0003F8+2(2),A000458+2                                   00000890
         CLC   A00087C,A000358                                          00000900
         BE    A000178                                                  00000910
         MVC   A0003F8+2(2),A000358+2                                   00000920
         B     A000178                                                  00000930
A000152  MVC   A0003F8(5),A0005DE                                       00000940
         LH    R1,A000352                                               00000950
         BCTR  R1,0                                                     00000960
         STC   R1,A0003F8+1                                             00000970
         LH    R2,A00034C+2                                             00000980
         AR    R2,R1                                                    00000990
         STH   R2,A0003F8+2                                             00001000
         LA    R2,5(,R1)                                                00001010
         STC   R2,A0003F8+4                                             00001020
         EX    R1,A0005D6+2                                             00001030
A000178  TR    A0003F8,A0006C2                                          00001040
         LM    R3,R7,A000578                                            00001050
A000182  IC    R6,0(,R3)                                                00001060
         IC    R7,32(,R3)                                               00001070
         SRL   R6,6                                                     00001080
         SRL   R7,6                                                     00001090
         SLL   R7,30                                                    00001100
         SLDL  R6,2                                                     00001110
         IC    R6,A0006C2(R6)                                           00001120
         STC   R6,64(,R3)                                               00001130
         BXLE  R3,R4,A000182                                            00001140
         NC    A0003F8,A0004D8                                          00001150
         TR    A0003F8,A0007C2                                          00001160
         LA    R2,A0003F8                                               00001170
         BAL   R11,A0001E0                                              00001180
         B     A00004A                                                  00001190
A0001BE  NI    A000245,15                                               00001200
         OI    A0000E4+1,240                                            00001210
         CLC   A00087C,A00034C                                          00001220
         BE    A0001D6                                                  00001230
         MVC   A000458+2(2),A00034C+2                                   00001240
A0001D6  MVC   A0003F8,A000458                                          00001250
         B     A000178                                                  00001260
A0001E0  LH    R1,A0005D4+2                                             00001270
         LA    R1,1(,R1)                                                00001280
         STH   R1,A0005D4+2                                             00001290
         CVD   R1,A000568                                               00001300
         OI    A000568+7,15                                             00001310
         UNPK  61(3,R2),A000568                                         00001320
         MVC   A000518+2(48),0(R2)                                      00001330
         BAL   R10,A000210                                              00001340
         MVC   A000518+2(48),48(R2)                                     00001350
         BAL   R10,A000210                                              00001360
         BR    R11                                                      00001370
A000210  LH    R1,A0005D4                                               00001380
         LA    R1,1(,R1)                                                00001390
         STH   R1,A0005D4                                               00001400
         CVD   R1,A000568                                               00001410
         OI    A000568+7,15                                             00001420
         UNPK  A000560,A000568                                          00001430
         MVI   A000560,128                                              00001440
         MVC   A000560+1(3),A0005E3                                     00001450
         LA    R1,A000648                                               00001460
         LA    R0,A000518                                               00001470
         L     R15,48(,R1)                                              00001480
         BALR  R14,R15                                                  00001490
         BR    R10                                                      00001500
         DC    XL1'47'                                                  00001510
A000245  EQU *                                                          00001520
         DC    CL2'0B'                                                  00001530
         DC    XL1'58'                                                  00001540
         LA    R2,A000818                                               00001550
         BAL   R11,A0001E0                                              00001560
         SR    R15,R15                                                  00001570
         B     A0002E4                                                  00001580
         NOPR  0                                                        00001590
A000258  BAL   R1,A000294                                               00001600
         DC    XL4'00370000'                                            00001610
         DC    CL32'$HASP990 S3CNVT - UNEXPECTED OR '                   00001620
         DC    CL19'MISSING END-OF-DATA'                                00001630
         DC    XL1'00'                                                  00001640
A000294  SVC   35                                                       00001650
         LA    R15,12                                                   00001660
         B     A0002E4                                                  00001670
         NOPR  0                                                        00001680
A0002A0  BAL   R1,A0002DE                                               00001690
         DC    XL4'003A0000'                                            00001700
         DC    CL32'$HASP991 S3CNVT - UNABLE TO OPEN'                   00001710
         DC    CL22' ONE OR BOTH DATA SETS'                             00001720
A0002DE  SVC   35                                                       00001730
         LA    R15,16                                                   00001740
A0002E4  ST    R15,A00059C                                              00001750
         BAL   R1,A0002F4                                               00001760
         LPER  R0,R0                                                    00001770
         BALR  R14,R8                                                   00001780
         DC    XL2'B000'                                                00001790
         BCTR  R4,R8                                                    00001800
A0002F4  SVC   20                                                       00001810
         LA    R1,A0005E8                                               00001820
         BAL   R10,A000310                                              00001830
         LA    R1,A000648                                               00001840
         BAL   R10,A000310                                              00001850
         L     R13,A000590                                              00001860
         LM    R14,R12,12(R13)                                          00001870
         BR    R14                                                      00001880
A000310  TM    23(R1),1                                                 00001890
         BOR   R10                                                      00001900
         L     R15,20(,R1)                                              00001910
         OI    23(R1),1                                                 00001920
         SR    R14,R14                                                  00001930
         IC    R14,5(,R15)                                              00001940
         MH    R14,6(,R15)                                              00001950
         TM    32(R1),1                                                 00001960
         BO    A000338                                                  00001970
         LA    R0,8(,R14)                                               00001980
         B     A00033C                                                  00001990
A000338  LA    R0,16(,R14)                                              00002000
A00033C  LA    R1,0(,R15)                                               00002010
         SVC   10                                                       00002020
         BR    R10                                                      00002030
         DROP  R12                                                      00002040
         DC    F'0'                                                     00002050
A000348  DC    XL4'022011E8'                                            00002060
A00034C  EQU *,4                                                        00002070
         DC    CL2'DS'                                                  00002080
A00034E  DC    CL4'IZE '                                                00002090
A000352  EQU *,4                                                        00002100
         DC    XL2'4040'                                                00002110
         DC    XL4'00040001'                                            00002120
A000358  DC    F'0'                                                     00002130
A00035C  EQU *,25                                                       00002140
         DC    CL1' '                                                   00002150
         DC    XL1'00'                                                  00002160
         DC    XL1'14'                                                  00002170
         DC    CL9'DOSIZE   '                                           00002180
         DC    XL4'00040001'                                            00002190
         DC    F'0'                                                     00002200
         DC    CL1' '                                                   00002210
         DC    XL1'00'                                                  00002220
         DC    XL1'14'                                                  00002230
         DC    CL9'HSTMTS   '                                           00002240
         DC    XL4'00040001'                                            00002250
         DC    F'0'                                                     00002260
         DC    CL1' '                                                   00002270
         DC    XL1'00'                                                  00002280
         DC    H'5324'                                                  00002290
         DC    CL8'LINKCHAR'                                            00002300
         DC    XL1'00'                                                  00002310
A000391  EQU *,3                                                        00002320
         DC    XL1'10'                                                  00002330
         DC    H'0001'                                                  00002340
         DC    F'0'                                                     00002350
A000398  DC    CL4'BA  '                                                00002360
         DC    CL32'15 C31E17 *D PD*       D    ****'                   00002370
         DC    CL32'*****  FIRST CARD  ********* @4@'                   00002380
         DC    CL28'@ 4@  8  44@4@@44444844@    '                       00002390
A0003F8  EQU *,64                                                       00002400
         DC    CL32'                                '                   00002410
         DC    CL32'                                '                   00002420
         DC    CL32'                                '                   00002430
A000458  EQU *,64                                                       00002440
         DC    XL2'C000'                                                00002450
A00045A  DC    H'0'                                                     00002460
         DC    CL32'                            ****'                   00002470
         DC    CL28'*****  LAST  CARD  *********'                       00002480
A000498  EQU *,64                                                       00002490
         DC    XL4'C0000000'                                            00002500
         DC    CL32'                            ****'                   00002510
         DC    CL28'*****  PSEUDO-END  *********'                       00002520
A0004D8  EQU *,64                                                       00002530
         DC    XL4'3F3F3F3F'                                            00002540
         DC    XL4'3F3F3F3F'                                            00002550
         DC    XL4'3F3F3F3F'                                            00002560
         DC    XL4'3F3F3F3F'                                            00002570
         DC    XL4'3F3F3F3F'                                            00002580
         DC    XL4'3F3F3F3F'                                            00002590
         DC    XL4'3F3F3F3F'                                            00002600
         DC    XL4'3F3F3F3F'                                            00002610
         DC    XL4'3F3F3F3F'                                            00002620
         DC    XL4'3F3F3F3F'                                            00002630
         DC    XL4'3F3F3F3F'                                            00002640
         DC    XL4'3F3F3F3F'                                            00002650
         DC    XL4'3F3F3F3F'                                            00002660
         DC    XL4'3F3F3F3F'                                            00002670
         DC    XL4'3F3F3F3F'                                            00002680
         DC    XL4'3F3F3F3F'                                            00002690
A000518  EQU *,4                                                        00002700
         DC    CL2'  '                                                  00002710
A00051A  EQU *,48                                                       00002720
         DC    CL2'  '                                                  00002730
A00051C  DC    CL4'    '                                                00002740
         DC    CL32'                                '                   00002750
         DC    CL32'                                '                   00002760
A000560  DC    CL8'        '                                            00002770
A000568  EQU *,8                                                        00002780
         DC    F'0'                                                     00002790
         DC    F'06286'                                                 00002800
A000570  DC    XL4'02E3E7E3'                                            00002810
A000574  DC    XL4'02C5D5C4'                                            00002820
A000578  DC    F'01016'                                                 00002830
         DC    F'00001'                                                 00002840
         DC    F'01047'                                                 00002850
         DC    F'0'                                                     00002860
         DC    F'0'                                                     00002870
A00058C  DC    XL4'0006000F'                                            00002880
A000590  DC    F'0'                                                     00002890
         DC    XL3'010018'                                              00002900
         DC    CL5'mASWI'                                               00002910
A00059C  DC    CL4'TCH '                                                00002920
         DC    F'00001'                                                 00002930
         DC    F'0'                                                     00002940
         DC    XL4'02041600'                                            00002950
         DC    F'0'                                                     00002960
         DC    CL1'0'                                                   00002970
         DC    XL1'74'                                                  00002980
         DC    XL2'4710'                                                00002990
         DC    CL1'l'                                                   00003000
         DC    XL1'78'                                                  00003010
         DC    XL1'58'                                                  00003020
         DC    CL1'0'                                                   00003030
         DC    XL2'C044'                                                00003040
         DC    CL1'j'                                                   00003050
         DC    XL1'20'                                                  00003060
         DC    CL1'0'                                                   00003070
         DC    XL1'11'                                                  00003080
         DC    XL2'4780'                                                00003090
         DC    CL1'm'                                                   00003100
         DC    XL1'16'                                                  00003110
         DC    CL1'j'                                                   00003120
         DC    XL1'20'                                                  00003130
         DC    XL4'70434710'                                            00003140
         DC    CL2'ls'                                                  00003150
         DC    XL2'5830'                                                00003160
         DC    XL1'70'                                                  00003170
         DC    CL1'&&'                                                  00003180
         DC    H'4659'                                                  00003190
         DC    XL2'4780'                                                00003200
         DC    CL1'm'                                                   00003210
         DC    XL1'16'                                                  00003220
A0005D4  EQU *,4                                                        00003230
         DC    H'0'                                                     00003240
A0005D6  EQU *,4                                                        00003250
         DC    H'0'                                                     00003260
X0005D8  EQU *,6                                                        00003270
         DC    CL1'K'                                                   00003280
         DC    XL1'00'                                                  00003290
         DC    CL1'C'                                                   00003300
         DC    XL1'FD'                                                  00003310
         DC    CL1'C'                                                   00003320
         DC    XL1'58'                                                  00003330
A0005DE  EQU *,5                                                        00003340
         DC    H'7168'                                                  00003350
         DC    XL3'000005'                                              00003360
A0005E3  EQU *,3                                                        00003370
         DC    XL1'02'                                                  00003380
         DC    CL1' '                                                   00003390
         DC    XL1'04'                                                  00003400
         DC    H'0'                                                     00003410
A0005E8  DC    F'0'                                                     00003420
         DC    F'0'                                                     00003430
         DC    F'0'                                                     00003440
         DC    F'0'                                                     00003450
         DC    F'0'                                                     00003460
         DC    F'00001'                                                 00003470
         DC    H'0'                                                     00003480
         DC    CL1' '                                                   00003490
         DC    XL1'00'                                                  00003500
         DC    F'00001'                                                 00003510
         DC    XL1'00'                                                  00003520
A000609  EQU *,3                                                        00003530
         DC    XL1'00'                                                  00003540
         DC    H'0580'                                                  00003550
         DC    XL3'900006'                                              00003560
         DC    CL1'y'                                                   00003570
A000610  DC    CL8'SYSLIN  '                                            00003580
A000618  EQU *                                                          00003590
         DC    H'0512'                                                  00003600
         DC    CL1'&&'                                                  00003610
         DC    XL1'00'                                                  00003620
         DC    F'00001'                                                 00003630
         DC    F'00001'                                                 00003640
         DC    F'0'                                                     00003650
         DC    F'0'                                                     00003660
         DC    F'00001'                                                 00003670
         DC    F'00001'                                                 00003680
         DC    F'00001'                                                 00003690
         DC    XL3'000000'                                              00003700
         DC    CL1'&&'                                                  00003710
         DC    F'00001'                                                 00003720
         DC    F'0'                                                     00003730
         DC    F'00001'                                                 00003740
A000648  DC    F'0'                                                     00003750
         DC    F'0'                                                     00003760
         DC    F'0'                                                     00003770
         DC    F'0'                                                     00003780
         DC    F'0'                                                     00003790
         DC    F'00001'                                                 00003800
         DC    H'0'                                                     00003810
         DC    CL1' '                                                   00003820
         DC    XL1'00'                                                  00003830
         DC    F'00001'                                                 00003840
         DC    F'00001'                                                 00003850
         DC    XL4'900006AC'                                            00003860
         DC    CL8'SYSPUNCH'                                            00003870
A000678  EQU *                                                          00003880
         DC    XL3'020000'                                              00003890
         DC    CL1'&&'                                                  00003900
         DC    F'00001'                                                 00003910
         DC    F'00001'                                                 00003920
         DC    F'0'                                                     00003930
         DC    F'0'                                                     00003940
         DC    F'00001'                                                 00003950
         DC    F'00001'                                                 00003960
         DC    F'00001'                                                 00003970
         DC    XL3'000000'                                              00003980
         DC    CL1'&&'                                                  00003990
         DC    F'00001'                                                 00004000
         DC    F'0'                                                     00004010
         DC    F'00001'                                                 00004020
         DC    CL1'e'                                                   00004030
         DC    XL1'00'                                                  00004040
         DC    H'1712'                                                  00004050
         DC    CL1'e'                                                   00004060
         DC    XL1'00'                                                  00004070
         DC    H'1712'                                                  00004080
         DC    XL4'4820103E'                                            00004090
         DC    XL3'122207'                                              00004100
         DC    CL1'='                                                   00004110
         DC    XL3'412000'                                              00004120
         DC    CL2'&& '                                                 00004130
         DC    XL1'20'                                                  00004140
         DC    H'4158'                                                  00004150
         DC    H'2046'                                                  00004160
A0006C2  EQU *,64                                                       00004170
         DC    CL17' 123456789:#@''="!'                                 00004180
         DC    XL1'E1'                                                  00004190
         DC    CL8'STUVWXYZ'                                            00004200
         DC    XL1'6A'                                                  00004210
         DC    CL6',%_>?-'                                              00004220
         DC    XL1'51'                                                  00004230
         DC    CL14'KLMNOPQR0$*);¬'                                     00004240
         DC    XL1'D0'                                                  00004250
         DC    CL9'ABCDEFGHI'                                           00004260
         DC    XL1'4A'                                                  00004270
         DC    CL4'.<(+'                                                00004280
         DC    XL1'4F'                                                  00004290
         DC    H'0177'                                                  00004300
         DC    XL4'B2B3B4B5'                                            00004310
         DC    XL4'B6B7B8B9'                                            00004320
         DC    XL4'3A3B3C3D'                                            00004330
         DC    XL4'3E3F1AA1'                                            00004340
         DC    CL8'stuvwxyz'                                            00004350
         DC    XL4'2A2B2C2D'                                            00004360
         DC    XL4'2E2F2011'                                            00004370
         DC    CL8'klmnopqr'                                            00004380
         DC    XL4'B01B1C1D'                                            00004390
         DC    XL3'1E1F90'                                              00004400
         DC    CL9'abcdefghi'                                           00004410
         DC    XL4'0A0B0C0D'                                            00004420
         DC    XL4'0E0FC071'                                            00004430
         DC    XL4'72737475'                                            00004440
         DC    XL4'76777879'                                            00004450
         DC    XL4'FAFBFCFD'                                            00004460
         DC    XL3'FEFF70'                                              00004470
         DC    CL1'/'                                                   00004480
         DC    XL4'62636465'                                            00004490
         DC    XL4'66676869'                                            00004500
         DC    XL4'EAEBECED'                                            00004510
         DC    XL3'EEEFE0'                                              00004520
         DC    CL1'J'                                                   00004530
         DC    XL4'52535455'                                            00004540
         DC    XL4'56575859'                                            00004550
         DC    XL4'DADBDCDD'                                            00004560
         DC    XL2'DEDF'                                                00004570
         DC    CL1'&&'                                                  00004580
         DC    XL1'41'                                                  00004590
         DC    XL4'42434445'                                            00004600
         DC    XL4'46474849'                                            00004610
         DC    XL4'CACBCCCD'                                            00004620
         DC    XL4'CECF8031'                                            00004630
         DC    XL4'32333435'                                            00004640
         DC    XL4'36373839'                                            00004650
         DC    XL4'BABBBCBD'                                            00004660
         DC    XL4'BEBF3021'                                            00004670
         DC    XL4'22232425'                                            00004680
         DC    XL4'26272829'                                            00004690
         DC    XL4'AAABACAD'                                            00004700
         DC    XL3'AEAFA0'                                              00004710
         DC    CL1'j'                                                   00004720
         DC    XL4'12131415'                                            00004730
         DC    XL4'16171819'                                            00004740
         DC    XL4'9A9B9C9D'                                            00004750
         DC    XL4'9E9F1001'                                            00004760
         DC    XL4'02030405'                                            00004770
         DC    XL4'06070809'                                            00004780
         DC    XL4'8A8B8C8D'                                            00004790
         DC    XL2'8E8F'                                                00004800
A0007C2  EQU *,64                                                       00004810
         DC    CL32' 123456789:#@''="0/STUVWXYZ&&,%_>?'                 00004820
         DC    CL16'-JKLMNOPQR!$*);¬'                                   00004830
         DC    XL1'D0'                                                  00004840
         DC    CL9'ABCDEFGHI'                                           00004850
         DC    XL1'4A'                                                  00004860
         DC    CL4'.<(+'                                                00004870
         DC    XL1'4F'                                                  00004880
         DC    XL2'FBFD'                                                00004890
         DC    XL3'000000'                                              00004900
         DC    CL1'0'                                                   00004910
A000808  DC    CL4'SYSL'                                                00004920
         DC    CL4'IN  '                                                00004930
A000810  DC    CL8'SYSGO   '                                            00004940
A000818  DC    CL4' EOR'                                                00004950
         DC    CL32'                                '                   00004960
         DC    CL32'                                '                   00004970
         DC    CL28'                            '                       00004980
A000878  DC    XL4'C2010050'                                            00004990
A00087C  DC    CL4'    '                                                00005000
A000880  DC    XL3'0000D4'                                              00005010
A000883  DC    CL25'$$$$ PSEUDO-END CARD $$$$'                          00005020
R0       EQU   0                                                        00005030
R1       EQU   1                                                        00005040
R2       EQU   2                                                        00005050
R3       EQU   3                                                        00005060
R4       EQU   4                                                        00005070
R5       EQU   5                                                        00005080
R6       EQU   6                                                        00005090
R7       EQU   7                                                        00005100
R8       EQU   8                                                        00005110
R9       EQU   9                                                        00005120
R10      EQU   10                                                       00005130
R11      EQU   11                                                       00005140
R12      EQU   12                                                       00005150
R13      EQU   13                                                       00005160
R14      EQU   14                                                       00005170
R15      EQU   15                                                       00005180
         END                                                            00005190
