//SMPDSL   JOB (ACCT),'MVS38SRC',CLASS=A,MSGCLASS=H
//LIST    EXEC PGM=HMASMP,PARM='DATE=U',REGION=5120K,TIME=1440
//SYSPRINT DD  SYSOUT=*
//SMPOUT   DD  SYSOUT=*
//SMPLIST  DD  DSN=<HLQ>.SMPLIST.DATA,DISP=(,CATLG,CATLG),
//             UNIT=SYSDA,SPACE=(CYL,(80,40),RLSE),
//             DCB=(RECFM=FBA,LRECL=121,BLKSIZE=6050)
//SMPRPT   DD  SYSOUT=*
//SMPLOG   DD  DUMMY
//SYSUDUMP DD  SYSOUT=*
//SMPCDS   DD  DISP=SHR,DSN=SYS1.SMPCDS
//SMPACDS  DD  DISP=SHR,DSN=SYS1.SMPACDS
//SMPSCDS  DD  DISP=SHR,DSN=SYS1.SMPSCDS
//SMPCRQ   DD  DISP=SHR,DSN=SYS1.SMPCRQ
//SMPACRQ  DD  DISP=SHR,DSN=SYS1.SMPACRQ
//SMPPTS   DD  DISP=SHR,DSN=SYS1.SMPPTS
//SMPMTS   DD  DISP=SHR,DSN=SYS1.SMPMTS
//SMPSTS   DD  DISP=SHR,DSN=SYS1.SMPSTS
//SYSLIB   DD  DISP=SHR,DSN=SYS1.SMPMTS
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1700,(600,100))
//SYSUT2   DD  UNIT=SYSDA,SPACE=(1700,(600,100))
//SYSUT3   DD  UNIT=SYSDA,SPACE=(1700,(600,100))
//SMPWRK1  DD  UNIT=SYSDA,SPACE=(CYL,(5,10,84)),DCB=(BLKSIZE=3120,
//             LRECL=80)
//SMPWRK2  DD  UNIT=SYSDA,SPACE=(CYL,(5,10,84)),DCB=(BLKSIZE=3120,
//             LRECL=80)
//SMPWRK3  DD  UNIT=SYSDA,SPACE=(CYL,(5,10,84)),DCB=(BLKSIZE=3120,
//             LRECL=80)
//SMPWRK4  DD  UNIT=SYSDA,SPACE=(CYL,(1,10,84)),DCB=(BLKSIZE=3120,
//             LRECL=80)
//SMPWRK5  DD  UNIT=SYSDA,SPACE=(CYL,(30,10,250))
//SMPCNTL  DD  *
 LIST ACDS SYSMOD .
 LIST CDS SYSMOD .
 LIST ACDS MOD .
 LIST CDS MOD .
/*
