*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IKT0009C CSECT                                                          00000060
         B     22(,R15)                                                 00000070
         DC    XL1'10'                                                  00000080
         DC    CL16'IKT0009C  81.006'                                   00000090
         DC    XL1'00'                                                  00000100
         BALR  R12,0                                                    00000110
         USING *,R12                                                    00000120
A000018  EQU *                                                          00000130
         LR    R2,R1                                                    00000140
         ST    R14,108(,R5)                                             00000150
         L     R7,16                                                    00000160
         L     R7,556(,R7)                                              00000170
         LH    R3,96(,R5)                                               00000180
         C     R3,516(,R7)                                              00000190
         BH    A00003C                                                  00000200
         LH    R7,98(,R5)                                               00000210
         LTR   R7,R7                                                    00000220
         BNL   A00005A                                                  00000230
A00003C  L     R7,540                                                   00000240
         NI    148(R7),239                                              00000250
         TM    104(R5),32                                               00000260
         BNO   A000050                                                  00000270
         NI    29(R7),254                                               00000280
A000050  LA    R15,16                                                   00000290
         L     R14,132(,R5)                                             00000300
A000058  BR    R14                                                      00000310
A00005A  SLR   R7,R7                                                    00000320
         L     R3,16                                                    00000330
         C     R7,1012(,R3)                                             00000340
         BE    A000236                                                  00000350
         L     R8,548                                                   00000360
         L     R9,60(,R8)                                               00000370
         TM    100(R5),128                                              00000380
         BNO   A000086                                                  00000390
         CR    R9,R7                                                    00000400
         BE    A000236                                                  00000410
         TM    25(R9),1                                                 00000420
         BE    A000236                                                  00000430
A000086  L     R7,V00024C                                               00000440
         ST    R7,124(,R5)                                              00000450
         TM    100(R5),128                                              00000460
         BO    A0001C6                                                  00000470
         L     R7,V000250                                               00000480
         ST    R7,124(,R5)                                              00000490
         TM    100(R5),64                                               00000500
         BNO   A0000C6                                                  00000510
         L     R7,56(,R8)                                               00000520
         LTR   R7,R7                                                    00000530
         BE    A0000FC                                                  00000540
         L     R7,56(,R8)                                               00000550
         L     R3,128(,R5)                                              00000560
         CLC   8(8,R7),0(R3)                                            00000570
         BE    A0001C6                                                  00000580
         B     A0000FC                                                  00000590
A0000C6  LH    R7,96(,R5)                                               00000600
         LTR   R7,R7                                                    00000610
         BNP   A0000DE                                                  00000620
         LH    R3,36(,R8)                                               00000630
         N     R3,A000240                                               00000640
         CR    R7,R3                                                    00000650
         BNE   A0000E4                                                  00000660
A0000DE  LTR   R9,R9                                                    00000670
         BE    A000236                                                  00000680
A0000E4  LH    R7,96(,R5)                                               00000690
         LTR   R7,R7                                                    00000700
         BNP   A0001C6                                                  00000710
         LH    R3,36(,R8)                                               00000720
         N     R3,A000240                                               00000730
         CR    R7,R3                                                    00000740
         BE    A0001C6                                                  00000750
A0000FC  TM    100(R5),3                                                00000760
         BNO   A00010C                                                  00000770
         NI    100(R5),253                                              00000780
         OI    100(R5),1                                                00000790
A00010C  L     R7,V000254                                               00000800
         ST    R7,124(,R5)                                              00000810
         SLR   R9,R9                                                    00000820
         LR    R15,R11                                                  00000830
         LR    R0,R12                                                   00000840
         LR    R1,R13                                                   00000850
         L     R13,764                                                  00000860
         LM    R11,R13,540(R13)                                         00000870
         BALR  R14,R13                                                  00000880
         LR    R11,R15                                                  00000890
         LR    R15,R13                                                  00000900
         LR    R12,R0                                                   00000910
         LR    R13,R1                                                   00000920
         L     R7,16                                                    00000930
         L     R3,1012(,R7)                                             00000940
         LTR   R3,R3                                                    00000950
         BE    A0001A8                                                  00000960
         L     R7,1012(,R7)                                             00000970
         L     R9,68(,R7)                                               00000980
         B     A0001A2                                                  00000990
A000148  L     R8,0(,R9)                                                00001000
         LA    R8,0(,R8)                                                00001010
         TM    100(R5),64                                               00001020
         BNO   A000188                                                  00001030
         L     R7,56(,R8)                                               00001040
         LTR   R7,R7                                                    00001050
         BE    A000184                                                  00001060
         L     R7,56(,R8)                                               00001070
         L     R3,128(,R5)                                              00001080
         CLC   8(8,R7),0(R3)                                            00001090
         BNE   A000184                                                  00001100
         LH    R7,36(,R8)                                               00001110
         N     R7,A000240                                               00001120
         STH   R7,96(,R5)                                               00001130
         B     A0001A8                                                  00001140
A000184  B     A000198                                                  00001150
A000188  LH    R7,36(,R8)                                               00001160
         N     R7,A000240                                               00001170
         CH    R7,96(,R5)                                               00001180
         BE    A0001A8                                                  00001190
A000198  L     R7,96(,R9)                                               00001200
         L     R7,0(,R7)                                                00001210
         LR    R9,R7                                                    00001220
A0001A2  LTR   R9,R9                                                    00001230
         BNE   A000148                                                  00001240
A0001A8  LR    R15,R11                                                  00001250
         LR    R0,R12                                                   00001260
         LR    R1,R13                                                   00001270
         L     R13,764                                                  00001280
         LM    R11,R13,552(R13)                                         00001290
         BALR  R14,R13                                                  00001300
         LR    R11,R15                                                  00001310
         LR    R15,R13                                                  00001320
         LR    R12,R0                                                   00001330
         LR    R13,R1                                                   00001340
         LTR   R9,R9                                                    00001350
         BE    A000236                                                  00001360
A0001C6  L     R8,548                                                   00001370
         MVC   108(16,R5),A00028C                                       00001380
         L     R7,108(,R8)                                              00001390
         L     R7,112(,R7)                                              00001400
         L     R13,44(,R7)                                              00001410
         LA    R1,108(,R5)                                              00001420
         TM    104(R5),32                                               00001430
         BNO   A00020C                                                  00001440
         OI    0(R1),20                                                 00001450
         ST    R5,4(R1)                                                 00001460
         OI    12(R1),4                                                 00001470
         XC    13(3,R1),13(R1)                                          00001480
         SR    R0,R0                                                    00001490
         LR    R13,R13                                                  00001500
         L     R15,16                                                   00001510
         L     R15,576(R15)                                             00001520
         BALR  R14,R15                                                  00001530
         B     A000230                                                  00001540
A00020C  NI    0(R1),251                                                00001550
         OI    0(R1),16                                                 00001560
         ST    R5,4(R1)                                                 00001570
         OI    12(R1),4                                                 00001580
         XC    13(3,R1),13(R1)                                          00001590
         SR    R0,R0                                                    00001600
         LR    R13,R13                                                  00001610
         L     R15,16                                                   00001620
         L     R15,576(R15)                                             00001630
         BALR  R14,R15                                                  00001640
A000230  L     R15,124(,R5)                                             00001650
         BR    R15                                                      00001660
A000236  LR    R1,R2                                                    00001670
         L     R14,108(,R5)                                             00001680
         B     A000058                                                  00001690
A000240  DC    F'65535'                                                 00001700
         DC    XL3'070042'                                              00001710
         DC    CL1'0'                                                   00001720
         DC    F'0'                                                     00001730
V00024C  DC    V(IKTVTGET)                                              00001740
V000250  DC    V(IKTVTPUT)                                              00001750
V000254  DC    V(IKTASTPT)                                              00001760
         DC    F'0'                                                     00001770
         DC    F'0'                                                     00001780
         DC    F'0'                                                     00001790
         DC    F'0'                                                     00001800
         DC    F'0'                                                     00001810
         DC    F'0'                                                     00001820
         DC    F'0'                                                     00001830
         DC    F'0'                                                     00001840
         DC    F'0'                                                     00001850
         DC    F'0'                                                     00001860
         DC    F'0'                                                     00001870
         DC    F'0'                                                     00001880
         DC    F'0'                                                     00001890
A00028C  EQU *,16                                                       00001900
         DC    XL1'16'                                                  00001910
         DC    VL3(IKT93EST)                                            00001920
         DC    F'0'                                                     00001930
         DC    F'0'                                                     00001940
         DC    CL1' '                                                   00001950
         DC    XL1'00'                                                  00001960
         DC    H'0'                                                     00001970
R0       EQU   0                                                        00001980
R1       EQU   1                                                        00001990
R2       EQU   2                                                        00002000
R3       EQU   3                                                        00002010
R4       EQU   4                                                        00002020
R5       EQU   5                                                        00002030
R6       EQU   6                                                        00002040
R7       EQU   7                                                        00002050
R8       EQU   8                                                        00002060
R9       EQU   9                                                        00002070
R10      EQU   10                                                       00002080
R11      EQU   11                                                       00002090
R12      EQU   12                                                       00002100
R13      EQU   13                                                       00002110
R14      EQU   14                                                       00002120
R15      EQU   15                                                       00002130
         END                                                            00002140
