         TITLE 'IKJEGMSG MODULE - MESSAGES FOR TSO TEST - VS2-REL2'     00001000
IKJEGMSG CSECT                         ESTABLISH CSECT NAME             00003000
ATTACHIO DC    0A(0)                                            DSKC125 00009000
         ENTRY ATTACHIO                                         DSKC125 00010000
MSG99PTR DC    AL4(MSG99)                                               00011000
MSG199PT DC    AL4(MSG199)                                              00012000
SECONDPT DC    AL4(SECOND)                                              00013000
INSERTPT DC    AL4(INSERT)                                              00014000
SVCTBP   DC    AL4(SVCTB)                                               00015000
SVCTBRCP DC    AL4(SVCTBRC)                                             00016000
MSG99    DC    0A(0)                                            DSKC125 00018000
         DC    F'73'                                                    00020000
         DC    AL4(M001)                                                00021000
         DC    AL4(M002)                                                00022000
         DC    AL4(M003)                                                00023000
         DC    AL4(M004)                                                00024000
         DC    AL4(M005)                                                00025000
         DC    AL4(M006)                                                00026000
         DC    AL4(M007)                                                00027000
         DC    AL4(M008)                                                00028000
         DC    AL4(M009)                                                00029000
         DC    AL4(M0010)                                               00030000
         DC    AL4(M0011)                                               00031000
         DC    AL4(M0012)                                               00032000
         DC    AL4(M0013)                                               00033000
         DC    AL4(M0014)                                               00034000
         DC    AL4(M0015)                                               00035000
         DC    AL4(M0016)                                               00036000
         DC    AL4(M0017)                                               00037000
         DC    AL4(M0018)                                               00038000
         DC    AL4(M0019)                                               00039000
         DC    AL4(M0020)                                               00040000
         DC    AL4(M0021)                                               00041000
         DC    AL4(M0022)                                               00042000
         DC    AL4(M0023)                                               00043000
         DC    AL4(M0024)                                               00044000
         DC    AL4(M0025)                                               00045000
         DC    AL4(M0026)                                               00046000
         DC    AL4(M0027)                                               00047000
         DC    AL4(M0028)                                               00048000
         DC    AL4(M0029)                                               00049000
         DC    AL4(M0030)                                               00050000
         DC    AL4(M0031)                                               00051000
         DC    AL4(M0032)                                               00052000
         DC    AL4(M0033)                                               00053000
         DC    AL4(M0034)                                               00054000
         DC    AL4(M0035)                                               00055000
         DC    AL4(M0036)                                               00056000
         DC    AL4(M0037)                                               00057000
         DC    AL4(M0038)                                               00058000
         DC    AL4(M0039)                                               00059000
         DC    AL4(M0040)                                               00060000
         DC    AL4(M0041)                                               00061000
         DC    AL4(M0042)                                               00062000
         DC    AL4(M0043)                                               00063000
         DC    AL4(M0044)                                               00064000
         DC    AL4(M0045)                                               00065000
         DC    AL4(M0046)                                               00066000
         DC    AL4(M0047)                                               00067000
         DC    AL4(M0048)                                               00068000
         DC    AL4(M0049)                                               00069000
         DC    AL4(M0050)                                               00070000
         DC    AL4(M0051)                                               00071000
         DC    AL4(M0052)                                               00072000
         DC    AL4(M0053)                                               00073000
         DC    AL4(M0054)                                               00074000
         DC    AL4(M0055)                                               00075000
         DC    AL4(M0056)                                               00076000
         DC    AL4(M0057)                                               00077000
         DC    AL4(M0058)                                               00078000
         DC    AL4(M0059)                                               00079000
         DC    AL4(M0060)                                               00080000
         DC    AL4(M0061)                                               00081000
         DC    AL4(M0062)                                               00082000
         DC    AL4(M0063)                                               00083000
         DC    AL4(M0064)                                               00084000
         DC    AL4(M0065)                                               00085000
         DC    AL4(M0066)                                               00086000
         DC    AL4(M0067)                                               00087000
         DC    AL4(M0068)                                               00088000
         DC    AL4(M0069)                                               00089000
         DC    AL4(M0070)                                               00090000
         DC    AL4(M0071)                                               00091000
         DC    AL4(M0072)                                               00092000
         DC    AL4(M0073)                                               00093000
MSG199   DC    0A(0)                                            DSKC125 00096000
         DC    F'108'                                           DSKC125 00098000
         DC    AL4(M0100)                                               00099000
         DC    AL4(M0101)                                               00100000
         DC    AL4(M0102)                                               00101000
         DC    AL4(M0103)                                               00102000
         DC    AL4(M0104)                                               00103000
         DC    AL4(M0105)                                               00104000
         DC    AL4(M0106)                                               00105000
         DC    AL4(M0107)                                               00106000
         DC    AL4(M0108)                                       DSKC125 00106010
SECOND   DC    0A(0)                                            DSKC125 00109000
         DC    F'299'                                                   00111000
         DC    AL4(M0200)                                               00112000
         DC    AL4(M0201)                                               00113000
         DC    AL4(M0202)                                               00114000
         DC    AL4(M0203)                                               00115000
         DC    AL4(M0204)                                               00116000
         DC    AL4(M0205)                                               00117000
         DC    AL4(M0206)                                               00118000
         DC    AL4(M0207)                                               00119000
         DC    AL4(M0208)                                               00120000
         DC    AL4(M0209)                                               00121000
         DC    AL4(M0210)                                               00122000
         DC    AL4(M0211)                                               00123000
         DC    AL4(M0212)                                               00124000
         DC    AL4(M0213)                                               00125000
         DC    AL4(M0214)                                               00126000
         DC    AL4(M0215)                                               00127000
         DC    AL4(M0216)                                               00128000
         DC    AL4(M0217)                                               00129000
         DC    AL4(M0218)                                               00130000
         DC    AL4(M0219)                                               00131000
         DC    AL4(M0220)                                               00132000
         DC    AL4(M0221)                                               00133000
         DC    AL4(M0222)                                               00134000
         DC    AL4(M0223)                                               00135000
         DC    AL4(M0224)                                               00136000
         DC    AL4(M0225)                                               00137000
         DC    AL4(M0226)                                               00138000
         DC    AL4(M0227)                                               00139000
         DC    AL4(M0228)                                               00140000
         DC    AL4(M0229)                                               00141000
         DC    AL4(M0230)                                               00142000
         DC    AL4(M0231)                                               00143000
         DC    AL4(M0232)                                               00144000
         DC    AL4(M0233)                                               00145000
         DC    AL4(M0234)                                               00146000
         DC    AL4(M0235)                                               00147000
         DC    AL4(M0236)                                       DSKC125 00148000
         DC    AL4(M0237)                                               00149000
         DC    AL4(M0238)                                               00150000
         DC    AL4(M0239)                                               00151000
         DC    AL4(M0240)                                               00152000
         DC    AL4(M0241)                                               00153000
         DC    AL4(M0242)                                               00154000
         DC    AL4(M0243)                                               00155000
         DC    AL4(M0244)                                               00156000
         DC    AL4(M0245)                                               00157000
         DC    AL4(M0246)                                               00158000
         DC    AL4(M0247)                                               00159000
         DC    AL4(M0248)                                               00160000
         DC    AL4(M0249)                                               00161000
         DC    AL4(M0250)                                               00162000
         DC    AL4(M0251)                                               00163000
         DC    AL4(M0252)                                               00164000
         DC    AL4(M0253)                                               00165000
         DC    AL4(M0254)                                               00166000
         DC    AL4(M0255)                                               00167000
         DC    AL4(M0256)                                               00168000
         DC    AL4(M0257)                                               00169000
         DC    AL4(M0258)                                               00170000
         DC    AL4(M0259)                                               00171000
         DC    AL4(M0260)                                               00172000
         DC    AL4(M0261)                                               00173000
         DC    AL4(M0262)                                               00174000
         DC    AL4(M0263)                                               00175000
         DC    AL4(M0264)                                               00176000
         DC    AL4(M0265)                                               00177000
         DC    AL4(M0266)                                               00178000
         DC    AL4(M0267)                                               00179000
         DC    AL4(M0268)                                               00180000
         DC    AL4(M0269)                                               00181000
         DC    AL4(M0270)                                               00182000
         DC    AL4(M0271)                                               00183000
         DC    AL4(M0272)                                               00184000
         DC    AL4(M0273)                                               00185000
         DC    AL4(M0274)                                               00186000
         DC    AL4(M0275)                                               00187000
         DC    AL4(M0276)                                               00188000
         DC    AL4(M0277)                                               00189000
         DC    AL4(M0278)                                               00190000
         DC    AL4(M0279)                                               00191000
         DC    AL4(M0280)                                               00192000
         DC    AL4(M0281)                                               00193000
         DC    AL4(M0282)                                               00194000
         DC    AL4(M0283)                                               00195000
         DC    AL4(M0284)                                               00196000
         DC    AL4(M0285)                                               00197000
         DC    AL4(M0286)                                               00198000
         DC    AL4(M0287)                                               00199000
         DC    AL4(M0288)                                               00200000
         DC    AL4(M0289)                                               00201000
         DC    AL4(M0290)                                               00202000
         DC    AL4(M0291)                                               00203000
         DC    AL4(M0292)                                               00204000
         DC    AL4(M0293)                                               00205000
         DC    AL4(M0294)                                               00206000
         DC    AL4(M0295)                                               00207000
         DC    AL4(M0296)                                               00208000
         DC    AL4(M0297)                                               00209000
         DC    AL4(M0298)                                               00210000
         DC    AL4(M0299)                                               00211000
INSERT   DC    0A(0)                                            DSKC125 00214000
         DC    F'134'                                                   00216000
         DC    AL4(I001)                                                00217000
         DC    AL4(I002)                                                00218000
         DC    AL4(I003)                                                00219000
         DC    AL4(I004)                                                00220000
         DC    AL4(I005)                                                00221000
         DC    AL4(I006)                                                00222000
         DC    AL4(I007)                                                00223000
         DC    AL4(I008)                                                00224000
         DC    AL4(I009)                                                00225000
         DC    AL4(I0010)                                               00226000
         DC    AL4(I0011)                                               00227000
         DC    AL4(I0012)                                               00228000
         DC    AL4(I0013)                                               00229000
         DC    AL4(I0014)                                               00230000
         DC    AL4(I0015)                                               00231000
         DC    AL4(I0016)                                               00232000
         DC    AL4(I0017)                                               00233000
         DC    AL4(I0018)                                               00234000
         DC    AL4(I0019)                                               00235000
         DC    AL4(I0020)                                               00236000
         DC    AL4(I0021)                                               00237000
         DC    AL4(I0022)                                               00238000
         DC    AL4(I0023)                                               00239000
         DC    AL4(I0024)                                               00240000
         DC    AL4(I0025)                                               00241000
         DC    AL4(I0026)                                               00242000
         DC    AL4(I0027)                                               00243000
         DC    AL4(I0028)                                               00244000
         DC    AL4(I0029)                                               00245000
         DC    AL4(I0030)                                               00246000
         DC    AL4(I0031)                                               00247000
         DC    AL4(I0032)                                               00248000
         DC    AL4(I0033)                                               00249000
         DC    AL4(I0034)                                               00250000
         DC    AL4(I0035)                                               00251000
         DC    AL4(I0036)                                               00252000
         DC    AL4(I0037)                                               00253000
         DC    AL4(I0038)                                               00254000
         DC    AL4(I0039)                                               00255000
         DC    AL4(I0040)                                               00256000
         DC    AL4(I0041)                                               00257000
         DC    AL4(I0042)                                               00258000
         DC    AL4(I0043)                                               00259000
         DC    AL4(I0044)                                               00260000
         DC    AL4(I0045)                                               00261000
         DC    AL4(I0046)                                               00262000
         DC    AL4(I0047)                                               00263000
         DC    AL4(I0048)                                               00264000
         DC    AL4(I0049)                                               00265000
         DC    AL4(I0050)                                               00266000
         DC    AL4(I0051)                                               00267000
         DC    AL4(I0052)                                               00268000
         DC    AL4(I0053)                                               00269000
         DC    AL4(I0054)                                               00270000
         DC    AL4(I0055)                                               00271000
         DC    AL4(I0056)                                               00272000
         DC    AL4(I0057)                                               00273000
         DC    AL4(I0058)                                               00274000
         DC    AL4(I0059)                                               00275000
         DC    AL4(I0060)                                               00276000
         DC    AL4(I0061)                                               00277000
         DC    AL4(I0062)                                               00278000
         DC    AL4(I0063)                                               00279000
         DC    AL4(I0064)                                               00280000
         DC    AL4(I0065)                                               00281000
         DC    AL4(I0066)                                               00282000
         DC    AL4(I0067)                                               00283000
         DC    AL4(I0068)                                               00284000
         DC    AL4(I0069)                                               00285000
         DC    AL4(I0070)                                               00286000
         DC    AL4(I0071)                                               00287000
         DC    AL4(I0072)                                               00288000
         DC    AL4(I0073)                                               00289000
         DC    AL4(I0074)                                               00290000
         DC    AL4(I0075)                                               00291000
         DC    AL4(I0076)                                               00292000
         DC    AL4(I0077)                                               00293000
         DC    AL4(I0078)                                               00294000
         DC    AL4(I0079)                                               00295000
         DC    AL4(I0080)                                               00296000
         DC    AL4(I0081)                                               00297000
         DC    AL4(I0082)                                               00298000
         DC    AL4(I0083)                                               00299000
         DC    AL4(I0084)                                               00300000
         DC    AL4(I0085)                                               00301000
         DC    AL4(I0086)                                               00302000
         DC    AL4(I0087)                                               00303000
         DC    AL4(I0088)                                               00304000
         DC    AL4(I0089)                                               00305000
         DC    AL4(I0090)                                               00306000
         DC    AL4(I0091)                                               00307000
         DC    AL4(I0092)                                               00308000
         DC    AL4(I0093)                                               00309000
         DC    AL4(I0094)                                               00310000
         DC    AL4(I0095)                                               00311000
         DC    AL4(I0096)                                               00312000
         DC    AL4(I0097)                                               00313000
         DC    AL4(I0098)                                               00314000
         DC    AL4(I0099)                                               00315000
         DC    AL4(I00100)                                              00316000
         DC    AL4(I00101)                                              00317000
         DC    AL4(I00102)                                              00318000
         DC    AL4(I00103)                                              00319000
         DC    AL4(I00104)                                              00320000
         DC    AL4(I00105)                                              00321000
         DC    AL4(I00106)                                              00322000
         DC    AL4(I00107)                                              00323000
         DC    AL4(I00108)                                              00324000
         DC    AL4(I00109)                                              00325000
         DC    AL4(I00110)                                              00326000
         DC    AL4(I00111)                                              00327000
         DC    AL4(I00112)                                              00328000
         DC    AL4(I00113)                                              00329000
         DC    AL4(I00114)                                              00330000
         DC    AL4(I00115)                                              00331000
         DC    AL4(I00116)                                              00332000
         DC    AL4(I00117)                                              00333000
         DC    AL4(I00118)                                              00334000
         DC    AL4(I00119)                                              00335000
         DC    AL4(I00120)                                              00336000
         DC    AL4(I00121)                                              00337000
         DC    AL4(I00122)                                              00338000
         DC    AL4(I00123)                                              00339000
         DC    AL4(I00124)                                              00340000
         DC    AL4(I00125)                                              00341000
         DC    AL4(I00126)                                              00342000
         DC    AL4(I00127)                                              00343000
         DC    AL4(I00128)                                              00344000
         DC    AL4(I00129)                                              00345000
         DC    AL4(I00130)                                              00346000
         DC    AL4(I00131)                                              00347000
         DC    AL4(I00132)                                              00348000
         DC    AL4(I00133)                                              00349000
         DC    AL4(I00134)                                              00350000
SVCTB    DC    0A(0)                                            DSKC125 00353000
         DC    AL4(M0499)                                               00355000
         DC    F'6'                                                     00356000
         DC    AL4(LINKCODE)                                            00357000
         DC    AL4(I0036)                                               00358000
         DC    F'8'                                                     00359000
         DC    AL4(LOADCODE)                                            00360000
         DC    AL4(I0023)                                               00361000
         DC    F'0'                                                     00362000
SVCTBRC  DC    0A(0)                                            DSKC125 00364000
         DC    AL4(M0599)                                               00366000
SVCESTAE DC    0A(0)                                            DSKC125 00367000
         DC    F'60'                                                    00369000
         DC    AL4(ESTAERC)                                             00370000
SVCFREEM DC    0A(0)                                            DSKC125 00372000
         DC    F'10'                                                    00374000
         DC    AL4(FREERC)                                              00375000
SVCGETMN DC    0A(0)                                            DSKC125 00377000
         DC    F'120'                                                   00379000
         DC    AL4(GETRC)                                               00380000
         DC    F'0'                                                     00382000
M001     DC    0H'0'                                            DSKC125 00384000
         DC    AL1(0)                                                   00386000
         DC    AL1(0)                                                   00387000
         DC    AL1(0)                                                   00388000
         DC    AL1(0)                                                   00389000
         DC    AL1(0)                                                   00390000
         DC    AL1(0)                                                   00391000
         DC    H'37'                                                    00392000
         DC    H'0'                                                     00393000
         DC    CL32'IKJ57002I NO ACTIVE PROGRAM LEFT'                   00394000
         DC    CL1' '                                                   00395000
         DC    CL1' '                                                   00396000
M002     DC    0H'0'                                            DSKC125 00398000
         DC    AL1(17)                                                  00400000
         DC    AL1(33)                                                  00401000
         DC    AL1(0)                                                   00402000
         DC    AL1(0)                                                   00403000
         DC    AL1(0)                                                   00404000
         DC    AL1(0)                                                   00405000
         DC    H'38'                                                    00406000
         DC    H'0'                                                     00407000
         DC    CL16'IKJ57005I MEMBER'                                   00408000
         DC    CL1' '                                                   00409000
         DC    CL15'NOT IN DATA SET'                                    00410000
         DC    CL1' '                                                   00411000
         DC    CL1' '                                                   00412000
         DC    CL1' '                                                   00413000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 00416000
M003     DC    0H'0'                                            DSKC125 00416000
         DC    AL1(0)                                                   00418000
         DC    AL1(0)                                                   00419000
         DC    AL1(0)                                                   00420000
         DC    AL1(0)                                                   00421000
         DC    AL1(0)                                                   00422000
         DC    AL1(0)                                                   00423000
         DC    H'30'                                                    00424000
         DC    H'0'                                                     00425000
         DC    CL25'IKJ57021I INVALID COMMAND'                          00426000
         DC    CL1' '                                                   00427000
         DC    CL1' '                                                   00428000
         DC    X'F0'                         !!! SOURCE COMPARE FIX !!! 00431000
M004     DC    0H'0'                                            DSKC125 00431000
         DC    AL1(0)                                                   00433000
         DC    AL1(0)                                                   00434000
         DC    AL1(0)                                                   00435000
         DC    AL1(0)                                                   00436000
         DC    AL1(0)                                                   00437000
         DC    AL1(0)                                                   00438000
         DC    H'67'                                                    00439000
         DC    H'0'                                                     00440000
         DC    CL62'IKJ57022I BREAKPOINT SVC 97 FAILED WITH A PROTECTIOC00441000
               N VIOLATION'                                             00442000
         DC    CL1' '                                                   00443000
         DC    CL1' '                                                   00444000
M005     DC    0H'0'                                            DSKC125 00446000
         DC    AL1(0)                                                   00448000
         DC    AL1(0)                                                   00449000
         DC    AL1(0)                                                   00450000
         DC    AL1(0)                                                   00451000
         DC    AL1(0)                                                   00452000
         DC    AL1(0)                                                   00453000
         DC    H'57'                                                    00454000
         DC    H'0'                                                     00455000
         DC    CL52'IKJ57023I PROGRAM UNDER TEST HAS TERMINATED NORMALLC00456000
               Y'                                                       00457000
         DC    CL1' '                                                   00458000
         DC    CL1' '                                                   00459000
M006     DC    0H'0'                                            DSKC125 00461000
         DC    AL1(13)                                                  00463000
         DC    AL1(0)                                                   00464000
         DC    AL1(0)                                                   00465000
         DC    AL1(0)                                                   00466000
         DC    AL1(0)                                                   00467000
         DC    AL1(0)                                                   00468000
         DC    H'18'                                                    00469000
         DC    H'0'                                                     00470000
         DC    CL12'IKJ57024I AT'                                       00471000
         DC    CL1' '                                                   00472000
         DC    CL1' '                                                   00473000
         DC    CL1' '                                                   00474000
         DC    X'02'                         !!! SOURCE COMPARE FIX !!! 00477000
M007     DC    0H'0'                                            DSKC125 00477000
         DC    AL1(44)                                                  00479000
         DC    AL1(0)                                                   00480000
         DC    AL1(0)                                                   00481000
         DC    AL1(0)                                                   00482000
         DC    AL1(0)                                                   00483000
         DC    AL1(0)                                                   00484000
         DC    H'49'                                                    00485000
         DC    H'0'                                                     00486000
         DC    CL43'IKJ57025I PROGRAM UNDER TEST HAS TERMINATED'        00487000
         DC    CL1' '                                                   00488000
         DC    CL1' '                                                   00489000
         DC    CL1' '                                                   00490000
M008     DC    0H'0'                                            DSKC125 00492000
         DC    AL1(37)                                                  00494000
         DC    AL1(0)                                                   00495000
         DC    AL1(0)                                                   00496000
         DC    AL1(0)                                                   00497000
         DC    AL1(0)                                                   00498000
         DC    AL1(0)                                                   00499000
         DC    H'42'                                                    00500000
         DC    H'0'                                                     00501000
         DC    CL36'IKJ57031I INVALID BREAKPOINT ADDRESS'               00502000
         DC    CL1' '                                                   00503000
         DC    CL1' '                                                   00504000
         DC    CL1' '                                                   00505000
         DC    X'EA'                         !!! SOURCE COMPARE FIX !!! 00508000
M009     DC    0H'0'                                            DSKC125 00508000
         DC    AL1(0)                                                   00510000
         DC    AL1(0)                                                   00511000
         DC    AL1(0)                                                   00512000
         DC    AL1(0)                                                   00513000
         DC    AL1(0)                                                   00514000
         DC    AL1(0)                                                   00515000
         DC    H'35'                                                    00516000
         DC    H'0'                                                     00517000
         DC    CL30'IKJ57036I NO BREAKPOINTS FOUND'                     00518000
         DC    CL1' '                                                   00519000
         DC    CL1' '                                                   00520000
M0010    DC    0H'0'                                            DSKC125 00522000
         DC    AL1(26)                                                  00524000
         DC    AL1(0)                                                   00525000
         DC    AL1(0)                                                   00526000
         DC    AL1(0)                                                   00527000
         DC    AL1(0)                                                   00528000
         DC    AL1(0)                                                   00529000
         DC    H'38'                                                    00530000
         DC    H'0'                                                     00531000
         DC    CL25'IKJ57060I VALUE BEGINNING'                          00532000
         DC    CL1' '                                                   00533000
         DC    CL7'INVALID'                                             00534000
         DC    CL1' '                                                   00535000
         DC    CL1' '                                                   00536000
         DC    X'11'                         !!! SOURCE COMPARE FIX !!! 00539000
M0011    DC    0H'0'                                            DSKC125 00539000
         DC    AL1(43)                                                  00541000
         DC    AL1(0)                                                   00542000
         DC    AL1(0)                                                   00543000
         DC    AL1(0)                                                   00544000
         DC    AL1(0)                                                   00545000
         DC    AL1(0)                                                   00546000
         DC    H'48'                                                    00547000
         DC    H'0'                                                     00548000
         DC    CL42'IKJ57063I LENGTH ERROR FOR VALUE BEGINNING'         00549000
         DC    CL1' '                                                   00550000
         DC    CL1' '                                                   00551000
         DC    CL1' '                                                   00552000
M0012    DC    0H'0'                                            DSKC125 00555000
         DC    AL1(46)                                                  00557000
         DC    AL1(0)                                                   00558000
         DC    AL1(0)                                                   00559000
         DC    AL1(0)                                                   00560000
         DC    AL1(0)                                                   00561000
         DC    AL1(0)                                                   00562000
         DC    H'51'                                                    00563000
         DC    H'0'                                                     00564000
         DC    CL45'IKJ57064I DATA TYPE ERROR FOR VALUE BEGINNING'      00565000
         DC    CL1' '                                                   00566000
         DC    CL1' '                                                   00567000
         DC    CL1' '                                                   00568000
M0013    DC    0H'0'                                            DSKC125 00570000
         DC    AL1(0)                                                   00572000
         DC    AL1(0)                                                   00573000
         DC    AL1(0)                                                   00574000
         DC    AL1(0)                                                   00575000
         DC    AL1(0)                                                   00576000
         DC    AL1(0)                                                   00577000
         DC    H'48'                                                    00578000
         DC    H'0'                                                     00579000
         DC    CL43'IKJ57066I DATA AREA CONTAINED BREAKPOINT(S)'        00580000
         DC    CL1' '                                                   00581000
         DC    CL1' '                                                   00582000
         DC    X'F0'                         !!! SOURCE COMPARE FIX !!! 00585000
M0014    DC    0H'0'                                            DSKC125 00585000
         DC    AL1(0)                                                   00587000
         DC    AL1(0)                                                   00588000
         DC    AL1(0)                                                   00589000
         DC    AL1(0)                                                   00590000
         DC    AL1(0)                                                   00591000
         DC    AL1(0)                                                   00592000
         DC    H'55'                                                    00593000
         DC    H'0'                                                     00594000
         DC    CL50'IKJ57061I UNABLE TO MODIFY CONTENTS OF REGISTER(S)' 00595000
         DC    CL1' '                                                   00596000
         DC    CL1' '                                                   00597000
M0015    DC    0H'0'                                            DSKC125 00599000
         DC    AL1(0)                                                   00601000
         DC    AL1(0)                                                   00602000
         DC    AL1(0)                                                   00603000
         DC    AL1(0)                                                   00604000
         DC    AL1(0)                                                   00605000
         DC    AL1(0)                                                   00606000
         DC    H'58'                                                    00607000
         DC    H'0'                                                     00608000
         DC    CL53'IKJ57209I DCB FIELD NAME REQUIRED AFTER FIELD KEYWOC00609000
               RD'                                                      00610000
         DC    CL1' '                                                   00611000
         DC    CL1' '                                                   00612000
         DC    X'6C'                         !!! SOURCE COMPARE FIX !!! 00615000
M0016    DC    0H'0'                                            DSKC125 00615000
         DC    AL1(0)                                                   00617000
         DC    AL1(0)                                                   00618000
         DC    AL1(0)                                                   00619000
         DC    AL1(0)                                                   00620000
         DC    AL1(0)                                                   00621000
         DC    AL1(0)                                                   00622000
         DC    H'58'                                                    00623000
         DC    H'0'                                                     00624000
         DC    CL53'IKJ57219I TCB FIELD NAME REQUIRED AFTER FIELD KEYWOC00625000
               RD'                                                      00626000
         DC    CL1' '                                                   00627000
         DC    CL1' '                                                   00628000
         DC    X'20'                         !!! SOURCE COMPARE FIX !!! 00631000
M0017    DC    0H'0'                                            DSKC125 00631000
         DC    AL1(18)                                                  00633000
         DC    AL1(0)                                                   00634000
         DC    AL1(0)                                                   00635000
         DC    AL1(0)                                                   00636000
         DC    AL1(0)                                                   00637000
         DC    AL1(0)                                                   00638000
         DC    H'23'                                                    00639000
         DC    H'0'                                                     00640000
         DC    CL17'IKJ57241I INVALID'                                  00641000
         DC    CL1' '                                                   00642000
         DC    CL1' '                                                   00643000
         DC    CL1' '                                                   00644000
M0018    DC    0H'0'                                            DSKC125 00646000
         DC    AL1(0)                                                   00648000
         DC    AL1(0)                                                   00649000
         DC    AL1(0)                                                   00650000
         DC    AL1(0)                                                   00651000
         DC    AL1(0)                                                   00652000
         DC    AL1(0)                                                   00653000
         DC    H'48'                                                    00654000
         DC    H'0'                                                     00655000
         DC    CL43'IKJ57242I RANGE EXTENDS INTO PROTECTED CORE'        00656000
         DC    CL1' '                                                   00657000
         DC    CL1' '                                                   00658000
         DC    X'E0'                         !!! SOURCE COMPARE FIX !!! 00661000
M0019    DC    0H'0'                                            DSKC125 00661000
         DC    AL1(34)                                                  00663000
         DC    AL1(0)                                                   00664000
         DC    AL1(0)                                                   00665000
         DC    AL1(0)                                                   00666000
         DC    AL1(0)                                                   00667000
         DC    AL1(0)                                                   00668000
         DC    H'39'                                                    00669000
         DC    H'0'                                                     00670000
         DC    CL33'IKJ57243I INVALID LENGTH FOR TYPE'                  00671000
         DC    CL1' '                                                   00672000
         DC    CL1' '                                                   00673000
         DC    CL1' '                                                   00674000
M0020    DC    0H'0'                                            DSKC125 00676000
         DC    AL1(32)                                                  00678000
         DC    AL1(0)                                                   00679000
         DC    AL1(0)                                                   00680000
         DC    AL1(0)                                                   00681000
         DC    AL1(0)                                                   00682000
         DC    AL1(0)                                                   00683000
         DC    H'37'                                                    00684000
         DC    H'0'                                                     00685000
         DC    CL31'IKJ57244I INVALID DATA FOR TYPE'                    00686000
         DC    CL1' '                                                   00687000
         DC    CL1' '                                                   00688000
         DC    CL1' '                                                   00689000
M0021    DC    0H'0'                                            DSKC125 00691000
         DC    AL1(38)                                                  00693000
         DC    AL1(0)                                                   00694000
         DC    AL1(0)                                                   00695000
         DC    AL1(0)                                                   00696000
         DC    AL1(0)                                                   00697000
         DC    AL1(0)                                                   00698000
         DC    H'43'                                                    00699000
         DC    H'0'                                                     00700000
         DC    CL37'IKJ57245I INVALID INSTRUCTION CODE AT'              00701000
         DC    CL1' '                                                   00702000
         DC    CL1' '                                                   00703000
         DC    CL1' '                                                   00704000
M0022    DC    0H'0'                                            DSKC125 00706000
         DC    AL1(34)                                                  00708000
         DC    AL1(0)                                                   00709000
         DC    AL1(0)                                                   00710000
         DC    AL1(0)                                                   00711000
         DC    AL1(0)                                                   00712000
         DC    AL1(0)                                                   00713000
         DC    H'39'                                                    00714000
         DC    H'0'                                                     00715000
         DC    CL33'IKJ57246I LIST REQUEST INCOMPLETE'                  00716000
         DC    CL1' '                                                   00717000
         DC    CL1' '                                                   00718000
         DC    CL1' '                                                   00719000
M0023    DC    0H'0'                                            DSKC125 00721000
         DC    AL1(0)                                                   00723000
         DC    AL1(0)                                                   00724000
         DC    AL1(0)                                                   00725000
         DC    AL1(0)                                                   00726000
         DC    AL1(0)                                                   00727000
         DC    AL1(0)                                                   00728000
         DC    H'38'                                                    00729000
         DC    H'0'                                                     00730000
         DC    CL33'IKJ57247I INVALID DATA FOR TYPE P'                  00731000
         DC    CL1' '                                                   00732000
         DC    CL1' '                                                   00733000
         DC    X'6C'                         !!! SOURCE COMPARE FIX !!! 00736000
M0024    DC    0H'0'                                            DSKC125 00736000
         DC    AL1(28)                                                  00738000
         DC    AL1(0)                                                   00739000
         DC    AL1(0)                                                   00740000
         DC    AL1(0)                                                   00741000
         DC    AL1(0)                                                   00742000
         DC    AL1(0)                                                   00743000
         DC    H'33'                                                    00744000
         DC    H'0'                                                     00745000
         DC    CL27'IKJ57272I UNABLE TO QUALIFY'                        00746000
         DC    CL1' '                                                   00747000
         DC    CL1' '                                                   00748000
         DC    CL1' '                                                   00749000
M0025    DC    0H'0'                                            DSKC125 00751000
         DC    AL1(0)                                                   00753000
         DC    AL1(0)                                                   00754000
         DC    AL1(0)                                                   00755000
         DC    AL1(0)                                                   00756000
         DC    AL1(0)                                                   00757000
         DC    AL1(0)                                                   00758000
         DC    H'51'                                                    00759000
         DC    H'0'                                                     00760000
         DC    CL46'IKJ57273I LOADNAME REQUIRED WITH TCB PARAMETER'     00761000
         DC    CL1' '                                                   00762000
         DC    CL1' '                                                   00763000
M0026    DC    0H'0'                                            DSKC125 00765000
         DC    AL1(0)                                                   00767000
         DC    AL1(0)                                                   00768000
         DC    AL1(0)                                                   00769000
         DC    AL1(0)                                                   00770000
         DC    AL1(0)                                                   00771000
         DC    AL1(0)                                                   00772000
         DC    H'36'                                                    00773000
         DC    H'0'                                                     00774000
         DC    CL31'IKJ57274I SPECIFIED TCB IGNORED'                    00775000
         DC    CL1' '                                                   00776000
         DC    CL1' '                                                   00777000
M0027    DC    0H'0'                                            DSKC125 00780000
         DC    AL1(40)                                                  00782000
         DC    AL1(0)                                                   00783000
         DC    AL1(0)                                                   00784000
         DC    AL1(0)                                                   00785000
         DC    AL1(0)                                                   00786000
         DC    AL1(0)                                                   00787000
         DC    H'45'                                                    00788000
         DC    H'0'                                                     00789000
         DC    CL39'IKJ57277I QUALIFICATION IS UNDER TCB AT'            00790000
         DC    CL1' '                                                   00791000
         DC    CL1' '                                                   00792000
         DC    CL1' '                                                   00793000
M0028    DC    0H'0'                                            DSKC125 00795000
         DC    AL1(18)                                                  00797000
         DC    AL1(0)                                                   00798000
         DC    AL1(0)                                                   00799000
         DC    AL1(0)                                                   00800000
         DC    AL1(0)                                                   00801000
         DC    AL1(0)                                                   00802000
         DC    H'32'                                                    00803000
         DC    H'0'                                                     00804000
         DC    CL17'IKJ57280I ADDRESS'                                  00805000
         DC    CL1' '                                                   00806000
         DC    CL9'NOT FOUND'                                           00807000
         DC    CL1' '                                                   00808000
         DC    CL1' '                                                   00809000
         DC    X'20'                         !!! SOURCE COMPARE FIX !!! 00812000
M0029    DC    0H'0'                                            DSKC125 00812000
         DC    AL1(17)                                                  00814000
         DC    AL1(0)                                                   00815000
         DC    AL1(0)                                                   00816000
         DC    AL1(0)                                                   00817000
         DC    AL1(0)                                                   00818000
         DC    AL1(0)                                                   00819000
         DC    H'49'                                                    00820000
         DC    H'0'                                                     00821000
         DC    CL16'IKJ57281I SYMBOL'                                   00822000
         DC    CL1' '                                                   00823000
         DC    CL27'NOT AVAILABLE, SYSTEM ERROR'                        00824000
         DC    CL1' '                                                   00825000
         DC    CL1' '                                                   00826000
M0030    DC    0H'0'                                            DSKC125 00828000
         DC    AL1(0)                                                   00830000
         DC    AL1(0)                                                   00831000
         DC    AL1(0)                                                   00832000
         DC    AL1(0)                                                   00833000
         DC    AL1(0)                                                   00834000
         DC    AL1(0)                                                   00835000
         DC    H'53'                                                    00836000
         DC    H'0'                                                     00837000
         DC    CL48'IKJ57282I NOT ENOUGH MAIN STORAGE TO USE SYMBOLS'   00838000
         DC    CL1' '                                                   00839000
         DC    CL1' '                                                   00840000
M0031    DC    0H'0'                                            DSKC125 00842000
         DC    AL1(29)                                                  00844000
         DC    AL1(44)                                                  00845000
         DC    AL1(0)                                                   00846000
         DC    AL1(0)                                                   00847000
         DC    AL1(0)                                                   00848000
         DC    AL1(0)                                                   00849000
         DC    H'49'                                                    00850000
         DC    H'0'                                                     00851000
         DC    CL28'IKJ57293I INVALID LENGTH FOR'                       00852000
         DC    CL1' '                                                   00853000
         DC    CL14', DEFAULTED TO'                                     00854000
         DC    CL1' '                                                   00855000
         DC    CL1' '                                                   00856000
         DC    CL1' '                                                   00857000
M0032    DC    0H'0'                                            DSKC125 00859000
         DC    AL1(0)                                                   00861000
         DC    AL1(0)                                                   00862000
         DC    AL1(0)                                                   00863000
         DC    AL1(0)                                                   00864000
         DC    AL1(0)                                                   00865000
         DC    AL1(0)                                                   00866000
         DC    H'55'                                                    00867000
         DC    H'0'                                                     00868000
         DC    CL50'IKJ57295I INVALID MULTIPLICITY OR LENGTH SPECIFIED' 00869000
         DC    CL1' '                                                   00870000
         DC    CL1' '                                                   00871000
M0033    DC    0H'0'                                            DSKC125 00873000
         DC    AL1(0)                                                   00875000
         DC    AL1(0)                                                   00876000
         DC    AL1(0)                                                   00877000
         DC    AL1(0)                                                   00878000
         DC    AL1(0)                                                   00879000
         DC    AL1(0)                                                   00880000
         DC    H'36'                                                    00881000
         DC    H'0'                                                     00882000
         DC    CL31'IKJ57296I SYMBOL TABLE IS EMPTY'                    00883000
         DC    CL1' '                                                   00884000
         DC    CL1' '                                                   00885000
         DC    X'02'                         !!! SOURCE COMPARE FIX !!! 00888000
M0034    DC    0H'0'                                            DSKC125 00888000
         DC    AL1(10)                                                  00890000
         DC    AL1(0)                                                   00891000
         DC    AL1(0)                                                   00892000
         DC    AL1(0)                                                   00893000
         DC    AL1(0)                                                   00894000
         DC    AL1(0)                                                   00895000
         DC    H'40'                                                    00896000
         DC    H'0'                                                     00897000
         DC    CL9'IKJ57297I'                                           00898000
         DC    CL1' '                                                   00899000
         DC    CL25'NOT FOUND IN SYMBOL TABLE'                          00900000
         DC    CL1' '                                                   00901000
         DC    CL1' '                                                   00902000
M0035    DC    0H'0'                                            DSKC125 00905000
         DC    AL1(0)                                                   00907000
         DC    AL1(0)                                                   00908000
         DC    AL1(0)                                                   00909000
         DC    AL1(0)                                                   00910000
         DC    AL1(0)                                                   00911000
         DC    AL1(0)                                                   00912000
         DC    H'37'                                                    00913000
         DC    H'0'                                                     00914000
         DC    CL32'IKJ57302I COMMAND CHAIN TOO LONG'                   00915000
         DC    CL1' '                                                   00916000
         DC    CL1' '                                                   00917000
M0036    DC    0H'0'                                            DSKC125 00919000
         DC    AL1(24)                                                  00921000
         DC    AL1(0)                                                   00922000
         DC    AL1(0)                                                   00923000
         DC    AL1(0)                                                   00924000
         DC    AL1(0)                                                   00925000
         DC    AL1(0)                                                   00926000
         DC    H'29'                                                    00927000
         DC    H'0'                                                     00928000
         DC    CL23'IKJ57303I INVALID COUNT'                            00929000
         DC    CL1' '                                                   00930000
         DC    CL1' '                                                   00931000
         DC    CL1' '                                                   00932000
M0037    DC    0H'0'                                            DSKC125 00934000
         DC    AL1(43)                                                  00936000
         DC    AL1(62)                                                  00937000
         DC    AL1(0)                                                   00938000
         DC    AL1(0)                                                   00939000
         DC    AL1(0)                                                   00940000
         DC    AL1(0)                                                   00941000
         DC    H'67'                                                    00942000
         DC    H'0'                                                     00943000
         DC    CL42'IKJ57305I NO BREAKPOINTS ESTABLISHED FROM+'         00944000
         DC    CL1' '                                                   00945000
         DC    CL18'OF RANGE BEGINNING'                                 00946000
         DC    CL1' '                                                   00947000
         DC    CL1' '                                                   00948000
         DC    CL1' '                                                   00949000
M0038    DC    0H'0'                                            DSKC125 00951000
         DC    AL1(39)                                                  00953000
         DC    AL1(0)                                                   00954000
         DC    AL1(0)                                                   00955000
         DC    AL1(0)                                                   00956000
         DC    AL1(0)                                                   00957000
         DC    AL1(0)                                                   00958000
         DC    H'44'                                                    00959000
         DC    H'0'                                                     00960000
         DC    CL38'IKJ57306I NO BREAKPOINT ESTABLISHED AT'             00961000
         DC    CL1' '                                                   00962000
         DC    CL1' '                                                   00963000
         DC    CL1' '                                                   00964000
M0039    DC    0H'0'                                            DSKC125 00967000
         DC    AL1(0)                                                   00969000
         DC    AL1(0)                                                   00970000
         DC    AL1(0)                                                   00971000
         DC    AL1(0)                                                   00972000
         DC    AL1(0)                                                   00973000
         DC    AL1(0)                                                   00974000
         DC    H'51'                                                    00975000
         DC    H'0'                                                     00976000
         DC    CL46'IKJ57309I UNABLE TO ESTABLISH DEFER BREAKPOINT'     00977000
         DC    CL1' '                                                   00978000
         DC    CL1' '                                                   00979000
M0040    DC    0H'0'                                            DSKC125 00981000
         DC    AL1(0)                                                   00983000
         DC    AL1(0)                                                   00984000
         DC    AL1(0)                                                   00985000
         DC    AL1(0)                                                   00986000
         DC    AL1(0)                                                   00987000
         DC    AL1(0)                                                   00988000
         DC    H'56'                                                    00989000
         DC    H'0'                                                     00990000
         DC    CL51'IKJ57334I DEB DOES NOT HAVE A DIRECT ACCESS SECTIONC00991000
               '                                                        00992000
         DC    CL1' '                                                   00993000
         DC    CL1' '                                                   00994000
         DC    X'28'                         !!! SOURCE COMPARE FIX !!! 00997000
M0041    DC    0H'0'                                            DSKC125 00997000
         DC    AL1(0)                                                   00999000
         DC    AL1(0)                                                   01000000
         DC    AL1(0)                                                   01001000
         DC    AL1(0)                                                   01002000
         DC    AL1(0)                                                   01003000
         DC    AL1(0)                                                   01004000
         DC    H'58'                                                    01005000
         DC    H'0'                                                     01006000
         DC    CL53'IKJ57335I DEB FIELD NAME REQUIRED AFTER FIELD KEYWOC01007000
               RD'                                                      01008000
         DC    CL1' '                                                   01009000
         DC    CL1' '                                                   01010000
         DC    X'0C'                         !!! SOURCE COMPARE FIX !!! 01013000
M0042    DC    0H'0'                                            DSKC125 01013000
         DC    AL1(0)                                                   01015000
         DC    AL1(0)                                                   01016000
         DC    AL1(0)                                                   01017000
         DC    AL1(0)                                                   01018000
         DC    AL1(0)                                                   01019000
         DC    AL1(0)                                                   01020000
         DC    H'55'                                                    01021000
         DC    H'0'                                                     01022000
         DC    CL50'IKJ57336I DATA HAS BEEN LOST DURING I/O PROCESSING' 01023000
         DC    CL1' '                                                   01024000
         DC    CL1' '                                                   01025000
M0045    DC    0H'0'                                            DSKC125 01027000
         DC    AL1(0)                                                   01029000
         DC    AL1(0)                                                   01030000
         DC    AL1(0)                                                   01031000
         DC    AL1(0)                                                   01032000
         DC    AL1(0)                                                   01033000
         DC    AL1(0)                                                   01034000
         DC    H'37'                                                    01035000
         DC    H'0'                                                     01036000
         DC    CL32'IKJ57370I UNABLE TO LOAD PROGRAM'                   01037000
         DC    CL1' '                                                   01038000
         DC    CL1' '                                                   01039000
M0046    DC    0H'0'                                            DSKC125 01041000
         DC    AL1(21)                                                  01043000
         DC    AL1(0)                                                   01044000
         DC    AL1(0)                                                   01045000
         DC    AL1(0)                                                   01046000
         DC    AL1(0)                                                   01047000
         DC    AL1(0)                                                   01048000
         DC    H'26'                                                    01049000
         DC    H'0'                                                     01050000
         DC    CL20'IKJ57375I STORAGE AT'                               01051000
         DC    CL1' '                                                   01052000
         DC    CL1' '                                                   01053000
         DC    CL1' '                                                   01054000
         DC    X'20'                         !!! SOURCE COMPARE FIX !!! 01057000
M0047    DC    0H'0'                                            DSKC125 01057000
         DC    AL1(0)                                                   01059000
         DC    AL1(0)                                                   01060000
         DC    AL1(0)                                                   01061000
         DC    AL1(0)                                                   01062000
         DC    AL1(0)                                                   01063000
         DC    AL1(0)                                                   01064000
         DC    H'54'                                                    01065000
         DC    H'0'                                                     01066000
         DC    CL49'IKJ57378I ZERO BYTES IS INVALID COUNT FOR GETMAIN'  01067000
         DC    CL1' '                                                   01068000
         DC    CL1' '                                                   01069000
         DC    X'20'                         !!! SOURCE COMPARE FIX !!! 01072000
M0048    DC    0H'0'                                            DSKC125 01072000
         DC    AL1(0)                                                   01074000
         DC    AL1(0)                                                   01075000
         DC    AL1(0)                                                   01076000
         DC    AL1(0)                                                   01077000
         DC    AL1(0)                                                   01078000
         DC    AL1(0)                                                   01079000
         DC    H'45'                                                    01080000
         DC    H'0'                                                     01081000
         DC    CL40'IKJ57379I MEMBER NAME MISSING, RESPECIFY'           01082000
         DC    CL1' '                                                   01083000
         DC    CL1' '                                                   01084000
M0049    DC    0H'0'                                            DSKC125 01086000
         DC    AL1(25)                                                  01088000
         DC    AL1(0)                                                   01089000
         DC    AL1(0)                                                   01090000
         DC    AL1(0)                                                   01091000
         DC    AL1(0)                                                   01092000
         DC    AL1(0)                                                   01093000
         DC    H'30'                                                    01094000
         DC    H'0'                                                     01095000
         DC    CL24'IKJ57382I ENTRY POINT AT'                           01096000
         DC    CL1' '                                                   01097000
         DC    CL1' '                                                   01098000
         DC    CL1' '                                                   01099000
M0050    DC    0H'0'                                            DSKC125 01102000
         DC    AL1(0)                                                   01104000
         DC    AL1(0)                                                   01105000
         DC    AL1(0)                                                   01106000
         DC    AL1(0)                                                   01107000
         DC    AL1(0)                                                   01108000
         DC    AL1(0)                                                   01109000
         DC    H'27'                                                    01110000
         DC    H'0'                                                     01111000
         DC    CL22'IKJ57395I MAP COMPLETE'                             01112000
         DC    CL1' '                                                   01113000
         DC    CL1' '                                                   01114000
M0051    DC    0H'0'                                            DSKC125 01116000
         DC    AL1(0)                                                   01118000
         DC    AL1(0)                                                   01119000
         DC    AL1(0)                                                   01120000
         DC    AL1(0)                                                   01121000
         DC    AL1(0)                                                   01122000
         DC    AL1(0)                                                   01123000
         DC    H'34'                                                    01124000
         DC    H'0'                                                     01125000
         DC    CL29'IKJ57400I PERMANENT I/O ERROR'                      01126000
         DC    CL1' '                                                   01127000
         DC    CL1' '                                                   01128000
         DC    X'D3'                         !!! SOURCE COMPARE FIX !!! 01131000
M0052    DC    0H'0'                                            DSKC125 01131000
         DC    AL1(0)                                                   01133000
         DC    AL1(0)                                                   01134000
         DC    AL1(0)                                                   01135000
         DC    AL1(0)                                                   01136000
         DC    AL1(0)                                                   01137000
         DC    AL1(0)                                                   01138000
         DC    H'38'                                                    01139000
         DC    H'0'                                                     01140000
         DC    CL33'IKJ57401I UNABLE TO OPEN DATA SET'                  01141000
         DC    CL1' '                                                   01142000
         DC    CL1' '                                                   01143000
         DC    X'E9'                         !!! SOURCE COMPARE FIX !!! 01146000
M0053    DC    0H'0'                                            DSKC125 01146000
         DC    AL1(0)                                                   01148000
         DC    AL1(0)                                                   01149000
         DC    AL1(0)                                                   01150000
         DC    AL1(0)                                                   01151000
         DC    AL1(0)                                                   01152000
         DC    AL1(0)                                                   01153000
         DC    H'61'                                                    01154000
         DC    H'0'                                                     01155000
         DC    CL56'IKJ57404I TEST SVC 61 FAILED WITH A PROTECTION VIOLC01156000
               ATION'                                                   01157000
         DC    CL1' '                                                   01158000
         DC    CL1' '                                                   01159000
M0054    DC    0H'0'                                            DSKC125 01161000
         DC    AL1(40)                                                  01163000
         DC    AL1(0)                                                   01164000
         DC    AL1(0)                                                   01165000
         DC    AL1(0)                                                   01166000
         DC    AL1(0)                                                   01167000
         DC    AL1(0)                                                   01168000
         DC    H'45'                                                    01169000
         DC    H'0'                                                     01170000
         DC    CL39'IKJ57405I UNABLE TO PRINT INTO DATA SET'            01171000
         DC    CL1' '                                                   01172000
         DC    CL1' '                                                   01173000
         DC    CL1' '                                                   01174000
M0058    DC    0H'0'                                            DSKC125 01176000
         DC    AL1(10)                                                  01178000
         DC    AL1(0)                                                   01179000
         DC    AL1(0)                                                   01180000
         DC    AL1(0)                                                   01181000
         DC    AL1(0)                                                   01182000
         DC    AL1(0)                                                   01183000
         DC    H'21'                                                    01184000
         DC    H'0'                                                     01185000
         DC    CL9'IKJ57430I'                                           01186000
         DC    CL1' '                                                   01187000
         DC    CL6'FAILED'                                              01188000
         DC    CL1' '                                                   01189000
         DC    CL1' '                                                   01190000
M0064    DC    0H'0'                                            DSKC125 01192000
         DC    AL1(25)                                                  01194000
         DC    AL1(0)                                                   01195000
         DC    AL1(0)                                                   01196000
         DC    AL1(0)                                                   01197000
         DC    AL1(0)                                                   01198000
         DC    AL1(0)                                                   01199000
         DC    H'30'                                                    01200000
         DC    H'0'                                                     01201000
         DC    CL24'IKJ57456I INVALID LENGTH'                           01202000
         DC    CL1' '                                                   01203000
         DC    CL1' '                                                   01204000
         DC    CL1' '                                                   01205000
         DC    X'97'                         !!! SOURCE COMPARE FIX !!! 01208000
M0066    DC    0H'0'                                            DSKC125 01208000
         DC    AL1(0)                                                   01210000
         DC    AL1(0)                                                   01211000
         DC    AL1(0)                                                   01212000
         DC    AL1(0)                                                   01213000
         DC    AL1(0)                                                   01214000
         DC    AL1(0)                                                   01215000
         DC    H'35'                                                    01216000
         DC    H'0'                                                     01217000
         DC    CL30'IKJ57454I INVALID FROM ADDRESS'                     01218000
         DC    CL1' '                                                   01219000
         DC    CL1' '                                                   01220000
M0067    DC    0H'0'                                            DSKC125 01222000
         DC    AL1(0)                                                   01224000
         DC    AL1(0)                                                   01225000
         DC    AL1(0)                                                   01226000
         DC    AL1(0)                                                   01227000
         DC    AL1(0)                                                   01228000
         DC    AL1(0)                                                   01229000
         DC    H'32'                                                    01230000
         DC    H'0'                                                     01231000
         DC    CL27'IKJ57461I COMMAND NOT FOUND'                        01232000
         DC    CL1' '                                                   01233000
         DC    CL1' '                                                   01234000
         DC    X'E9'                         !!! SOURCE COMPARE FIX !!! 01237000
M0068    DC    0H'0'                                            DSKC125 01237000
         DC    AL1(10)                                                  01239000
         DC    AL1(0)                                                   01240000
         DC    AL1(0)                                                   01241000
         DC    AL1(0)                                                   01242000
         DC    AL1(0)                                                   01243000
         DC    AL1(0)                                                   01244000
         DC    H'33'                                                    01245000
         DC    H'0'                                                     01246000
         DC    CL9'IKJ57462I'                                           01247000
         DC    CL1' '                                                   01248000
         DC    CL18'ENDED DUE TO ERROR'                                 01249000
         DC    CL1' '                                                   01250000
         DC    CL1' '                                                   01251000
M0069    DC    0H'0'                                            DSKC125 01253000
         DC    AL1(0)                                                   01255000
         DC    AL1(0)                                                   01256000
         DC    AL1(0)                                                   01257000
         DC    AL1(0)                                                   01258000
         DC    AL1(0)                                                   01259000
         DC    AL1(0)                                                   01260000
         DC    H'47'                                                    01261000
         DC    H'0'                                                     01262000
         DC    CL42'IKJ57008I PARAMETER STRING LENGTH EXCEEDED'         01263000
         DC    CL1' '                                                   01264000
         DC    CL1' '                                                   01265000
M0070    DC    0H'0'                                            DSKC125 01267000
         DC    AL1(0)                                                   01269000
         DC    AL1(0)                                                   01270000
         DC    AL1(0)                                                   01271000
         DC    AL1(0)                                                   01272000
         DC    AL1(0)                                                   01273000
         DC    AL1(0)                                                   01274000
         DC    H'35'                                                    01275000
         DC    H'0'                                                     01276000
         DC    CL30'IKJ57090A ENTER COMMAND FOR CP'                     01277000
         DC    CL1' '                                                   01278000
         DC    CL1' '                                                   01279000
M0071    DC    0H'0'                                            DSKC125 01281000
         DC    X'00'                                                    01283000
         DC    XL5'0'                                                   01284000
         DC    H'11'                                                    01285000
         DC    H'0'                                                     01286000
         DC    CL7' TEST'                                               01287000
         DC    X'30'                         !!! SOURCE COMPARE FIX !!! 01290000
M0072    DC    0H'0'                                            DSKC125 01290000
         DC    AL1(29)                                                  01292000
         DC    AL1(0)                                                   01293000
         DC    AL1(0)                                                   01294000
         DC    AL1(0)                                                   01295000
         DC    AL1(0)                                                   01296000
         DC    AL1(0)                                                   01297000
         DC    H'34'                                                    01298000
         DC    H'0'                                                     01299000
         DC    CL28'IKJ57455I INVALID TO ADDRESS'                       01300000
         DC    CL1' '                                                   01301000
         DC    CL1' '                                                   01302000
         DC    CL1' '                                                   01303000
         DC    X'5C'                         !!! SOURCE COMPARE FIX !!! 01306000
M0073    DC    0H'0'                                            DSKC125 01306000
         DC    AL1(42)                                                  01308000
         DC    AL1(0)                                                   01309000
         DC    AL1(0)                                                   01310000
         DC    AL1(0)                                                   01311000
         DC    AL1(0)                                                   01312000
         DC    AL1(0)                                                   01313000
         DC    H'47'                                                    01314000
         DC    H'0'                                                     01315000
         DC    CL41'IKJ57457I INVALID ADDRESS RANGE BEGINNING'          01316000
         DC    CL1' '                                                   01317000
         DC    CL1' '                                                   01318000
         DC    CL1' '                                                   01319000
M0100    DC    0H'0'                                            DSKC125 01321000
         DC    AL1(0)                                                   01323000
         DC    AL1(0)                                                   01324000
         DC    AL1(0)                                                   01325000
         DC    AL1(0)                                                   01326000
         DC    AL1(0)                                                   01327000
         DC    AL1(0)                                                   01328000
         DC    H'38'                                                    01329000
         DC    H'0'                                                     01330000
         DC    CL33'IKJ57501I TEST ENDED DUE TO ERROR'                  01331000
         DC    CL1' '                                                   01332000
         DC    CL1' '                                                   01333000
         DC    X'F2'                         !!! SOURCE COMPARE FIX !!! 01336000
M0101    DC    0H'0'                                            DSKC125 01336000
         DC    AL1(26)                                                  01338000
         DC    AL1(0)                                                   01339000
         DC    AL1(0)                                                   01340000
         DC    AL1(0)                                                   01341000
         DC    AL1(0)                                                   01342000
         DC    AL1(0)                                                   01343000
         DC    H'31'                                                    01344000
         DC    H'0'                                                     01345000
         DC    CL25'IKJ57502I INVALID ADDRESS'                          01346000
         DC    CL1' '                                                   01347000
         DC    CL1' '                                                   01348000
         DC    CL1' '                                                   01349000
M0103    DC    0H'0'                                            DSKC125 01351000
         DC    AL1(0)                                                   01353000
         DC    AL1(0)                                                   01354000
         DC    AL1(0)                                                   01355000
         DC    AL1(0)                                                   01356000
         DC    AL1(0)                                                   01357000
         DC    AL1(0)                                                   01358000
         DC    H'57'                                                    01359000
         DC    H'0'                                                     01360000
         DC    CL52'IKJ57503I NOT ENOUGH MAIN STORAGE TO EXECUTE COMMANC01361000
               D'                                                       01362000
         DC    CL1' '                                                   01363000
         DC    CL1' '                                                   01364000
M0104    DC    0H'0'                                            DSKC125 01366000
         DC    AL1(10)                                                  01368000
         DC    AL1(0)                                                   01369000
         DC    AL1(0)                                                   01370000
         DC    AL1(0)                                                   01371000
         DC    AL1(0)                                                   01372000
         DC    AL1(0)                                                   01373000
         DC    H'43'                                                    01374000
         DC    H'0'                                                     01375000
         DC    CL9'IKJ57504I'                                           01376000
         DC    CL1' '                                                   01377000
         DC    CL28'FAILED, COMMAND SYSTEM ERROR'                       01378000
         DC    CL1' '                                                   01379000
         DC    CL1' '                                                   01380000
M0105    DC    0H'0'                                            DSKC125 01382000
         DC    AL1(30)                                                  01384000
         DC    AL1(0)                                                   01385000
         DC    AL1(0)                                                   01386000
         DC    AL1(0)                                                   01387000
         DC    AL1(0)                                                   01388000
         DC    AL1(0)                                                   01389000
         DC    H'35'                                                    01390000
         DC    H'0'                                                     01391000
         DC    CL29'IKJ57505I THE RETURN CODE WAS'                      01392000
         DC    CL1' '                                                   01393000
         DC    CL1' '                                                   01394000
         DC    CL1' '                                                   01395000
M0106    DC    0H'0'                                            DSKC125 01397000
         DC    AL1(10)                                                  01399000
         DC    AL1(11)                                                  01400000
         DC    AL1(12)                                                  01401000
         DC    AL1(13)                                                  01402000
         DC    AL1(14)                                                  01403000
         DC    AL1(15)                                                  01404000
         DC    H'20'                                                    01405000
         DC    H'0'                                                     01406000
         DC    CL9'IKJ57506I'                                           01407000
         DC    CL1' '                                                   01408000
         DC    CL1' '                                                   01409000
         DC    CL1' '                                                   01410000
         DC    CL1' '                                                   01411000
         DC    CL1' '                                                   01412000
         DC    CL1' '                                                   01413000
         DC    CL1' '                                                   01414000
M0107    DC    0H'0'                                            DSKC125 01416000
         DC    AL1(10)                                                  01418000
         DC    AL1(0)                                                   01419000
         DC    AL1(0)                                                   01420000
         DC    AL1(0)                                                   01421000
         DC    AL1(0)                                                   01422000
         DC    AL1(0)                                                   01423000
         DC    H'21'                                                    01424000
         DC    H'0'                                                     01425000
         DC    CL9'IKJ57507I'                                           01426000
         DC    CL1' '                                                   01427000
         DC    CL6'FAILED'                                              01428000
         DC    CL1' '                                                   01429000
         DC    CL1' '                                                   01430000
M0108    DC    0H'0'                                            DSKC125 01431010
         DC    AL1(0)                                           DSKC125 01431020
         DC    AL1(0)                                           DSKC125 01431030
         DC    AL1(0)                                           DSKC125 01431040
         DC    AL1(0)                                           DSKC125 01431050
         DC    AL1(0)                                           DSKC125 01431060
         DC    AL1(0)                                           DSKC125 01431070
         DC    H'105'                                           DSKC125 01431080
         DC    H'0'                                             DSKC125 01431090
         DC    C'IKJ57662I'                                     DSKC125 01431100
         DC    C' '                                             DSKC125 01431110
         DC    C'COMMAND ENTERED IS NOT PROCESSED BECAUSE '     DSKC125 01431120
         DC    C'TEST ENVIRONMENT ENDED DUE TO UNRECOVERABLE '  DSKC125 01431130
         DC    C'ERROR'                                         DSKC125 01431140
         DC    C' '                                             DSKC125 01431150
         DC    C' '                                             DSKC125 01431160
M0200    DC    0H'0'                                            DSKC125 01432000
         DC    AL1(0)                                                   01434000
         DC    AL1(0)                                                   01435000
         DC    AL1(0)                                                   01436000
         DC    AL1(0)                                                   01437000
         DC    AL1(0)                                                   01438000
         DC    AL1(0)                                                   01439000
         DC    H'79'                                                    01440000
         DC    H'0'                                                     01441000
         DC    CL1' '                                                   01442000
         DC    CL64'THE COMMAND ENTERED IS NOT SUPPORTED IN TEST MODE IC01443000
               N THIS SYSTEM'                                           01444000
         DC    CL1' '                                                   01445000
         DC    CL1' '                                                   01446000
         DC    X'03'                         !!! SOURCE COMPARE FIX !!! 01449000
M0201    DC    0H'0'                                            DSKC125 01449000
         DC    AL1(0)                                                   01451000
         DC    AL1(0)                                                   01452000
         DC    AL1(0)                                                   01453000
         DC    AL1(0)                                                   01454000
         DC    AL1(0)                                                   01455000
         DC    AL1(0)                                                   01456000
         DC    H'46'                                                    01457000
         DC    H'0'                                                     01458000
         DC    CL1' '                                                   01459000
         DC    CL31'BREAKPOINTS SET ARE STILL VALID'                    01460000
         DC    CL1' '                                                   01461000
         DC    CL1' '                                                   01462000
M0202    DC    0H'0'                                            DSKC125 01464000
         DC    AL1(10)                                                  01466000
         DC    AL1(11)                                                  01467000
         DC    AL1(12)                                                  01468000
         DC    AL1(13)                                                  01469000
         DC    AL1(14)                                                  01470000
         DC    AL1(15)                                                  01471000
         DC    H'20'                                                    01472000
         DC    H'0'                                                     01473000
         DC    CL1' '                                                   01474000
         DC    CL1' '                                                   01475000
         DC    CL1' '                                                   01476000
         DC    CL1' '                                                   01477000
         DC    CL1' '                                                   01478000
         DC    CL1' '                                                   01479000
         DC    CL1' '                                                   01480000
M0203    DC    0H'0'                                            DSKC125 01483000
         DC    AL1(0)                                                   01485000
         DC    AL1(0)                                                   01486000
         DC    AL1(0)                                                   01487000
         DC    AL1(0)                                                   01488000
         DC    AL1(0)                                                   01489000
         DC    AL1(0)                                                   01490000
         DC    H'46'                                                    01491000
         DC    H'0'                                                     01492000
         DC    CL1' '                                                   01493000
         DC    CL31'BREAKPOINTS ARE NO LONGER VALID'                    01494000
         DC    CL1' '                                                   01495000
         DC    CL1' '                                                   01496000
M0204    DC    0H'0'                                            DSKC125 01498000
         DC    AL1(0)                                                   01500000
         DC    AL1(0)                                                   01501000
         DC    AL1(0)                                                   01502000
         DC    AL1(0)                                                   01503000
         DC    AL1(0)                                                   01504000
         DC    AL1(0)                                                   01505000
         DC    H'64'                                                    01506000
         DC    H'0'                                                     01507000
         DC    CL1' '                                                   01508000
         DC    CL49'A BREAKPOINT WAS DETECTED IN A PRIVILEGED PROGRAM'  01509000
         DC    CL1' '                                                   01510000
         DC    CL1' '                                                   01511000
M0205    DC    0H'0'                                            DSKC125 01513000
         DC    AL1(0)                                                   01515000
         DC    AL1(0)                                                   01516000
         DC    AL1(0)                                                   01517000
         DC    AL1(0)                                                   01518000
         DC    AL1(0)                                                   01519000
         DC    AL1(0)                                                   01520000
         DC    H'60'                                                    01521000
         DC    H'0'                                                     01522000
         DC    CL1' '                                                   01523000
         DC    CL45'BOTH THE ACTIVE AND DEFERRED QUEUES ARE EMPTY'      01524000
         DC    CL1' '                                                   01525000
         DC    CL1' '                                                   01526000
M0206    DC    0H'0'                                            DSKC125 01528000
         DC    AL1(0)                                                   01530000
         DC    AL1(0)                                                   01531000
         DC    AL1(0)                                                   01532000
         DC    AL1(0)                                                   01533000
         DC    AL1(0)                                                   01534000
         DC    AL1(0)                                                   01535000
         DC    H'67'                                                    01536000
         DC    H'0'                                                     01537000
         DC    CL1' '                                                   01538000
         DC    CL52'UNABLE TO LOCATE ADDRESS ON ACTIVE OR DEFERRED QUEUC01539000
               E'                                                       01540000
         DC    CL1' '                                                   01541000
         DC    CL1' '                                                   01542000
         DC    X'6B'                         !!! SOURCE COMPARE FIX !!! 01545000
M0207    DC    0H'0'                                            DSKC125 01545000
         DC    AL1(0)                                                   01547000
         DC    AL1(0)                                                   01548000
         DC    AL1(0)                                                   01549000
         DC    AL1(0)                                                   01550000
         DC    AL1(0)                                                   01551000
         DC    AL1(0)                                                   01552000
         DC    H'74'                                                    01553000
         DC    H'0'                                                     01554000
         DC    CL1' '                                                   01555000
         DC    CL59'FIRST ADDRESS OF RANGE MUST NOT BE HIGHER THAN LASTC01556000
                ADDRESS'                                                01557000
         DC    CL1' '                                                   01558000
         DC    CL1' '                                                   01559000
M0208    DC    0H'0'                                            DSKC125 01561000
         DC    AL1(0)                                                   01563000
         DC    AL1(0)                                                   01564000
         DC    AL1(0)                                                   01565000
         DC    AL1(0)                                                   01566000
         DC    AL1(0)                                                   01567000
         DC    AL1(0)                                                   01568000
         DC    H'53'                                                    01569000
         DC    H'0'                                                     01570000
         DC    CL1' '                                                   01571000
         DC    CL38'AN INVALID PDE WAS OBTAINED FROM PARSE'             01572000
         DC    CL1' '                                                   01573000
         DC    CL1' '                                                   01574000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 01577000
M0209    DC    0H'0'                                            DSKC125 01577000
         DC    AL1(0)                                                   01579000
         DC    AL1(0)                                                   01580000
         DC    AL1(0)                                                   01581000
         DC    AL1(0)                                                   01582000
         DC    AL1(0)                                                   01583000
         DC    AL1(0)                                                   01584000
         DC    H'56'                                                    01585000
         DC    H'0'                                                     01586000
         DC    CL1' '                                                   01587000
         DC    CL41'DATA STRING CONTAINS AN INVALID CHARACTER'          01588000
         DC    CL1' '                                                   01589000
         DC    CL1' '                                                   01590000
M0210    DC    0H'0'                                            DSKC125 01592000
         DC    AL1(0)                                                   01594000
         DC    AL1(0)                                                   01595000
         DC    AL1(0)                                                   01596000
         DC    AL1(0)                                                   01597000
         DC    AL1(0)                                                   01598000
         DC    AL1(0)                                                   01599000
         DC    H'35'                                                    01600000
         DC    H'0'                                                     01601000
         DC    CL1' '                                                   01602000
         DC    CL20'DATA STRING TOO LONG'                               01603000
         DC    CL1' '                                                   01604000
         DC    CL1' '                                                   01605000
         DC    X'F2'                         !!! SOURCE COMPARE FIX !!! 01608000
M0211    DC    0H'0'                                            DSKC125 01608000
         DC    AL1(0)                                                   01610000
         DC    AL1(0)                                                   01611000
         DC    AL1(0)                                                   01612000
         DC    AL1(0)                                                   01613000
         DC    AL1(0)                                                   01614000
         DC    AL1(0)                                                   01615000
         DC    H'39'                                                    01616000
         DC    H'0'                                                     01617000
         DC    CL1' '                                                   01618000
         DC    CL24'ABSOLUTE VALUE TOO GREAT'                           01619000
         DC    CL1' '                                                   01620000
         DC    CL1' '                                                   01621000
         DC    X'D9'                         !!! SOURCE COMPARE FIX !!! 01624000
M0212    DC    0H'0'                                            DSKC125 01624000
         DC    AL1(0)                                                   01626000
         DC    AL1(0)                                                   01627000
         DC    AL1(0)                                                   01628000
         DC    AL1(0)                                                   01629000
         DC    AL1(0)                                                   01630000
         DC    AL1(0)                                                   01631000
         DC    H'39'                                                    01632000
         DC    H'0'                                                     01633000
         DC    CL1' '                                                   01634000
         DC    CL24'DATA FORMAT IS INCORRECT'                           01635000
         DC    CL1' '                                                   01636000
         DC    CL1' '                                                   01637000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 01640000
M0213    DC    0H'0'                                            DSKC125 01640000
         DC    AL1(0)                                                   01642000
         DC    AL1(0)                                                   01643000
         DC    AL1(0)                                                   01644000
         DC    AL1(0)                                                   01645000
         DC    AL1(0)                                                   01646000
         DC    AL1(0)                                                   01647000
         DC    H'52'                                                    01648000
         DC    H'0'                                                     01649000
         DC    CL1' '                                                   01650000
         DC    CL37'DATA LENGTH EXCEEDS REGISTER CAPACITY'              01651000
         DC    CL1' '                                                   01652000
         DC    CL1' '                                                   01653000
M0214    DC    0H'0'                                            DSKC125 01655000
         DC    AL1(0)                                                   01657000
         DC    AL1(0)                                                   01658000
         DC    AL1(0)                                                   01659000
         DC    AL1(0)                                                   01660000
         DC    AL1(0)                                                   01661000
         DC    AL1(0)                                                   01662000
         DC    H'62'                                                    01663000
         DC    H'0'                                                     01664000
         DC    CL1' '                                                   01665000
         DC    CL47'VALID DATA TYPES ARE X OR E FOR REGISTER TYPE E'    01666000
         DC    CL1' '                                                   01667000
         DC    CL1' '                                                   01668000
M0215    DC    0H'0'                                            DSKC125 01670000
         DC    AL1(0)                                                   01672000
         DC    AL1(0)                                                   01673000
         DC    AL1(0)                                                   01674000
         DC    AL1(0)                                                   01675000
         DC    AL1(0)                                                   01676000
         DC    AL1(0)                                                   01677000
         DC    H'62'                                                    01678000
         DC    H'0'                                                     01679000
         DC    CL1' '                                                   01680000
         DC    CL47'VALID DATA TYPES ARE X OR D FOR REGISTER TYPE D'    01681000
         DC    CL1' '                                                   01682000
         DC    CL1' '                                                   01683000
M0216    DC    0H'0'                                            DSKC125 01685000
         DC    AL1(0)                                                   01687000
         DC    AL1(0)                                                   01688000
         DC    AL1(0)                                                   01689000
         DC    AL1(0)                                                   01690000
         DC    AL1(0)                                                   01691000
         DC    AL1(0)                                                   01692000
         DC    H'76'                                                    01693000
         DC    H'0'                                                     01694000
         DC    CL1' '                                                   01695000
         DC    CL61'BREAKPOINTS WERE DEACTIVATED, TO ACTIVATE, USE THE C01696000
               AT COMMAND'                                              01697000
         DC    CL1' '                                                   01698000
         DC    CL1' '                                                   01699000
M0217    DC    0H'0'                                            DSKC125 01701000
         DC    AL1(0)                                                   01703000
         DC    AL1(0)                                                   01704000
         DC    AL1(0)                                                   01705000
         DC    AL1(0)                                                   01706000
         DC    AL1(0)                                                   01707000
         DC    AL1(0)                                                   01708000
         DC    H'101'                                                   01709000
         DC    H'0'                                                     01710000
         DC    CL1' '                                                   01711000
         DC    CL86'NEITHER SYMBOLS NOR BREAKPOINTS ARE AVAILABLE FOR TC01712000
               HE PRIVILEGED MODULE BEING ACCESSED'                     01713000
         DC    CL1' '                                                   01714000
         DC    CL1' '                                                   01715000
         DC    X'C1'                         !!! SOURCE COMPARE FIX !!! 01718000
M0218    DC    0H'0'                                            DSKC125 01718000
         DC    AL1(0)                                                   01720000
         DC    AL1(0)                                                   01721000
         DC    AL1(0)                                                   01722000
         DC    AL1(0)                                                   01723000
         DC    AL1(0)                                                   01724000
         DC    AL1(0)                                                   01725000
         DC    H'53'                                                    01726000
         DC    H'0'                                                     01727000
         DC    CL1' '                                                   01728000
         DC    CL38'SPECIFIED ADDRESS IS IN PROTECTED CORE'             01729000
         DC    CL1' '                                                   01730000
         DC    CL1' '                                                   01731000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 01734000
M0219    DC    0H'0'                                            DSKC125 01734000
         DC    AL1(0)                                                   01736000
         DC    AL1(0)                                                   01737000
         DC    AL1(0)                                                   01738000
         DC    AL1(0)                                                   01739000
         DC    AL1(0)                                                   01740000
         DC    AL1(0)                                                   01741000
         DC    H'65'                                                    01742000
         DC    H'0'                                                     01743000
         DC    CL1' '                                                   01744000
         DC    CL50'REGISTER TYPE OF SECOND ADDRESS DIFFERS FROM FIRST' 01745000
         DC    CL1' '                                                   01746000
         DC    CL1' '                                                   01747000
         DC    X'C1'                         !!! SOURCE COMPARE FIX !!! 01750000
M0220    DC    0H'0'                                            DSKC125 01750000
         DC    AL1(0)                                                   01752000
         DC    AL1(0)                                                   01753000
         DC    AL1(0)                                                   01754000
         DC    AL1(0)                                                   01755000
         DC    AL1(0)                                                   01756000
         DC    AL1(0)                                                   01757000
         DC    H'67'                                                    01758000
         DC    H'0'                                                     01759000
         DC    CL1' '                                                   01760000
         DC    CL52'RANGE CONTAINS BOTH A STORAGE AND A REGISTER ADDRESC01761000
               S'                                                       01762000
         DC    CL1' '                                                   01763000
         DC    CL1' '                                                   01764000
         DC    X'F3'                         !!! SOURCE COMPARE FIX !!! 01767000
M0221    DC    0H'0'                                            DSKC125 01767000
         DC    AL1(0)                                                   01769000
         DC    AL1(0)                                                   01770000
         DC    AL1(0)                                                   01771000
         DC    AL1(0)                                                   01772000
         DC    AL1(0)                                                   01773000
         DC    AL1(0)                                                   01774000
         DC    H'76'                                                    01775000
         DC    H'0'                                                     01776000
         DC    CL1' '                                                   01777000
         DC    CL61'ADDRESS TYPE IS STORAGE AND SECOND ADDRESS IS LESS C01778000
               THAN FIRST'                                              01779000
         DC    CL1' '                                                   01780000
         DC    CL1' '                                                   01781000
M0222    DC    0H'0'                                            DSKC125 01783000
         DC    AL1(10)                                                  01785000
         DC    AL1(0)                                                   01786000
         DC    AL1(0)                                                   01787000
         DC    AL1(0)                                                   01788000
         DC    AL1(0)                                                   01789000
         DC    AL1(0)                                                   01790000
         DC    H'49'                                                    01791000
         DC    H'0'                                                     01792000
         DC    CL1' '                                                   01793000
         DC    CL34'NOT FOUND RELATED TO SPECIFIED TCB'                 01794000
         DC    CL1' '                                                   01795000
         DC    CL1' '                                                   01796000
         DC    X'C5'                         !!! SOURCE COMPARE FIX !!! 01799000
M0223    DC    0H'0'                                            DSKC125 01799000
         DC    AL1(0)                                                   01801000
         DC    AL1(0)                                                   01802000
         DC    AL1(0)                                                   01803000
         DC    AL1(0)                                                   01804000
         DC    AL1(0)                                                   01805000
         DC    AL1(0)                                                   01806000
         DC    H'55'                                                    01807000
         DC    H'0'                                                     01808000
         DC    CL1' '                                                   01809000
         DC    CL40'INPUT NOT RESOLVED AS LOADNAME.CSECTNAME'           01810000
         DC    CL1' '                                                   01811000
         DC    CL1' '                                                   01812000
         DC    X'D4'                         !!! SOURCE COMPARE FIX !!! 01815000
M0224    DC    0H'0'                                            DSKC125 01815000
         DC    AL1(0)                                                   01817000
         DC    AL1(0)                                                   01818000
         DC    AL1(0)                                                   01819000
         DC    AL1(0)                                                   01820000
         DC    AL1(0)                                                   01821000
         DC    AL1(0)                                                   01822000
         DC    H'55'                                                    01823000
         DC    H'0'                                                     01824000
         DC    CL1' '                                                   01825000
         DC    CL40'INPUT NOT RESOLVED AS LOADNAME OR SYMBOL'           01826000
         DC    CL1' '                                                   01827000
         DC    CL1' '                                                   01828000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 01831000
M0225    DC    0H'0'                                            DSKC125 01831000
         DC    AL1(0)                                                   01833000
         DC    AL1(0)                                                   01834000
         DC    AL1(0)                                                   01835000
         DC    AL1(0)                                                   01836000
         DC    AL1(0)                                                   01837000
         DC    AL1(0)                                                   01838000
         DC    H'55'                                                    01839000
         DC    H'0'                                                     01840000
         DC    CL1' '                                                   01841000
         DC    CL40'ATTEMPT QUALIFICATION AT NEXT BREAKPOINT'           01842000
         DC    CL1' '                                                   01843000
         DC    CL1' '                                                   01844000
         DC    X'D6'                         !!! SOURCE COMPARE FIX !!! 01847000
M0226    DC    0H'0'                                            DSKC125 01847000
         DC    AL1(0)                                                   01849000
         DC    AL1(0)                                                   01850000
         DC    AL1(0)                                                   01851000
         DC    AL1(0)                                                   01852000
         DC    AL1(0)                                                   01853000
         DC    AL1(0)                                                   01854000
         DC    H'49'                                                    01855000
         DC    H'0'                                                     01856000
         DC    CL1' '                                                   01857000
         DC    CL34'NO TCB EXISTS AT SPECIFIED ADDRESS'                 01858000
         DC    CL1' '                                                   01859000
         DC    CL1' '                                                   01860000
         DC    X'F4'                         !!! SOURCE COMPARE FIX !!! 01863000
M0227    DC    0H'0'                                            DSKC125 01863000
         DC    AL1(0)                                                   01865000
         DC    AL1(0)                                                   01866000
         DC    AL1(0)                                                   01867000
         DC    AL1(0)                                                   01868000
         DC    AL1(0)                                                   01869000
         DC    AL1(0)                                                   01870000
         DC    H'64'                                                    01871000
         DC    H'0'                                                     01872000
         DC    CL1' '                                                   01873000
         DC    CL49'TCB KEYWORD IS IGNORED WHEN QUALIFYING AN ADDRESS'  01874000
         DC    CL1' '                                                   01875000
         DC    CL1' '                                                   01876000
M0228    DC    0H'0'                                            DSKC125 01878000
         DC    AL1(23)                                                  01880000
         DC    AL1(0)                                                   01881000
         DC    AL1(0)                                                   01882000
         DC    AL1(0)                                                   01883000
         DC    AL1(0)                                                   01884000
         DC    AL1(0)                                                   01885000
         DC    H'77'                                                    01886000
         DC    H'0'                                                     01887000
         DC    CL1' '                                                   01888000
         DC    CL12'NOT FOUND IN'                                       01889000
         DC    CL1' '                                                   01890000
         DC    CL49'UNDER THE TEST TASK STRUCTURE SYMBOLS UNAVAILABLE'  01891000
         DC    CL1' '                                                   01892000
         DC    CL1' '                                                   01893000
M0229    DC    0H'0'                                            DSKC125 01896000
         DC    AL1(10)                                                  01898000
         DC    AL1(0)                                                   01899000
         DC    AL1(0)                                                   01900000
         DC    AL1(0)                                                   01901000
         DC    AL1(0)                                                   01902000
         DC    AL1(0)                                                   01903000
         DC    H'64'                                                    01904000
         DC    H'0'                                                     01905000
         DC    CL1' '                                                   01906000
         DC    CL49'LOADED BY OS LOADER, INTERNAL SYMBOLS UNAVAILABLE'  01907000
         DC    CL1' '                                                   01908000
         DC    CL1' '                                                   01909000
M0230    DC    0H'0'                                            DSKC125 01911000
         DC    AL1(10)                                                  01913000
         DC    AL1(0)                                                   01914000
         DC    AL1(0)                                                   01915000
         DC    AL1(0)                                                   01916000
         DC    AL1(0)                                                   01917000
         DC    AL1(0)                                                   01918000
         DC    H'76'                                                    01919000
         DC    H'0'                                                     01920000
         DC    CL1' '                                                   01921000
         DC    CL61'NOT BROUGHT INTO MAIN STORAGE UNDER TEST, SYMBOLS UC01922000
               NAVAILABLE'                                              01923000
         DC    CL1' '                                                   01924000
         DC    CL1' '                                                   01925000
M0231    DC    0H'0'                                            DSKC125 01927000
         DC    AL1(10)                                                  01929000
         DC    AL1(0)                                                   01930000
         DC    AL1(0)                                                   01931000
         DC    AL1(0)                                                   01932000
         DC    AL1(0)                                                   01933000
         DC    AL1(0)                                                   01934000
         DC    H'80'                                                    01935000
         DC    H'0'                                                     01936000
         DC    CL1' '                                                   01937000
         DC    CL65'LOADED BY OS LOADER, NOT ENOUGH MAIN STORAGE FOR EXC01938000
               TERNAL SYMBOLS'                                          01939000
         DC    CL1' '                                                   01940000
         DC    CL1' '                                                   01941000
M0232    DC    0H'0'                                            DSKC125 01943000
         DC    AL1(10)                                                  01945000
         DC    AL1(0)                                                   01946000
         DC    AL1(0)                                                   01947000
         DC    AL1(0)                                                   01948000
         DC    AL1(0)                                                   01949000
         DC    AL1(0)                                                   01950000
         DC    H'79'                                                    01951000
         DC    H'0'                                                     01952000
         DC    CL1' '                                                   01953000
         DC    CL64'LINK EDITED WITHOUT TEST PARAMETER, INTERNAL SYMBOLC01954000
               S UNAVAILABLE'                                           01955000
         DC    CL1' '                                                   01956000
         DC    CL1' '                                                   01957000
         DC    X'05'                         !!! SOURCE COMPARE FIX !!! 01960000
M0233    DC    0H'0'                                            DSKC125 01960000
         DC    AL1(10)                                                  01962000
         DC    AL1(43)                                                  01963000
         DC    AL1(44)                                                  01964000
         DC    AL1(0)                                                   01965000
         DC    AL1(0)                                                   01966000
         DC    AL1(0)                                                   01967000
         DC    H'49'                                                    01968000
         DC    H'0'                                                     01969000
         DC    CL1' '                                                   01970000
         DC    CL32'NOT IN INTERNAL SYMBOL TABLE FOR'                   01971000
         DC    CL1' '                                                   01972000
         DC    CL1' '                                                   01973000
         DC    CL1' '                                                   01974000
         DC    CL1' '                                                   01975000
M0234    DC    0H'0'                                            DSKC125 01978000
         DC    AL1(10)                                                  01980000
         DC    AL1(33)                                                  01981000
         DC    AL1(0)                                                   01982000
         DC    AL1(0)                                                   01983000
         DC    AL1(0)                                                   01984000
         DC    AL1(0)                                                   01985000
         DC    H'57'                                                    01986000
         DC    H'0'                                                     01987000
         DC    CL1' '                                                   01988000
         DC    CL22'LINK EDITED IN OVERLAY'                             01989000
         DC    CL1' '                                                   01990000
         DC    CL19'NOT IN MAIN STORAGE'                                01991000
         DC    CL1' '                                                   01992000
         DC    CL1' '                                                   01993000
         DC    X'E2'                         !!! SOURCE COMPARE FIX !!! 01996000
M0235    DC    0H'0'                                            DSKC125 01996000
         DC    AL1(10)                                                  01998000
         DC    AL1(0)                                                   01999000
         DC    AL1(0)                                                   02000000
         DC    AL1(0)                                                   02001000
         DC    AL1(0)                                                   02002000
         DC    AL1(0)                                                   02003000
         DC    H'78'                                                    02004000
         DC    H'0'                                                     02005000
         DC    CL1' '                                                   02006000
         DC    CL63'ASSEMBLED WITHOUT TEST PARAMETERS, INTERNAL SYMBOLSC02007000
                UNAVAILABLE'                                            02008000
         DC    CL1' '                                                   02009000
         DC    CL1' '                                                   02010000
M0236    DC    0H'0'                                            DSKC125 02010010
         DC    AL1(36)                                          DSKC125 02010020
         DC    AL1(0)                                           DSKC125 02010030
         DC    AL1(0)                                           DSKC125 02010040
         DC    AL1(0)                                           DSKC125 02010050
         DC    AL1(0)                                           DSKC125 02010060
         DC    AL1(0)                                           DSKC125 02010070
         DC    H'60'                                            DSKC125 02010080
         DC    H'0'                                             DSKC125 02010090
         DC    C' '                                             DSKC125 02010100
         DC    C'FROM SYS1.LINKLIB DATASET SYMBOLS UNAVAILABLE' DSKC125 02010110
         DC    C' '                                             DSKC125 02010120
         DC    C' '                                             DSKC125 02010130
M0237    DC    0H'0'                                            DSKC125 02010140
         DC    AL1(0)                                           DSKC125 02010150
         DC    AL1(0)                                           DSKC125 02010160
         DC    AL1(0)                                           DSKC125 02010170
         DC    AL1(0)                                           DSKC125 02010180
         DC    AL1(0)                                           DSKC125 02010190
         DC    AL1(0)                                           DSKC125 02010200
         DC    H'30'                                            DSKC125 02010210
         DC    H'0'                                             DSKC125 02010220
         DC    C' '                                             DSKC125 02010230
         DC    C'I/O SYNAD ERROR'                               DSKC125 02010240
         DC    C' '                                             DSKC125 02010250
         DC    C' '                                             DSKC125 02010260
M0238    DC    0H'0'                                            DSKC125 02010270
         DC    AL1(30)                                          DSKC125 02010280
         DC    AL1(37)                                          DSKC125 02010290
         DC    AL1(0)                                           DSKC125 02010300
         DC    AL1(0)                                           DSKC125 02010310
         DC    AL1(0)                                           DSKC125 02010320
         DC    AL1(0)                                           DSKC125 02010330
         DC    H'42'                                            DSKC125 02010340
         DC    H'0'                                             DSKC125 02010350
         DC    C' '                                             DSKC125 02010360
         DC    C'CANNOT OPEN DATASET DDNAME'                    DSKC125 02010370
         DC    C' '                                             DSKC125 02010380
         DC    C' '                                             DSKC125 02010390
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 02010400
M0239    DC    0H'0'                                            DSKC125 02010400
         DC    AL1(0)                                           DSKC125 02010410
         DC    AL1(0)                                           DSKC125 02010420
         DC    AL1(0)                                           DSKC125 02010430
         DC    AL1(0)                                           DSKC125 02010440
         DC    AL1(0)                                           DSKC125 02010450
         DC    AL1(0)                                           DSKC125 02010460
         DC    H'55'                                            DSKC125 02010470
         DC    H'0'                                             DSKC125 02010480
         DC    C' '                                             DSKC125 02010490
         DC    C'ABSOLUTE OR RELATIVE ADDRESS MAY BE USED'      DSKC125 02010500
         DC    C' '                                             DSKC125 02010510
         DC    C' '                                             DSKC125 02010520
         DC    X'D5'                         !!! SOURCE COMPARE FIX !!! 02012000
M0240    DC    0H'0'                                            DSKC125 02012000
         DC    AL1(34)                                                  02014000
         DC    AL1(37)                                                  02015000
         DC    AL1(0)                                                   02016000
         DC    AL1(0)                                                   02017000
         DC    AL1(0)                                                   02018000
         DC    AL1(0)                                                   02019000
         DC    H'42'                                                    02020000
         DC    H'0'                                                     02021000
         DC    CL1' '                                                   02022000
         DC    CL23'MINIMUM LENGTH FOR TYPE'                            02023000
         DC    CL1' '                                                   02024000
         DC    CL2'IS'                                                  02025000
         DC    CL1' '                                                   02026000
         DC    CL1' '                                                   02027000
         DC    CL1' '                                                   02028000
M0241    DC    0H'0'                                            DSKC125 02030000
         DC    AL1(34)                                                  02032000
         DC    AL1(37)                                                  02033000
         DC    AL1(0)                                                   02034000
         DC    AL1(0)                                                   02035000
         DC    AL1(0)                                                   02036000
         DC    AL1(0)                                                   02037000
         DC    H'42'                                                    02038000
         DC    H'0'                                                     02039000
         DC    CL1' '                                                   02040000
         DC    CL23'MAXIMUM LENGTH FOR TYPE'                            02041000
         DC    CL1' '                                                   02042000
         DC    CL2'IS'                                                  02043000
         DC    CL1' '                                                   02044000
         DC    CL1' '                                                   02045000
         DC    CL1' '                                                   02046000
M0242    DC    0H'0'                                            DSKC125 02048000
         DC    AL1(0)                                                   02050000
         DC    AL1(0)                                                   02051000
         DC    AL1(0)                                                   02052000
         DC    AL1(0)                                                   02053000
         DC    AL1(0)                                                   02054000
         DC    AL1(0)                                                   02055000
         DC    H'47'                                                    02056000
         DC    H'0'                                                     02057000
         DC    CL1' '                                                   02058000
         DC    CL32'PART OF RANGE IS WRITE PROTECTED'                   02059000
         DC    CL1' '                                                   02060000
         DC    CL1' '                                                   02061000
         DC    X'D5'                         !!! SOURCE COMPARE FIX !!! 02064000
M0243    DC    0H'0'                                            DSKC125 02064000
         DC    AL1(0)                                                   02066000
         DC    AL1(0)                                                   02067000
         DC    AL1(0)                                                   02068000
         DC    AL1(0)                                                   02069000
         DC    AL1(0)                                                   02070000
         DC    AL1(0)                                                   02071000
         DC    H'60'                                                    02072000
         DC    H'0'                                                     02073000
         DC    CL1' '                                                   02074000
         DC    CL45'COMMAND CHAIN LENGTH MAY NOT EXCEED 255 BYTES'      02075000
         DC    CL1' '                                                   02076000
         DC    CL1' '                                                   02077000
M0244    DC    0H'0'                                            DSKC125 02079000
         DC    AL1(0)                                                   02081000
         DC    AL1(0)                                                   02082000
         DC    AL1(0)                                                   02083000
         DC    AL1(0)                                                   02084000
         DC    AL1(0)                                                   02085000
         DC    AL1(0)                                                   02086000
         DC    H'30'                                                    02087000
         DC    H'0'                                                     02088000
         DC    CL1' '                                                   02089000
         DC    CL15'INVALID OP CODE'                                    02090000
         DC    CL1' '                                                   02091000
         DC    CL1' '                                                   02092000
M0245    DC    0H'0'                                            DSKC125 02094000
         DC    AL1(0)                                                   02096000
         DC    AL1(0)                                                   02097000
         DC    AL1(0)                                                   02098000
         DC    AL1(0)                                                   02099000
         DC    AL1(0)                                                   02100000
         DC    AL1(0)                                                   02101000
         DC    H'52'                                                    02102000
         DC    H'0'                                                     02103000
         DC    CL1' '                                                   02104000
         DC    CL37'FULLY QUALIFIED ADDRESS MUST BE GIVEN'              02105000
         DC    CL1' '                                                   02106000
         DC    CL1' '                                                   02107000
M0246    DC    0H'0'                                            DSKC125 02109000
         DC    AL1(0)                                                   02111000
         DC    AL1(0)                                                   02112000
         DC    AL1(0)                                                   02113000
         DC    AL1(0)                                                   02114000
         DC    AL1(0)                                                   02115000
         DC    AL1(0)                                                   02116000
         DC    H'65'                                                    02117000
         DC    H'0'                                                     02118000
         DC    CL1' '                                                   02119000
         DC    CL50'ALL LOADNAMES FOR A DEFER REQUEST MUST BE THE SAVE' 02120000
         DC    CL1' '                                                   02121000
         DC    CL1' '                                                   02122000
M0247    DC    0H'0'                                            DSKC125 02125000
         DC    AL1(0)                                                   02127000
         DC    AL1(0)                                                   02128000
         DC    AL1(0)                                                   02129000
         DC    AL1(0)                                                   02130000
         DC    AL1(0)                                                   02131000
         DC    AL1(0)                                                   02132000
         DC    H'44'                                                    02133000
         DC    H'0'                                                     02134000
         DC    CL1' '                                                   02135000
         DC    CL29'DEBNMEXT FIELD IN DEB IS ZERO'                      02136000
         DC    CL1' '                                                   02137000
         DC    CL1' '                                                   02138000
M0248    DC    0H'0'                                            DSKC125 02140000
         DC    AL1(0)                                                   02142000
         DC    AL1(0)                                                   02143000
         DC    AL1(0)                                                   02144000
         DC    AL1(0)                                                   02145000
         DC    AL1(0)                                                   02146000
         DC    AL1(0)                                                   02147000
         DC    H'80'                                                    02148000
         DC    H'0'                                                     02149000
         DC    CL1' '                                                   02150000
         DC    CL65'DATASET ASSOCIATED WITH DEB NOT ON A DIRECT ACCESS C02151000
               STORAGE DEVICE'                                          02152000
         DC    CL1' '                                                   02153000
         DC    CL1' '                                                   02154000
M0249    DC    0H'0'                                            DSKC125 02156000
         DC    AL1(0)                                                   02158000
         DC    AL1(0)                                                   02159000
         DC    AL1(0)                                                   02160000
         DC    AL1(0)                                                   02161000
         DC    AL1(0)                                                   02162000
         DC    AL1(0)                                                   02163000
         DC    H'25'                                                    02164000
         DC    H'0'                                                     02165000
         DC    CL1' '                                                   02166000
         DC    CL10'OPEN ERROR'                                         02167000
         DC    CL1' '                                                   02168000
         DC    CL1' '                                                   02169000
         DC    X'D4'                         !!! SOURCE COMPARE FIX !!! 02172000
M0250    DC    0H'0'                                            DSKC125 02172000
         DC    AL1(0)                                                   02174000
         DC    AL1(0)                                                   02175000
         DC    AL1(0)                                                   02176000
         DC    AL1(0)                                                   02177000
         DC    AL1(0)                                                   02178000
         DC    AL1(0)                                                   02179000
         DC    H'32'                                                    02180000
         DC    H'0'                                                     02181000
         DC    CL1' '                                                   02182000
         DC    CL17'BLDL ERROR CODE 4'                                  02183000
         DC    CL1' '                                                   02184000
         DC    CL1' '                                                   02185000
M0251    DC    0H'0'                                            DSKC125 02187000
         DC    AL1(0)                                                   02189000
         DC    AL1(0)                                                   02190000
         DC    AL1(0)                                                   02191000
         DC    AL1(0)                                                   02192000
         DC    AL1(0)                                                   02193000
         DC    AL1(0)                                                   02194000
         DC    H'39'                                                    02195000
         DC    H'0'                                                     02196000
         DC    CL1' '                                                   02197000
         DC    CL24'PROGRAM NOT ON LOAD LIST'                           02198000
         DC    CL1' '                                                   02199000
         DC    CL1' '                                                   02200000
         DC    X'E4'                         !!! SOURCE COMPARE FIX !!! 02203000
M0252    DC    0H'0'                                            DSKC125 02203000
         DC    AL1(0)                                                   02205000
         DC    AL1(0)                                                   02206000
         DC    AL1(0)                                                   02207000
         DC    AL1(0)                                                   02208000
         DC    AL1(0)                                                   02209000
         DC    AL1(0)                                                   02210000
         DC    H'40'                                                    02211000
         DC    H'0'                                                     02212000
         DC    CL1' '                                                   02213000
         DC    CL25'INVALID QUALIFIED ADDRESS'                          02214000
         DC    CL1' '                                                   02215000
         DC    CL1' '                                                   02216000
M0253    DC    0H'0'                                            DSKC125 02218000
         DC    AL1(28)                                                  02220000
         DC    AL1(0)                                                   02221000
         DC    AL1(0)                                                   02222000
         DC    AL1(0)                                                   02223000
         DC    AL1(0)                                                   02224000
         DC    AL1(0)                                                   02225000
         DC    H'33'                                                    02226000
         DC    H'0'                                                     02227000
         DC    CL1' '                                                   02228000
         DC    CL17'SYSTEM ABEND CODE'                                  02229000
         DC    CL1' '                                                   02230000
         DC    CL1' '                                                   02231000
         DC    CL1' '                                                   02232000
         DC    X'D5'                         !!! SOURCE COMPARE FIX !!! 02235000
M0255    DC    0H'0'                                            DSKC125 02235000
         DC    AL1(0)                                                   02237000
         DC    AL1(0)                                                   02238000
         DC    AL1(0)                                                   02239000
         DC    AL1(0)                                                   02240000
         DC    AL1(0)                                                   02241000
         DC    AL1(0)                                                   02242000
         DC    H'57'                                                    02243000
         DC    H'0'                                                     02244000
         DC    CL1' '                                                   02245000
         DC    CL42'PRINT DATA SET MUST BE PHYSICAL SEQUENTIAL'         02246000
         DC    CL1' '                                                   02247000
         DC    CL1' '                                                   02248000
         DC    X'C5'                         !!! SOURCE COMPARE FIX !!! 02251000
M0257    DC    0H'0'                                            DSKC125 02251000
         DC    AL1(0)                                                   02253000
         DC    AL1(0)                                                   02254000
         DC    AL1(0)                                                   02255000
         DC    AL1(0)                                                   02256000
         DC    AL1(0)                                                   02257000
         DC    AL1(0)                                                   02258000
         DC    H'82'                                                    02259000
         DC    H'0'                                                     02260000
         DC    CL1' '                                                   02261000
         DC    CL67'OVERLAY PROGRAMS NOT SUPPORTED BY RUN SUBCOMMAND, UC02262000
               SE GO SUBCOMMAND'                                        02263000
         DC    CL1' '                                                   02264000
         DC    CL1' '                                                   02265000
M0258    DC    0H'0'                                            DSKC125 02267000
         DC    AL1(0)                                                   02269000
         DC    AL1(0)                                                   02270000
         DC    AL1(0)                                                   02271000
         DC    AL1(0)                                                   02272000
         DC    AL1(0)                                                   02273000
         DC    AL1(0)                                                   02274000
         DC    H'46'                                                    02275000
         DC    H'0'                                                     02276000
         DC    CL1' '                                                   02277000
         DC    CL31'UNABLE TO CONTINUE TEST SESSION'                    02278000
         DC    CL1' '                                                   02279000
         DC    CL1' '                                                   02280000
M0259    DC    0H'0'                                            DSKC125 02282000
         DC    AL1(13)                                                  02284000
         DC    AL1(16)                                                  02285000
         DC    AL1(35)                                                  02286000
         DC    AL1(41)                                                  02287000
         DC    AL1(54)                                                  02288000
         DC    AL1(55)                                                  02289000
         DC    H'60'                                                    02290000
         DC    H'0'                                                     02291000
         DC    CL1' '                                                   02292000
         DC    CL2'IN'                                                  02293000
         DC    CL1' '                                                   02294000
         DC    CL2'AT'                                                  02295000
         DC    CL1' '                                                   02296000
         DC    CL18'ABEND CODE SYSTEM='                                 02297000
         DC    CL1' '                                                   02298000
         DC    CL5', IC='                                               02299000
         DC    CL1' '                                                   02300000
         DC    CL12'INSTR IMAGE='                                       02301000
         DC    CL1' '                                                   02302000
         DC    CL1' '                                                   02303000
         DC    CL1' '                                                   02304000
         DC    X'F8'                         !!! SOURCE COMPARE FIX !!! 02307000
M0260    DC    0H'0'                                            DSKC125 02307000
         DC    AL1(0)                                                   02309000
         DC    AL1(0)                                                   02310000
         DC    AL1(0)                                                   02311000
         DC    AL1(0)                                                   02312000
         DC    AL1(0)                                                   02313000
         DC    AL1(0)                                                   02314000
         DC    H'35'                                                    02315000
         DC    H'0'                                                     02316000
         DC    CL1' '                                                   02317000
         DC    CL20'INSUFFICIENT STORAGE'                               02318000
         DC    CL1' '                                                   02319000
         DC    CL1' '                                                   02320000
         DC    X'C2'                         !!! SOURCE COMPARE FIX !!! 02323000
M0266    DC    0H'0'                                            DSKC125 02323000
         DC    AL1(0)                                                   02325000
         DC    AL1(0)                                                   02326000
         DC    AL1(0)                                                   02327000
         DC    AL1(0)                                                   02328000
         DC    AL1(0)                                                   02329000
         DC    AL1(0)                                                   02330000
         DC    H'68'                                                    02331000
         DC    H'0'                                                     02332000
         DC    CL1' '                                                   02333000
         DC    CL53'LENGTH MAY NOT EXCEED 64 WHEN REGISTERS ARE SPECIFIC02334000
               ED'                                                      02335000
         DC    CL1' '                                                   02336000
         DC    CL1' '                                                   02337000
M0267    DC    0H'0'                                            DSKC125 02339000
         DC    AL1(0)                                                   02341000
         DC    AL1(0)                                                   02342000
         DC    AL1(0)                                                   02343000
         DC    AL1(0)                                                   02344000
         DC    AL1(0)                                                   02345000
         DC    AL1(0)                                                   02346000
         DC    H'57'                                                    02347000
         DC    H'0'                                                     02348000
         DC    CL1' '                                                   02349000
         DC    CL42'REGISTER NOTATION MUST BE GENERAL REGISTER'         02350000
         DC    CL1' '                                                   02351000
         DC    CL1' '                                                   02352000
         DC    X'C8'                         !!! SOURCE COMPARE FIX !!! 02355000
M0268    DC    0H'0'                                            DSKC125 02355000
         DC    AL1(0)                                                   02357000
         DC    AL1(0)                                                   02358000
         DC    AL1(0)                                                   02359000
         DC    AL1(0)                                                   02360000
         DC    AL1(0)                                                   02361000
         DC    AL1(0)                                                   02362000
         DC    H'92'                                                    02363000
         DC    H'0'                                                     02364000
         DC    CL1' '                                                   02365000
         DC    CL77'REGISTER NOTATION MUST BE INDIRECT GENERAL REGISTERC02366000
                WHEN POINTER IS SPECIFIED'                              02367000
         DC    CL1' '                                                   02368000
         DC    CL1' '                                                   02369000
M0269    DC    0H'0'                                            DSKC125 02371000
         DC    AL1(36)                                                  02373000
         DC    AL1(0)                                                   02374000
         DC    AL1(0)                                                   02375000
         DC    AL1(0)                                                   02376000
         DC    AL1(0)                                                   02377000
         DC    AL1(0)                                                   02378000
         DC    H'41'                                                    02379000
         DC    H'0'                                                     02380000
         DC    CL1' '                                                   02381000
         DC    CL25'SYSTEM COMPLETION CODE IS'                          02382000
         DC    CL1' '                                                   02383000
         DC    CL1' '                                                   02384000
         DC    CL1' '                                                   02385000
         DC    X'D5'                         !!! SOURCE COMPARE FIX !!! 02388000
M0270    DC    0H'0'                                            DSKC125 02388000
         DC    AL1(34)                                                  02390000
         DC    AL1(0)                                                   02391000
         DC    AL1(0)                                                   02392000
         DC    AL1(0)                                                   02393000
         DC    AL1(0)                                                   02394000
         DC    AL1(0)                                                   02395000
         DC    H'39'                                                    02396000
         DC    H'0'                                                     02397000
         DC    CL1' '                                                   02398000
         DC    CL23'USER COMPLETION CODE IS'                            02399000
         DC    CL1' '                                                   02400000
         DC    CL1' '                                                   02401000
         DC    CL1' '                                                   02402000
         DC    X'D6'                         !!! SOURCE COMPARE FIX !!! 02405000
M0271    DC    0H'0'                                            DSKC125 02405000
         DC    AL1(0)                                                   02407000
         DC    AL1(0)                                                   02408000
         DC    AL1(0)                                                   02409000
         DC    AL1(0)                                                   02410000
         DC    AL1(0)                                                   02411000
         DC    AL1(0)                                                   02412000
         DC    H'36'                                                    02413000
         DC    H'0'                                                     02414000
         DC    CL1' '                                                   02415000
         DC    CL21'MAXIMUM LENGTH IS 100'                              02416000
         DC    CL1' '                                                   02417000
         DC    CL1' '                                                   02418000
M0272    DC    0H'0'                                            DSKC125 02420000
         DC    AL1(0)                                                   02422000
         DC    AL1(0)                                                   02423000
         DC    AL1(0)                                                   02424000
         DC    AL1(0)                                                   02425000
         DC    AL1(0)                                                   02426000
         DC    AL1(0)                                                   02427000
         DC    H'54'                                                    02428000
         DC    H'0'                                                     02429000
         DC    CL1' '                                                   02430000
         DC    CL39'REQUEST EXCEEDED GREATEST VALID ADDRESS'            02431000
         DC    CL1' '                                                   02432000
         DC    CL1' '                                                   02433000
M0273    DC    0H'0'                                            DSKC125 02435000
         DC    AL1(0)                                                   02437000
         DC    AL1(0)                                                   02438000
         DC    AL1(0)                                                   02439000
         DC    AL1(0)                                                   02440000
         DC    AL1(0)                                                   02441000
         DC    AL1(0)                                                   02442000
         DC    H'42'                                                    02443000
         DC    H'0'                                                     02444000
         DC    CL1' '                                                   02445000
         DC    CL27'BREAKPOINT SVC ERROR CODE 4'                        02446000
         DC    CL1' '                                                   02447000
         DC    CL1' '                                                   02448000
M0274    DC    0H'0'                                            DSKC125 02450000
         DC    AL1(0)                                                   02452000
         DC    AL1(0)                                                   02453000
         DC    AL1(0)                                                   02454000
         DC    AL1(0)                                                   02455000
         DC    AL1(0)                                                   02456000
         DC    AL1(0)                                                   02457000
         DC    H'66'                                                    02458000
         DC    H'0'                                                     02459000
         DC    CL1' '                                                   02460000
         DC    CL51'REGISTER NOTATION MUST BE INDIRECT GENERAL REGISTERC02461000
               '                                                        02462000
         DC    CL1' '                                                   02463000
         DC    CL1' '                                                   02464000
M0275    DC    0H'0'                                            DSKC125 02466000
         DC    AL1(34)                                                  02468000
         DC    AL1(0)                                                   02469000
         DC    AL1(0)                                                   02470000
         DC    AL1(0)                                                   02471000
         DC    AL1(0)                                                   02472000
         DC    AL1(0)                                                   02473000
         DC    H'39'                                                    02474000
         DC    H'0'                                                     02475000
         DC    CL1' '                                                   02476000
         DC    CL23'INVALID RANGE BEGINNING'                            02477000
         DC    CL1' '                                                   02478000
         DC    CL1' '                                                   02479000
         DC    CL1' '                                                   02480000
         DC    X'C5'                         !!! SOURCE COMPARE FIX !!! 02483000
M0276    DC    0H'0'                                            DSKC125 02483000
         DC    AL1(0)                                                   02485000
         DC    AL1(0)                                                   02486000
         DC    AL1(0)                                                   02487000
         DC    AL1(0)                                                   02488000
         DC    AL1(0)                                                   02489000
         DC    AL1(0)                                                   02490000
         DC    H'61'                                                    02491000
         DC    H'0'                                                     02492000
         DC    CL1' '                                                   02493000
         DC    CL46'SYSTEM CONTROL BLOCK ERROR, TEST SESSION ENDED'     02494000
         DC    CL1' '                                                   02495000
         DC    CL1' '                                                   02496000
         DC    X'C9'                         !!! SOURCE COMPARE FIX !!! 02499000
M0277    DC    0H'0'                                            DSKC125 02499000
         DC    AL1(0)                                                   02501000
         DC    AL1(0)                                                   02502000
         DC    AL1(0)                                                   02503000
         DC    AL1(0)                                                   02504000
         DC    AL1(0)                                                   02505000
         DC    AL1(0)                                                   02506000
         DC    H'34'                                                    02507000
         DC    H'0'                                                     02508000
         DC    CL1' '                                                   02509000
         DC    CL19'PARSE ERROR CODE 12'                                02510000
         DC    CL1' '                                                   02511000
         DC    CL1' '                                                   02512000
M0278    DC    0H'0'                                            DSKC125 02514000
         DC    AL1(0)                                                   02516000
         DC    AL1(0)                                                   02517000
         DC    AL1(0)                                                   02518000
         DC    AL1(0)                                                   02519000
         DC    AL1(0)                                                   02520000
         DC    AL1(0)                                                   02521000
         DC    H'47'                                                    02522000
         DC    H'0'                                                     02523000
         DC    CL1' '                                                   02524000
         DC    CL32'THE VALID RANGE IS FROM 1 TO 256'                   02525000
         DC    CL1' '                                                   02526000
         DC    CL1' '                                                   02527000
         DC    X'C9'                         !!! SOURCE COMPARE FIX !!! 02530000
M0279    DC    0H'0'                                            DSKC125 02530000
         DC    AL1(0)                                                   02532000
         DC    AL1(0)                                                   02533000
         DC    AL1(0)                                                   02534000
         DC    AL1(0)                                                   02535000
         DC    AL1(0)                                                   02536000
         DC    AL1(0)                                                   02537000
         DC    H'49'                                                    02538000
         DC    H'0'                                                     02539000
         DC    CL1' '                                                   02540000
         DC    CL34'ADDRESS IN WRITE PROTECTED STORAGE'                 02541000
         DC    CL1' '                                                   02542000
         DC    CL1' '                                                   02543000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 02546000
M0280    DC    0H'0'                                            DSKC125 02546000
         DC    AL1(10)                                                  02548000
         DC    AL1(0)                                                   02549000
         DC    AL1(0)                                                   02550000
         DC    AL1(0)                                                   02551000
         DC    AL1(0)                                                   02552000
         DC    AL1(0)                                                   02553000
         DC    H'32'                                                    02554000
         DC    H'0'                                                     02555000
         DC    CL1' '                                                   02556000
         DC    CL17'BOUNDARY REQUIRED'                                  02557000
         DC    CL1' '                                                   02558000
         DC    CL1' '                                                   02559000
M0281    DC    0H'0'                                            DSKC125 02561000
         DC    AL1(0)                                                   02563000
         DC    AL1(0)                                                   02564000
         DC    AL1(0)                                                   02565000
         DC    AL1(0)                                                   02566000
         DC    AL1(0)                                                   02567000
         DC    AL1(0)                                                   02568000
         DC    H'53'                                                    02569000
         DC    H'0'                                                     02570000
         DC    CL1' '                                                   02571000
         DC    CL38'SYMBOL LENGTH EXCEEDS EIGHT CHARACTERS'             02572000
         DC    CL1' '                                                   02573000
         DC    CL1' '                                                   02574000
         DC    X'E3'                         !!! SOURCE COMPARE FIX !!! 02577000
M0283    DC    0H'0'                                            DSKC125 02577000
         DC    AL1(0)                                                   02579000
         DC    AL1(0)                                                   02580000
         DC    AL1(0)                                                   02581000
         DC    AL1(0)                                                   02582000
         DC    AL1(0)                                                   02583000
         DC    AL1(0)                                                   02584000
         DC    H'42'                                                    02585000
         DC    H'0'                                                     02586000
         DC    CL1' '                                                   02587000
         DC    CL27'SVC 97 RETURN CODE NON-ZERO'                        02588000
         DC    CL1' '                                                   02589000
         DC    CL1' '                                                   02590000
M0284    DC    0H'0'                                            DSKC125 02592000
         DC    AL1(0)                                                   02594000
         DC    AL1(0)                                                   02595000
         DC    AL1(0)                                                   02596000
         DC    AL1(0)                                                   02597000
         DC    AL1(0)                                                   02598000
         DC    AL1(0)                                                   02599000
         DC    H'49'                                                    02600000
         DC    H'0'                                                     02601000
         DC    CL1' '                                                   02602000
         DC    CL34'LENGTH MUST BE BETWEEN 0 AND 65535'                 02603000
         DC    CL1' '                                                   02604000
         DC    CL1' '                                                   02605000
         DC    X'D5'                         !!! SOURCE COMPARE FIX !!! 02608000
M0285    DC    0H'0'                                            DSKC125 02608000
         DC    AL1(0)                                                   02610000
         DC    AL1(0)                                                   02611000
         DC    AL1(0)                                                   02612000
         DC    AL1(0)                                                   02613000
         DC    AL1(0)                                                   02614000
         DC    AL1(0)                                                   02615000
         DC    H'68'                                                    02616000
         DC    H'0'                                                     02617000
         DC    CL1' '                                                   02618000
         DC    CL53'SVC 97 PASSED A RETURN CODE OF 8 AFTER VALIDITY CHEC02619000
               CK'                                                      02620000
         DC    CL1' '                                                   02621000
         DC    CL1' '                                                   02622000
M0287    DC    0H'0'                                            DSKC125 02624000
         DC    AL1(0)                                                   02626000
         DC    AL1(0)                                                   02627000
         DC    AL1(0)                                                   02628000
         DC    AL1(0)                                                   02629000
         DC    AL1(0)                                                   02630000
         DC    AL1(0)                                                   02631000
         DC    H'68'                                                    02632000
         DC    H'0'                                                     02633000
         DC    CL1' '                                                   02634000
         DC    CL53'TEST SESSION CANCELLED DUE TO UNRECOVERABLE SVC ERRC02635000
               OR'                                                      02636000
         DC    CL1' '                                                   02637000
         DC    CL1' '                                                   02638000
M0294    DC    0H'0'                                            DSKC125 02640000
         DC    AL1(10)                                                  02642000
         DC    AL1(19)                                                  02643000
         DC    AL1(0)                                                   02644000
         DC    AL1(0)                                                   02645000
         DC    AL1(0)                                                   02646000
         DC    AL1(0)                                                   02647000
         DC    H'62'                                                    02648000
         DC    H'0'                                                     02649000
         DC    CL1' '                                                   02650000
         DC    CL8'FOUND IN'                                            02651000
         DC    CL1' '                                                   02652000
         DC    CL38'DSECT FOR WHICH NO BASE ADDRESS EXISTS'             02653000
         DC    CL1' '                                                   02654000
         DC    CL1' '                                                   02655000
M0295    DC    0H'0'                                            DSKC125 02657000
         DC    AL1(10)                                                  02659000
         DC    AL1(49)                                                  02660000
         DC    AL1(0)                                                   02661000
         DC    AL1(0)                                                   02662000
         DC    AL1(0)                                                   02663000
         DC    AL1(0)                                                   02664000
         DC    H'54'                                                    02665000
         DC    H'0'                                                     02666000
         DC    CL1' '                                                   02667000
         DC    CL38'NOT FOUND IN EXTERNAL SYMBOL TABLE FOR'             02668000
         DC    CL1' '                                                   02669000
         DC    CL1' '                                                   02670000
         DC    CL1' '                                                   02671000
M0296    DC    0H'0'                                            DSKC125 02673000
         DC    AL1(0)                                                   02675000
         DC    AL1(0)                                                   02676000
         DC    AL1(0)                                                   02677000
         DC    AL1(0)                                                   02678000
         DC    AL1(0)                                                   02679000
         DC    AL1(0)                                                   02680000
         DC    H'46'                                                    02681000
         DC    H'0'                                                     02682000
         DC    CL1' '                                                   02683000
         DC    CL31'LENGTH EXCEEDS EIGHT CHARACTERS'                    02684000
         DC    CL1' '                                                   02685000
         DC    CL1' '                                                   02686000
M0297    DC    0H'0'                                            DSKC125 02688000
         DC    AL1(0)                                                   02690000
         DC    AL1(0)                                                   02691000
         DC    AL1(0)                                                   02692000
         DC    AL1(0)                                                   02693000
         DC    AL1(0)                                                   02694000
         DC    AL1(0)                                                   02695000
         DC    H'32'                                                    02696000
         DC    H'0'                                                     02697000
         DC    CL1' '                                                   02698000
         DC    CL17'BLDL ERROR CODE 8'                                  02699000
         DC    CL1' '                                                   02700000
         DC    CL1' '                                                   02701000
M0298    DC    0H'0'                                            DSKC125 02703000
         DC    AL1(10)                                                  02705000
         DC    AL1(0)                                                   02706000
         DC    AL1(0)                                                   02707000
         DC    AL1(0)                                                   02708000
         DC    AL1(0)                                                   02709000
         DC    AL1(0)                                                   02710000
         DC    H'45'                                                    02711000
         DC    H'0'                                                     02712000
         DC    CL1' '                                                   02713000
         DC    CL30'EXTENDS INTO PROTECTED STORAGE'                     02714000
         DC    CL1' '                                                   02715000
         DC    CL1' '                                                   02716000
         DC    X'D4'                         !!! SOURCE COMPARE FIX !!! 02719000
M0299    DC    0H'0'                                            DSKC125 02719000
         DC    AL1(0)                                                   02721000
         DC    AL1(0)                                                   02722000
         DC    AL1(0)                                                   02723000
         DC    AL1(0)                                                   02724000
         DC    AL1(0)                                                   02725000
         DC    AL1(0)                                                   02726000
         DC    H'48'                                                    02727000
         DC    H'0'                                                     02728000
         DC    CL1' '                                                   02729000
         DC    CL33'COUNT MUST BE BETWEEN 0 AND 65535'                  02730000
         DC    CL1' '                                                   02731000
         DC    CL1' '                                                   02732000
I002     DC    0H'0'                                            DSKC125 02734000
         DC    H'13'                                                    02736000
         DC    H'0'                                                     02737000
         DC    CL8'HALFWORD'                                            02738000
         DC    CL1' '                                                   02739000
         DC    X'C6'                         !!! SOURCE COMPARE FIX !!! 02742000
I003     DC    0H'0'                                            DSKC125 02742000
         DC    H'13'                                                    02744000
         DC    H'0'                                                     02745000
         DC    CL8'FULLWORD'                                            02746000
         DC    CL1' '                                                   02747000
         DC    X'C6'                         !!! SOURCE COMPARE FIX !!! 02750000
I004     DC    0H'0'                                            DSKC125 02750000
         DC    H'15'                                                    02752000
         DC    H'0'                                                     02753000
         DC    CL10'DOUBLEWORD'                                         02754000
         DC    CL1' '                                                   02755000
         DC    X'04'                         !!! SOURCE COMPARE FIX !!! 02758000
I006     DC    0H'0'                                            DSKC125 02758000
         DC    H'15'                                                    02760000
         DC    H'0'                                                     02761000
         DC    CL10'ASSIGNMENT'                                         02762000
         DC    CL1' '                                                   02763000
         DC    X'E3'                         !!! SOURCE COMPARE FIX !!! 02766000
I007     DC    0H'0'                                            DSKC125 02766000
         DC    H'12'                                                    02768000
         DC    H'0'                                                     02769000
         DC    CL7'LISTDCB'                                             02770000
         DC    CL1' '                                                   02771000
I008     DC    0H'0'                                            DSKC125 02773000
         DC    H'12'                                                    02775000
         DC    H'0'                                                     02776000
         DC    CL7'LISTTCB'                                             02777000
         DC    CL1' '                                                   02778000
I009     DC    0H'0'                                            DSKC125 02780000
         DC    H'9'                                                     02782000
         DC    H'0'                                                     02783000
         DC    CL4'LIST'                                                02784000
         DC    CL1' '                                                   02785000
         DC    X'E3'                         !!! SOURCE COMPARE FIX !!! 02788000
I0010    DC    0H'0'                                            DSKC125 02788000
         DC    H'12'                                                    02790000
         DC    H'0'                                                     02791000
         DC    CL7'QUALIFY'                                             02792000
         DC    CL1' '                                                   02793000
I0011    DC    0H'0'                                            DSKC125 02795000
         DC    H'11'                                                    02797000
         DC    H'0'                                                     02798000
         DC    CL6'EQUATE'                                              02799000
         DC    CL1' '                                                   02800000
         DC    X'F4'                         !!! SOURCE COMPARE FIX !!! 02803000
I0012    DC    0H'0'                                            DSKC125 02803000
         DC    H'9'                                                     02805000
         DC    H'0'                                                     02806000
         DC    CL4'DROP'                                                02807000
         DC    CL1' '                                                   02808000
         DC    X'D6'                         !!! SOURCE COMPARE FIX !!! 02811000
I0013    DC    0H'0'                                            DSKC125 02811000
         DC    H'7'                                                     02813000
         DC    H'0'                                                     02814000
         DC    CL2'AT'                                                  02815000
         DC    CL1' '                                                   02816000
         DC    X'D5'                         !!! SOURCE COMPARE FIX !!! 02819000
I0014    DC    0H'0'                                            DSKC125 02819000
         DC    H'12'                                                    02821000
         DC    H'0'                                                     02822000
         DC    CL7'LISTDEB'                                             02823000
         DC    CL1' '                                                   02824000
I0015    DC    0H'0'                                            DSKC125 02826000
         DC    H'12'                                                    02828000
         DC    H'0'                                                     02829000
         DC    CL7'LISTPSW'                                             02830000
         DC    CL1' '                                                   02831000
I0016    DC    0H'0'                                            DSKC125 02833000
         DC    H'10'                                                    02835000
         DC    H'0'                                                     02836000
         DC    CL5'WHERE'                                               02837000
         DC    CL1' '                                                   02838000
I0017    DC    0H'0'                                            DSKC125 02840000
         DC    H'12'                                                    02842000
         DC    H'0'                                                     02843000
         DC    CL7'LISTMAP'                                             02844000
         DC    CL1' '                                                   02845000
I0018    DC    0H'0'                                            DSKC125 02847000
         DC    H'7'                                                     02849000
         DC    H'0'                                                     02850000
         DC    CL2'GO'                                                  02851000
         DC    CL1' '                                                   02852000
         DC    X'D6'                         !!! SOURCE COMPARE FIX !!! 02855000
I0019    DC    0H'0'                                            DSKC125 02855000
         DC    H'8'                                                     02857000
         DC    H'0'                                                     02858000
         DC    CL3'RUN'                                                 02859000
         DC    CL1' '                                                   02860000
I0020    DC    0H'0'                                            DSKC125 02862000
         DC    H'9'                                                     02864000
         DC    H'0'                                                     02865000
         DC    CL4'CALL'                                                02866000
         DC    CL1' '                                                   02867000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 02870000
I0022    DC    0H'0'                                            DSKC125 02870000
         DC    H'12'                                                    02872000
         DC    H'0'                                                     02873000
         DC    CL7'QUALIFY'                                             02874000
         DC    CL1' '                                                   02875000
I0023    DC    0H'0'                                            DSKC125 02877000
         DC    H'9'                                                     02879000
         DC    H'0'                                                     02880000
         DC    CL4'LOAD'                                                02881000
         DC    CL1' '                                                   02882000
         DC    X'C5'                         !!! SOURCE COMPARE FIX !!! 02885000
I0024    DC    0H'0'                                            DSKC125 02885000
         DC    H'11'                                                    02887000
         DC    H'0'                                                     02888000
         DC    CL6'DELETE'                                              02889000
         DC    CL1' '                                                   02890000
         DC    X'C1'                         !!! SOURCE COMPARE FIX !!! 02893000
I0025    DC    0H'0'                                            DSKC125 02893000
         DC    H'12'                                                    02895000
         DC    H'0'                                                     02896000
         DC    CL7'GETMAIN'                                             02897000
         DC    CL1' '                                                   02898000
I0026    DC    0H'0'                                            DSKC125 02900000
         DC    H'13'                                                    02902000
         DC    H'0'                                                     02903000
         DC    CL8'FREEMAIN'                                            02904000
         DC    CL1' '                                                   02905000
         DC    X'C9'                         !!! SOURCE COMPARE FIX !!! 02908000
I0027    DC    0H'0'                                            DSKC125 02908000
         DC    H'11'                                                    02910000
         DC    H'0'                                                     02911000
         DC    CL6'ATTACH'                                              02912000
         DC    CL1' '                                                   02913000
         DC    X'C9'                         !!! SOURCE COMPARE FIX !!! 02916000
I0030    DC    0H'0'                                            DSKC125 02916000
         DC    H'9'                                                     02918000
         DC    H'0'                                                     02919000
         DC    CL4'COPY'                                                02920000
         DC    CL1' '                                                   02921000
         DC    X'F6'                         !!! SOURCE COMPARE FIX !!! 02924000
I0031    DC    0H'0'                                            DSKC125 02924000
         DC    H'11'                                                    02926000
         DC    H'0'                                                     02927000
         DC    CL6'LOADER'                                              02928000
         DC    CL1' '                                                   02929000
         DC    X'C9'                         !!! SOURCE COMPARE FIX !!! 02932000
I0033    DC    0H'0'                                            DSKC125 02932000
         DC    H'18'                                                    02934000
         DC    H'0'                                                     02935000
         DC    CL13'LINK TO PARSE'                                      02936000
         DC    CL1' '                                                   02937000
I0034    DC    0H'0'                                            DSKC125 02939000
         DC    H'16'                                                    02941000
         DC    H'0'                                                     02942000
         DC    CL11'LINK TO SYM'                                        02943000
         DC    CL1' '                                                   02944000
I0035    DC    0H'0'                                            DSKC125 02946000
         DC    H'17'                                                    02948000
         DC    H'0'                                                     02949000
         DC    CL12'LINK TO DAIR'                                       02950000
         DC    CL1' '                                                   02951000
I0036    DC    0H'0'                                            DSKC125 02954000
         DC    H'9'                                                     02956000
         DC    H'0'                                                     02957000
         DC    CL4'LINK'                                                02958000
         DC    CL1' '                                                   02959000
         DC    X'01'                         !!! SOURCE COMPARE FIX !!! 02962000
I0040    DC    0H'0'                                            DSKC125 02962000
         DC    H'12'                                                    02964000
         DC    H'0'                                                     02965000
         DC    CL7'IKJPARS'                                             02966000
         DC    CL1' '                                                   02967000
I0041    DC    0H'0'                                            DSKC125 02969000
         DC    H'12'                                                    02971000
         DC    H'0'                                                     02972000
         DC    CL7'IKJDAIR'                                             02973000
         DC    CL1' '                                                   02974000
I0042    DC    0H'0'                                            DSKC125 02976000
         DC    H'13'                                                    02978000
         DC    H'0'                                                     02979000
         DC    CL8'IKJEFF18'                                            02980000
         DC    CL1' '                                                   02981000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 02984000
I0043    DC    0H'0'                                            DSKC125 02984000
         DC    H'18'                                                    02986000
         DC    H'0'                                                     02987000
         DC    CL13'IKJSCAN(SCAN)'                                      02988000
         DC    CL1' '                                                   02989000
I0046    DC    0H'0'                                            DSKC125 02991000
         DC    H'12'                                                    02993000
         DC    H'0'                                                     02994000
         DC    CL7'IKJDFLT'                                             02995000
         DC    CL1' '                                                   02996000
I0047    DC    0H'0'                                            DSKC125 02998000
         DC    H'10'                                                    03000000
         DC    H'0'                                                     03001000
         DC    CL5'ESTAE'                                               03002000
         DC    CL1' '                                                   03003000
I0048    DC    0H'0'                                            DSKC125 03005000
         DC    H'35'                                                    03007000
         DC    H'0'                                                     03008000
         DC    CL30'PROGRAM CHECK OR LOOP IN FETCH'                     03009000
         DC    CL1' '                                                   03010000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 03013000
I0049    DC    0H'0'                                            DSKC125 03013000
         DC    H'52'                                                    03015000
         DC    H'0'                                                     03016000
         DC    CL47'INSUFFICIENT CORE ON GETMAIN OF MODULE BY FETCH'    03017000
         DC    CL1' '                                                   03018000
I0050    DC    0H'0'                                            DSKC125 03020000
         DC    H'24'                                                    03022000
         DC    H'0'                                                     03023000
         DC    CL19'INVALID RECORD TYPE'                                03024000
         DC    CL1' '                                                   03025000
I0054    DC    0H'0'                                            DSKC125 03027000
         DC    H'8'                                                     03029000
         DC    H'0'                                                     03030000
         DC    CL3'106'                                                 03031000
         DC    CL1' '                                                   03032000
I0055    DC    0H'0'                                            DSKC125 03034000
         DC    H'8'                                                     03036000
         DC    H'0'                                                     03037000
         DC    CL3'206'                                                 03038000
         DC    CL1' '                                                   03039000
I0056    DC    0H'0'                                            DSKC125 03041000
         DC    H'8'                                                     03043000
         DC    H'0'                                                     03044000
         DC    CL3'306'                                                 03045000
         DC    CL1' '                                                   03046000
I0057    DC    0H'0'                                            DSKC125 03048000
         DC    H'8'                                                     03050000
         DC    H'0'                                                     03051000
         DC    CL3'406'                                                 03052000
         DC    CL1' '                                                   03053000
I0058    DC    0H'0'                                            DSKC125 03055000
         DC    H'8'                                                     03057000
         DC    H'0'                                                     03058000
         DC    CL3'706'                                                 03059000
         DC    CL1' '                                                   03060000
I0059    DC    0H'0'                                            DSKC125 03062000
         DC    H'8'                                                     03064000
         DC    H'0'                                                     03065000
         DC    CL3'806'                                                 03066000
         DC    CL1' '                                                   03067000
I0060    DC    0H'0'                                            DSKC125 03069000
         DC    H'8'                                                     03071000
         DC    H'0'                                                     03072000
         DC    CL3'906'                                                 03073000
         DC    CL1' '                                                   03074000
I0061    DC    0H'0'                                            DSKC125 03076000
         DC    H'8'                                                     03078000
         DC    H'0'                                                     03079000
         DC    CL3'A06'                                                 03080000
         DC    CL1' '                                                   03081000
I0070    DC    0H'0'                                            DSKC125 03083000
         DC    H'34'                                                    03085000
         DC    H'0'                                                     03086000
         DC    CL29'INVALID ADDRESS PASSED TO SVC'                      03087000
         DC    CL1' '                                                   03088000
I0071    DC    0H'0'                                            DSKC125 03090000
         DC    H'21'                                                    03092000
         DC    H'0'                                                     03093000
         DC    CL16'I/O ERROR IN SVC'                                   03094000
         DC    CL1' '                                                   03095000
         DC    X'D4'                         !!! SOURCE COMPARE FIX !!! 03098000
I0072    DC    0H'0'                                            DSKC125 03098000
         DC    H'46'                                                    03100000
         DC    H'0'                                                     03101000
         DC    CL41'THE MODULE NOT IN(PRIVATE JOB OR LINKLIB)'          03102000
         DC    CL1' '                                                   03103000
I0073    DC    0H'0'                                            DSKC125 03105000
         DC    H'14'                                                    03107000
         DC    H'0'                                                     03108000
         DC    CL9'I/O ERROR'                                           03109000
         DC    CL1' '                                                   03110000
I0074    DC    0H'0'                                            DSKC125 03112000
         DC    H'39'                                                    03114000
         DC    H'0'                                                     03115000
         DC    CL34'MODULE NOT IN LPA OR LPA DIRECTORY'                 03116000
         DC    CL1' '                                                   03117000
         DC    X'D6'                         !!! SOURCE COMPARE FIX !!! 03120000
I0077    DC    0H'0'                                            DSKC125 03120000
         DC    H'7'                                                     03122000
         DC    H'0'                                                     03123000
         DC    CL2'04'                                                  03124000
         DC    CL1' '                                                   03125000
         DC    X'C8'                         !!! SOURCE COMPARE FIX !!! 03128000
I0078    DC    0H'0'                                            DSKC125 03128000
         DC    H'7'                                                     03130000
         DC    H'0'                                                     03131000
         DC    CL2'08'                                                  03132000
         DC    CL1' '                                                   03133000
I0079    DC    0H'0'                                            DSKC125 03136000
         DC    H'7'                                                     03138000
         DC    H'0'                                                     03139000
         DC    CL2'0C'                                                  03140000
         DC    CL1' '                                                   03141000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 03144000
I0080    DC    0H'0'                                            DSKC125 03144000
         DC    H'7'                                                     03146000
         DC    H'0'                                                     03147000
         DC    CL2'10'                                                  03148000
         DC    CL1' '                                                   03149000
         DC    X'D6'                         !!! SOURCE COMPARE FIX !!! 03152000
I0081    DC    0H'0'                                            DSKC125 03152000
         DC    H'7'                                                     03154000
         DC    H'0'                                                     03155000
         DC    CL2'14'                                                  03156000
         DC    CL1' '                                                   03157000
         DC    X'E2'                         !!! SOURCE COMPARE FIX !!! 03160000
I0082    DC    0H'0'                                            DSKC125 03160000
         DC    H'7'                                                     03162000
         DC    H'0'                                                     03163000
         DC    CL2'18'                                                  03164000
         DC    CL1' '                                                   03165000
         DC    X'E2'                         !!! SOURCE COMPARE FIX !!! 03168000
I0083    DC    0H'0'                                            DSKC125 03168000
         DC    H'17'                                                    03170000
         DC    H'0'                                                     03171000
         DC    CL12'MULTIPLICITY'                                       03172000
         DC    CL1' '                                                   03173000
         DC    X'F8'                         !!! SOURCE COMPARE FIX !!! 03176000
I0084    DC    0H'0'                                            DSKC125 03176000
         DC    H'11'                                                    03178000
         DC    H'0'                                                     03179000
         DC    CL6'LENGTH'                                              03180000
         DC    CL1' '                                                   03181000
         DC    X'C6'                         !!! SOURCE COMPARE FIX !!! 03184000
I0085    DC    0H'0'                                            DSKC125 03184000
         DC    H'13'                                                    03186000
         DC    H'0'                                                     03187000
         DC    CL8'IKJEGSYM'                                            03188000
         DC    CL1' '                                                   03189000
         DC    X'E2'                         !!! SOURCE COMPARE FIX !!! 03192000
I0086    DC    0H'0'                                            DSKC125 03192000
         DC    H'8'                                                     03194000
         DC    H'0'                                                     03195000
         DC    CL3'DEB'                                                 03196000
         DC    CL1' '                                                   03197000
I0087    DC    0H'0'                                            DSKC125 03199000
         DC    H'13'                                                    03201000
         DC    H'0'                                                     03202000
         DC    CL8'IKJEGLDF'                                            03203000
         DC    CL1' '                                                   03204000
         DC    X'D9'                         !!! SOURCE COMPARE FIX !!! 03207000
I0089    DC    0H'0'                                            DSKC125 03207000
         DC    H'7'                                                     03209000
         DC    H'0'                                                     03210000
         DC    CL2'1C'                                                  03211000
         DC    CL1' '                                                   03212000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 03215000
I0092    DC    0H'0'                                            DSKC125 03215000
         DC    H'25'                                                    03217000
         DC    H'0'                                                     03218000
         DC    CL20'INSUFFICIENT STORAGE'                               03219000
         DC    CL1' '                                                   03220000
         DC    X'C9'                         !!! SOURCE COMPARE FIX !!! 03223000
I0093    DC    0H'0'                                            DSKC125 03223000
         DC    H'25'                                                    03225000
         DC    H'0'                                                     03226000
         DC    CL20'PROTECTION VIOLATION'                               03227000
         DC    CL1' '                                                   03228000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 03231000
I0094    DC    0H'0'                                            DSKC125 03231000
         DC    H'16'                                                    03233000
         DC    H'0'                                                     03234000
         DC    CL11'LOAD FAILED'                                        03235000
         DC    CL1' '                                                   03236000
I0095    DC    0H'0'                                            DSKC125 03238000
         DC    H'18'                                                    03240000
         DC    H'0'                                                     03241000
         DC    CL13'ATTACH FAILED'                                      03242000
         DC    CL1' '                                                   03243000
I0096    DC    0H'0'                                            DSKC125 03245000
         DC    H'16'                                                    03247000
         DC    H'0'                                                     03248000
         DC    CL11'OPEN FAILED'                                        03249000
         DC    CL1' '                                                   03250000
I0097    DC    0H'0'                                            DSKC125 03252000
         DC    H'43'                                                    03254000
         DC    H'0'                                                     03255000
         DC    CL38'SPECIFIED AREA IS IN PROTECTED STORAGE'             03256000
         DC    CL1' '                                                   03257000
         DC    X'F8'                         !!! SOURCE COMPARE FIX !!! 03260000
I0098    DC    0H'0'                                            DSKC125 03260000
         DC    H'24'                                                    03262000
         DC    H'0'                                                     03263000
         DC    CL19'INVALID DEB ADDRESS'                                03264000
         DC    CL1' '                                                   03265000
I0099    DC    0H'0'                                            DSKC125 03267000
         DC    H'16'                                                    03269000
         DC    H'0'                                                     03270000
         DC    CL11'LINK FAILED'                                        03271000
         DC    CL1' '                                                   03272000
I00100   DC    0H'0'                                            DSKC125 03274000
         DC    H'25'                                                    03276000
         DC    H'0'                                                     03277000
         DC    CL20'IN A NON-TEST MODULE'                               03278000
         DC    CL1' '                                                   03279000
         DC    X'E8'                         !!! SOURCE COMPARE FIX !!! 03282000
I00101   DC    0H'0'                                            DSKC125 03282000
         DC    H'24'                                                    03284000
         DC    H'0'                                                     03285000
         DC    CL19'IN IGC0006A(SVC 61)'                                03286000
         DC    CL1' '                                                   03287000
I00102   DC    0H'0'                                            DSKC125 03289000
         DC    H'24'                                                    03291000
         DC    H'0'                                                     03292000
         DC    CL19'IN IGC0009G(SVC 97)'                                03293000
         DC    CL1' '                                                   03294000
I00103   DC    0H'0'                                            DSKC125 03296000
         DC    H'16'                                                    03298000
         DC    H'0'                                                     03299000
         DC    CL11'IN IKJEGASN'                                        03300000
         DC    CL1' '                                                   03301000
I00104   DC    0H'0'                                            DSKC125 03303000
         DC    H'15'                                                    03305000
         DC    H'0'                                                     03306000
         DC    CL10'IN IKJEGAT'                                         03307000
         DC    CL1' '                                                   03308000
         DC    X'E3'                         !!! SOURCE COMPARE FIX !!! 03311000
I00105   DC    0H'0'                                            DSKC125 03311000
         DC    H'16'                                                    03313000
         DC    H'0'                                                     03314000
         DC    CL11'IN IKJEGATD'                                        03315000
         DC    CL1' '                                                   03316000
I00106   DC    0H'0'                                            DSKC125 03318000
         DC    H'16'                                                    03320000
         DC    H'0'                                                     03321000
         DC    CL11'IN IKJEGATN'                                        03322000
         DC    CL1' '                                                   03323000
I00107   DC    0H'0'                                            DSKC125 03325000
         DC    H'16'                                                    03327000
         DC    H'0'                                                     03328000
         DC    CL11'IN IKJEGCIV'                                        03329000
         DC    CL1' '                                                   03330000
I00108   DC    0H'0'                                            DSKC125 03332000
         DC    H'16'                                                    03334000
         DC    H'0'                                                     03335000
         DC    CL11'IN IKJEGCPY'                                        03336000
         DC    CL1' '                                                   03337000
I00109   DC    0H'0'                                            DSKC125 03339000
         DC    H'16'                                                    03341000
         DC    H'0'                                                     03342000
         DC    CL11'IN IKJEGCVT'                                        03343000
         DC    CL1' '                                                   03344000
I00110   DC    0H'0'                                            DSKC125 03346000
         DC    H'16'                                                    03348000
         DC    H'0'                                                     03349000
         DC    CL11'IN IKJEGDCB'                                        03350000
         DC    CL1' '                                                   03351000
I00111   DC    0H'0'                                            DSKC125 03353000
         DC    H'16'                                                    03355000
         DC    H'0'                                                     03356000
         DC    CL11'IN IKJEGDEB'                                        03357000
         DC    CL1' '                                                   03358000
I00112   DC    0H'0'                                            DSKC125 03360000
         DC    H'16'                                                    03362000
         DC    H'0'                                                     03363000
         DC    CL11'IN IKJEGEND'                                        03364000
         DC    CL1' '                                                   03365000
I00113   DC    0H'0'                                            DSKC125 03367000
         DC    H'16'                                                    03369000
         DC    H'0'                                                     03370000
         DC    CL11'IN IKJEGEQU'                                        03371000
         DC    CL1' '                                                   03372000
I00114   DC    0H'0'                                            DSKC125 03374000
         DC    H'15'                                                    03376000
         DC    H'0'                                                     03377000
         DC    CL10'IN IKJEGGO'                                         03378000
         DC    CL1' '                                                   03379000
         DC    X'C6'                         !!! SOURCE COMPARE FIX !!! 03382000
I00115   DC    0H'0'                                            DSKC125 03382000
         DC    H'16'                                                    03384000
         DC    H'0'                                                     03385000
         DC    CL11'IN IKJEGINT'                                        03386000
         DC    CL1' '                                                   03387000
I00116   DC    0H'0'                                            DSKC125 03389000
         DC    H'15'                                                    03391000
         DC    H'0'                                                     03392000
         DC    CL10'IN IKJEGIO'                                         03393000
         DC    CL1' '                                                   03394000
         DC    X'40'                         !!! SOURCE COMPARE FIX !!! 03397000
I00117   DC    0H'0'                                            DSKC125 03397000
         DC    H'16'                                                    03399000
         DC    H'0'                                                     03400000
         DC    CL11'IN IKJEGLDF'                                        03401000
         DC    CL1' '                                                   03402000
I00118   DC    0H'0'                                            DSKC125 03404000
         DC    H'16'                                                    03406000
         DC    H'0'                                                     03407000
         DC    CL11'IN IKJEGLDR'                                        03408000
         DC    CL1' '                                                   03409000
I00119   DC    0H'0'                                            DSKC125 03411000
         DC    H'16'                                                    03413000
         DC    H'0'                                                     03414000
         DC    CL11'IN IKJEGLSA'                                        03415000
         DC    CL1' '                                                   03416000
I00120   DC    0H'0'                                            DSKC125 03418000
         DC    H'16'                                                    03420000
         DC    H'0'                                                     03421000
         DC    CL11'IN IKJEGLST'                                        03422000
         DC    CL1' '                                                   03423000
I00121   DC    0H'0'                                            DSKC125 03425000
         DC    H'16'                                                    03427000
         DC    H'0'                                                     03428000
         DC    CL11'IN IKJEGMAP'                                        03429000
         DC    CL1' '                                                   03430000
I00122   DC    0H'0'                                            DSKC125 03432000
         DC    H'16'                                                    03434000
         DC    H'0'                                                     03435000
         DC    CL11'IN IKJEGMNL'                                        03436000
         DC    CL1' '                                                   03437000
I00123   DC    0H'0'                                            DSKC125 03439000
         DC    H'16'                                                    03441000
         DC    H'0'                                                     03442000
         DC    CL11'IN IKJEGOFF'                                        03443000
         DC    CL1' '                                                   03444000
I00124   DC    0H'0'                                            DSKC125 03446000
         DC    H'16'                                                    03448000
         DC    H'0'                                                     03449000
         DC    CL11'IN IKJEGPCH'                                        03450000
         DC    CL1' '                                                   03451000
I00125   DC    0H'0'                                            DSKC125 03453000
         DC    H'16'                                                    03455000
         DC    H'0'                                                     03456000
         DC    CL11'IN IKJEGPSW'                                        03457000
         DC    CL1' '                                                   03458000
I00126   DC    0H'0'                                            DSKC125 03460000
         DC    H'16'                                                    03462000
         DC    H'0'                                                     03463000
         DC    CL11'IN IKJEGQFY'                                        03464000
         DC    CL1' '                                                   03465000
I00127   DC    0H'0'                                            DSKC125 03467000
         DC    H'16'                                                    03469000
         DC    H'0'                                                     03470000
         DC    CL11'IN IKJEGSIO'                                        03471000
         DC    CL1' '                                                   03472000
I00128   DC    0H'0'                                            DSKC125 03474000
         DC    H'16'                                                    03476000
         DC    H'0'                                                     03477000
         DC    CL11'IN IKJEGSRH'                                        03478000
         DC    CL1' '                                                   03479000
I00129   DC    0H'0'                                            DSKC125 03481000
         DC    H'16'                                                    03483000
         DC    H'0'                                                     03484000
         DC    CL11'IN IKJEGSTA'                                        03485000
         DC    CL1' '                                                   03486000
I00130   DC    0H'0'                                            DSKC125 03488000
         DC    H'16'                                                    03490000
         DC    H'0'                                                     03491000
         DC    CL11'IN IKJEGSYM'                                        03492000
         DC    CL1' '                                                   03493000
I00131   DC    0H'0'                                            DSKC125 03495000
         DC    H'16'                                                    03497000
         DC    H'0'                                                     03498000
         DC    CL11'IN IKJEGTCB'                                        03499000
         DC    CL1' '                                                   03500000
I00132   DC    0H'0'                                            DSKC125 03502000
         DC    H'16'                                                    03504000
         DC    H'0'                                                     03505000
         DC    CL11'IN IKJEGWHR'                                        03506000
         DC    CL1' '                                                   03507000
I00133   DC    0H'0'                                            DSKC125 03509000
         DC    H'16'                                                    03511000
         DC    H'0'                                                     03512000
         DC    CL11'XCTL FAILED'                                        03513000
         DC    CL1' '                                                   03514000
I00134   DC    0H'0'                                            DSKC125 03516000
         DC    H'12'                                                    03518000
         DC    H'0'                                                     03519000
         DC    CL7'HEWLOAD'                                             03520000
         DC    CL1' '                                                   03521000
M0499    DC    0H'0'                                            DSKC125 03523000
         DC    AL1(56)                                                  03525000
         DC    AL1(75)                                                  03526000
         DC    AL1(76)                                                  03527000
         DC    AL1(77)                                                  03528000
         DC    AL1(0)                                                   03529000
         DC    AL1(0)                                                   03530000
         DC    H'82'                                                    03531000
         DC    H'0'                                                     03532000
         DC    CL1' '                                                   03533000
         DC    CL45'SVC FAILED WHEN ATTEMPTING TO OBTAIN A MODULE'      03534000
         DC    CL1' '                                                   03535000
         DC    CL18'THE ABEND CODE WAS'                                 03536000
         DC    CL1' '                                                   03537000
         DC    CL1' '                                                   03538000
         DC    CL1' '                                                   03539000
         DC    CL1' '                                                   03540000
         DC    CL1' '                                                   03541000
LINKCODE DC    0A(0)                                            DSKC125 03543000
         DC    XL4'106'                                                 03545000
         DC    AL4(ABEND10X)                                            03546000
         DC    AL4(I0054)                                               03547000
         DC    XL4'206'                                                 03548000
         DC    AL4(ABEND20X)                                            03549000
         DC    AL4(I0055)                                               03550000
         DC    XL4'306'                                                 03551000
         DC    AL4(ABEND30X)                                            03552000
         DC    AL4(I0056)                                               03553000
         DC    XL4'406'                                                 03554000
         DC    AL4(ABEND40X)                                            03555000
         DC    AL4(I0057)                                               03556000
         DC    XL4'706'                                                 03557000
         DC    AL4(ABEND70X)                                            03558000
         DC    AL4(I0058)                                               03559000
         DC    XL4'806'                                                 03560000
         DC    AL4(ABEND80X)                                            03561000
         DC    AL4(I0059)                                               03562000
         DC    XL4'906'                                                 03563000
         DC    AL4(ABEND90X)                                            03564000
         DC    AL4(I0060)                                               03565000
         DC    XL4'A06'                                                 03566000
         DC    AL4(ABENDA0X)                                            03567000
         DC    AL4(I0061)                                               03568000
         DC    F'0'                                                     03569000
LOADCODE DC    0A(0)                                            DSKC125 03571000
         DC    XL4'106'                                                 03573000
         DC    AL4(ABEND10X)                                            03574000
         DC    AL4(I0054)                                               03575000
         DC    XL4'206'                                                 03576000
         DC    AL4(ABEND20X)                                            03577000
         DC    AL4(I0055)                                               03578000
         DC    XL4'306'                                                 03579000
         DC    AL4(ABEND30X)                                            03580000
         DC    AL4(I0056)                                               03581000
         DC    XL4'406'                                                 03582000
         DC    AL4(ABEND40X)                                            03583000
         DC    AL4(I0057)                                               03584000
         DC    XL4'706'                                                 03585000
         DC    AL4(ABEND70X)                                            03586000
         DC    AL4(I0058)                                               03587000
         DC    XL4'806'                                                 03588000
         DC    AL4(ABEND80X)                                            03589000
         DC    AL4(I0059)                                               03590000
         DC    XL4'906'                                                 03591000
         DC    AL4(ABEND90X)                                            03592000
         DC    AL4(I0060)                                               03593000
         DC    XL4'A06'                                                 03594000
         DC    AL4(ABENDA0X)                                            03595000
         DC    AL4(I0061)                                               03596000
         DC    F'0'                                                     03597000
ABEND10X DC    0A(0)                                            DSKC125 03599000
         DC    AL4(M0400)                                               03601000
AB10XRCB DC    0A(0)                                            DSKC125 03602000
         DC    XL4'B'                                                   03604000
         DC    AL4(I0048)                                               03605000
AB10XRCC DC    0A(0)                                            DSKC125 03607000
         DC    XL4'C'                                                   03609000
         DC    AL4(I0049)                                               03610000
AB10XRCD DC    0A(0)                                            DSKC125 03612000
         DC    XL4'D'                                                   03614000
         DC    AL4(I0050)                                               03615000
AB10XRCE DC    0A(0)                                            DSKC125 03617000
         DC    XL4'E'                                                   03619000
         DC    AL4(I0070)                                               03620000
AB10XRCF DC    0A(0)                                            DSKC125 03622000
         DC    XL4'F'                                                   03624000
         DC    AL4(I0071)                                               03625000
         DC    F'0'                                                     03627000
ABEND20X DC    0A(0)                                            DSKC125 03629000
         DC    AL4(M0410)                                               03631000
         DC    F'0'                                                     03632000
ABEND30X DC    0A(0)                                            DSKC125 03634000
         DC    AL4(M0420)                                               03636000
AB30XRC4 DC    0A(0)                                            DSKC125 03637000
         DC    XL4'4'                                                   03639000
         DC    AL4(I0072)                                               03640000
AB30XRC8 DC    0A(0)                                            DSKC125 03642000
         DC    XL4'8'                                                   03644000
         DC    AL4(I0073)                                               03645000
AB30XRCC DC    0A(0)                                            DSKC125 03647000
         DC    XL4'C'                                                   03649000
         DC    AL4(I0074)                                               03650000
         DC    F'0'                                                     03652000
ABEND40X DC    0A(0)                                            DSKC125 03654000
         DC    AL4(M0430)                                               03656000
         DC    F'0'                                                     03657000
ABEND70X DC    0A(0)                                            DSKC125 03659000
         DC    AL4(M0440)                                               03661000
         DC    F'0'                                                     03662000
ABEND80X DC    0A(0)                                            DSKC125 03664000
         DC    AL4(M0450)                                               03666000
AB80XRC4 DC    0A(0)                                            DSKC125 03667000
         DC    XL4'4'                                                   03669000
         DC    AL4(I0072)                                               03670000
AB80XRC8 DC    0A(0)                                            DSKC125 03672000
         DC    XL4'8'                                                   03674000
         DC    AL4(I0073)                                               03675000
AB80XRCC DC    0A(0)                                            DSKC125 03677000
         DC    XL4'C'                                                   03679000
         DC    AL4(I0074)                                               03680000
         DC    F'0'                                                     03682000
ABEND90X DC    0A(0)                                            DSKC125 03684000
         DC    AL4(M0460)                                               03686000
         DC    F'0'                                                     03687000
ABENDA0X DC    0A(0)                                            DSKC125 03689000
         DC    AL4(M0470)                                               03691000
         DC    F'0'                                                     03692000
M0400    DC    0H'0'                                            DSKC125 03694000
         DC    AL1(22)                                                  03696000
         DC    AL1(23)                                                  03697000
         DC    AL1(24)                                                  03698000
         DC    AL1(0)                                                   03699000
         DC    AL1(0)                                                   03700000
         DC    AL1(0)                                                   03701000
         DC    H'30'                                                    03702000
         DC    H'0'                                                     03703000
         DC    CL21'IKJ57600I FETCH ERROR'                              03704000
         DC    CL1' '                                                   03705000
         DC    CL1' '                                                   03706000
         DC    CL1' '                                                   03707000
         DC    CL1'+'                                                   03708000
         DC    CL1' '                                                   03709000
         DC    CL1' '                                                   03710000
         DC    X'C8'                         !!! SOURCE COMPARE FIX !!! 03713000
M0410    DC    0H'0'                                            DSKC125 03713000
         DC    AL1(43)                                                  03715000
         DC    AL1(44)                                                  03716000
         DC    AL1(0)                                                   03717000
         DC    AL1(0)                                                   03718000
         DC    AL1(0)                                                   03719000
         DC    AL1(0)                                                   03720000
         DC    H'50'                                                    03721000
         DC    H'0'                                                     03722000
         DC    CL42'IKJ57601I BAD PARAMETER LIST PASSED TO SVC'         03723000
         DC    CL1' '                                                   03724000
         DC    CL1' '                                                   03725000
         DC    CL1'+'                                                   03726000
         DC    CL1' '                                                   03727000
         DC    CL1' '                                                   03728000
M0420    DC    0H'0'                                            DSKC125 03731000
         DC    AL1(69)                                                  03733000
         DC    AL1(70)                                                  03734000
         DC    AL1(71)                                                  03735000
         DC    AL1(0)                                                   03736000
         DC    AL1(0)                                                   03737000
         DC    AL1(0)                                                   03738000
         DC    H'77'                                                    03739000
         DC    H'0'                                                     03740000
         DC    CL68'IKJ57603I A NON-AUTHORIZED COPY OF A SYSTEM ROUTINEC03741000
                WAS FOUND BY SVC'                                       03742000
         DC    CL1' '                                                   03743000
         DC    CL1' '                                                   03744000
         DC    CL1' '                                                   03745000
         DC    CL1'+'                                                   03746000
         DC    CL1' '                                                   03747000
         DC    CL1' '                                                   03748000
M0430    DC    0H'0'                                            DSKC125 03750000
         DC    AL1(14)                                                  03752000
         DC    AL1(44)                                                  03753000
         DC    AL1(0)                                                   03754000
         DC    AL1(0)                                                   03755000
         DC    AL1(0)                                                   03756000
         DC    AL1(0)                                                   03757000
         DC    H'50'                                                    03758000
         DC    H'0'                                                     03759000
         DC    CL13'IKJ57602I SVC'                                      03760000
         DC    CL1' '                                                   03761000
         DC    CL29'REQUESTED TO LOAD ONLY MODULE'                      03762000
         DC    CL1' '                                                   03763000
         DC    CL1'+'                                                   03764000
         DC    CL1' '                                                   03765000
         DC    CL1' '                                                   03766000
M0440    DC    0H'0'                                            DSKC125 03769000
         DC    AL1(14)                                                  03771000
         DC    AL1(15)                                                  03772000
         DC    AL1(0)                                                   03773000
         DC    AL1(0)                                                   03774000
         DC    AL1(0)                                                   03775000
         DC    AL1(0)                                                   03776000
         DC    H'77'                                                    03777000
         DC    H'0'                                                     03778000
         DC    CL13'IKJ57603I SVC'                                      03779000
         DC    CL1' '                                                   03780000
         DC    CL1' '                                                   03781000
         DC    CL57'ATTEMPTED TO USE A MODULE FLAGGED NOT EXECUTABLE BYC03782000
                LKED+'                                                  03783000
         DC    CL1' '                                                   03784000
         DC    CL1' '                                                   03785000
M0450    DC    0H'0'                                            DSKC125 03787000
         DC    AL1(34)                                                  03789000
         DC    AL1(35)                                                  03790000
         DC    AL1(36)                                                  03791000
         DC    AL1(0)                                                   03792000
         DC    AL1(0)                                                   03793000
         DC    AL1(0)                                                   03794000
         DC    H'42'                                                    03795000
         DC    H'0'                                                     03796000
         DC    CL33'IKJ57604I MODULE NOT FOUND BY SVC'                  03797000
         DC    CL1' '                                                   03798000
         DC    CL1' '                                                   03799000
         DC    CL1' '                                                   03800000
         DC    CL1'+'                                                   03801000
         DC    CL1' '                                                   03802000
         DC    CL1' '                                                   03803000
         DC    X'C6'                         !!! SOURCE COMPARE FIX !!! 03806000
M0460    DC    0H'0'                                            DSKC125 03806000
         DC    AL1(14)                                                  03808000
         DC    AL1(15)                                                  03809000
         DC    AL1(0)                                                   03810000
         DC    AL1(0)                                                   03811000
         DC    AL1(0)                                                   03812000
         DC    AL1(0)                                                   03813000
         DC    H'77'                                                    03814000
         DC    H'0'                                                     03815000
         DC    CL13'IKJ57605I SVC'                                      03816000
         DC    CL1' '                                                   03817000
         DC    CL1' '                                                   03818000
         DC    CL57'CAUSED THE COUNT OF A REUSABLE LOAD MODULE TO EXCEEC03819000
               D 255+'                                                  03820000
         DC    CL1' '                                                   03821000
         DC    CL1' '                                                   03822000
M0470    DC    0H'0'                                            DSKC125 03824000
         DC    AL1(14)                                                  03826000
         DC    AL1(15)                                                  03827000
         DC    AL1(0)                                                   03828000
         DC    AL1(0)                                                   03829000
         DC    AL1(0)                                                   03830000
         DC    AL1(0)                                                   03831000
         DC    H'78'                                                    03832000
         DC    H'0'                                                     03833000
         DC    CL13'IKJ57606I SVC'                                      03834000
         DC    CL1' '                                                   03835000
         DC    CL1' '                                                   03836000
         DC    CL58'DETECTED AN INTERLOCK IN USING A SERIALLY REUSABLE C03837000
               MODULE+'                                                 03838000
         DC    CL1' '                                                   03839000
         DC    CL1' '                                                   03840000
         DC    X'C1'                         !!! SOURCE COMPARE FIX !!! 03843000
M0599    DC    0H'0'                                            DSKC125 03843000
         DC    AL1(43)                                                  03845000
         DC    AL1(0)                                                   03846000
         DC    AL1(0)                                                   03847000
         DC    AL1(0)                                                   03848000
         DC    AL1(0)                                                   03849000
         DC    AL1(0)                                                   03850000
         DC    H'48'                                                    03851000
         DC    H'0'                                                     03852000
         DC    CL1' '                                                   03853000
         DC    CL32'SVC FAILED WITH A RETURN CODE OF'                   03854000
         DC    CL1' '                                                   03855000
         DC    CL1' '                                                   03856000
         DC    CL1' '                                                   03857000
ESTAERC  DC    0A(0)                                            DSKC125 03859000
ESTAE04  DC    0A(0)                                            DSKC125 03861000
         DC    XL4'4'                                                   03863000
         DC    AL4(M0500)                                               03864000
         DC    AL4(I0077)                                               03865000
ESTAE08  DC    0A(0)                                            DSKC125 03867000
         DC    XL4'8'                                                   03869000
         DC    AL4(M0501)                                               03870000
         DC    AL4(I0078)                                               03871000
ESTAE0C  DC    0A(0)                                            DSKC125 03873000
         DC    XL4'C'                                                   03875000
         DC    AL4(M0502)                                               03876000
         DC    AL4(I0079)                                               03877000
ESTAE10  DC    0A(0)                                            DSKC125 03879000
         DC    XL4'10'                                                  03881000
         DC    AL4(M0503)                                               03882000
         DC    AL4(I0080)                                               03883000
ESTAE14  DC    0A(0)                                            DSKC125 03885000
         DC    XL4'14'                                                  03887000
         DC    AL4(M0504)                                               03888000
         DC    AL4(I0081)                                               03889000
ESTAE18  DC    0A(0)                                            DSKC125 03891000
         DC    XL4'18'                                                  03893000
         DC    AL4(M0505)                                               03894000
         DC    AL4(I0082)                                               03895000
ESTAE1C  DC    0A(0)                                            DSKC125 03897000
         DC    XL4'1C'                                                  03899000
         DC    AL4(M0506)                                               03900000
         DC    AL4(I0089)                                               03901000
         DC    F'0'                                                     03903000
FREERC   DC    0A(0)                                            DSKC125 03905000
FRE04    DC    0A(0)                                            DSKC125 03907000
         DC    XL4'4'                                                   03909000
         DC    AL4(M0520)                                               03910000
         DC    AL4(I0077)                                               03911000
FRE08    DC    0A(0)                                            DSKC125 03913000
         DC    XL4'8'                                                   03915000
         DC    AL4(M0521)                                               03916000
         DC    AL4(I0078)                                               03917000
         DC    F'0'                                                     03919000
GETRC    DC    0A(0)                                            DSKC125 03921000
GET04    DC    0A(0)                                            DSKC125 03923000
         DC    XL4'4'                                                   03925000
         DC    AL4(M0510)                                               03926000
         DC    AL4(I0077)                                               03927000
GET08    DC    0A(0)                                            DSKC125 03929000
         DC    XL4'8'                                                   03931000
         DC    AL4(M0511)                                               03932000
         DC    AL4(I0078)                                               03933000
         DC    F'0'                                                     03935000
M0500    DC    0H'0'                                            DSKC125 03937000
         DC    AL1(0)                                                   03939000
         DC    AL1(0)                                                   03940000
         DC    AL1(0)                                                   03941000
         DC    AL1(0)                                                   03942000
         DC    AL1(0)                                                   03943000
         DC    AL1(0)                                                   03944000
         DC    H'95'                                                    03945000
         DC    H'0'                                                     03946000
         DC    CL90'IKJ57606I ESTAE FAILED TO PASS THE EXIT ADDRESS WHEC03947000
               N CANCELING NON-EXISTENT ESTAE REQUEST+'                 03948000
         DC    CL1' '                                                   03949000
         DC    CL1' '                                                   03950000
M0501    DC    0H'0'                                            DSKC125 03952000
         DC    AL1(0)                                                   03954000
         DC    AL1(0)                                                   03955000
         DC    AL1(0)                                                   03956000
         DC    AL1(0)                                                   03957000
         DC    AL1(0)                                                   03958000
         DC    AL1(0)                                                   03959000
         DC    H'93'                                                    03960000
         DC    H'0'                                                     03961000
         DC    CL88'IKJ57607I ESTAE IN A TEST MODULE WAS NOT AN INITIALC03962000
                BRANCH ENTRY WITH THE CREATE OPTION+'                   03963000
         DC    CL1' '                                                   03964000
         DC    CL1' '                                                   03965000
M0502    DC    0H'0'                                            DSKC125 03967000
         DC    AL1(0)                                                   03969000
         DC    AL1(0)                                                   03970000
         DC    AL1(0)                                                   03971000
         DC    AL1(0)                                                   03972000
         DC    AL1(0)                                                   03973000
         DC    AL1(0)                                                   03974000
         DC    H'76'                                                    03975000
         DC    H'0'                                                     03976000
         DC    CL71'IKJ57608I ESTAE IN A TEST MODULE EXIT ROUTINE OR PAC03977000
               RM LIST WAS INVALID+'                                    03978000
         DC    CL1' '                                                   03979000
         DC    CL1' '                                                   03980000
M0503    DC    0H'0'                                            DSKC125 03983000
         DC    AL1(0)                                                   03985000
         DC    AL1(0)                                                   03986000
         DC    AL1(0)                                                   03987000
         DC    AL1(0)                                                   03988000
         DC    AL1(0)                                                   03989000
         DC    AL1(0)                                                   03990000
         DC    H'101'                                                   03991000
         DC    H'0'                                                     03992000
         DC    CL96'IKJ57609I ESTAE IN A TEST MODULE WAS ISSUED THE SVCC03993000
                ENCOUNTER UNEXPECTED ERROR WHILE PROCESSING+'           03994000
         DC    CL1' '                                                   03995000
         DC    CL1' '                                                   03996000
M0504    DC    0H'0'                                            DSKC125 03998000
         DC    AL1(0)                                                   04000000
         DC    AL1(0)                                                   04001000
         DC    AL1(0)                                                   04002000
         DC    AL1(0)                                                   04003000
         DC    AL1(0)                                                   04004000
         DC    AL1(0)                                                   04005000
         DC    H'78'                                                    04006000
         DC    H'0'                                                     04007000
         DC    CL73'IKJ57610I ESTAE IN A TEST MODULE WAS UNABLE TO OBTAC04008000
               IN STORAGE FOR AN SCB+'                                  04009000
         DC    CL1' '                                                   04010000
         DC    CL1' '                                                   04011000
M0505    DC    0H'0'                                            DSKC125 04014000
         DC    AL1(0)                                                   04016000
         DC    AL1(0)                                                   04017000
         DC    AL1(0)                                                   04018000
         DC    AL1(0)                                                   04019000
         DC    AL1(0)                                                   04020000
         DC    AL1(0)                                                   04021000
         DC    H'77'                                                    04022000
         DC    H'0'                                                     04023000
         DC    CL72'IKJ57611I ESTAE IN A TEST MODULE SETLOCK ENCOUNTEREC04024000
               D AN ERROR CONDITION+'                                   04025000
         DC    CL1' '                                                   04026000
         DC    CL1' '                                                   04027000
M0506    DC    0H'0'                                            DSKC125 04029000
         DC    AL1(0)                                                   04031000
         DC    AL1(0)                                                   04032000
         DC    AL1(0)                                                   04033000
         DC    AL1(0)                                                   04034000
         DC    AL1(0)                                                   04035000
         DC    AL1(0)                                                   04036000
         DC    H'93'                                                    04037000
         DC    H'0'                                                     04038000
         DC    CL88'IKJ57612I ESTAE IN A TEST MODULE WAS NOT AN INITIALC04039000
                BRANCH ENTRY WITH THE CREATE OPTION+'                   04040000
         DC    CL1' '                                                   04041000
         DC    CL1' '                                                   04042000
M0510    DC    0H'0'                                            DSKC125 04044000
         DC    AL1(0)                                                   04046000
         DC    AL1(0)                                                   04047000
         DC    AL1(0)                                                   04048000
         DC    AL1(0)                                                   04049000
         DC    AL1(0)                                                   04050000
         DC    AL1(0)                                                   04051000
         DC    H'68'                                                    04052000
         DC    H'0'                                                     04053000
         DC    CL63'IKJ57613I FREEMAIN IN A TEST MODULE WAS UNABLE TO FC04054000
               REE STORAGE+'                                            04055000
         DC    CL1' '                                                   04056000
         DC    CL1' '                                                   04057000
M0511    DC    0H'0'                                            DSKC125 04060000
         DC    AL1(0)                                                   04062000
         DC    AL1(0)                                                   04063000
         DC    AL1(0)                                                   04064000
         DC    AL1(0)                                                   04065000
         DC    AL1(0)                                                   04066000
         DC    AL1(0)                                                   04067000
         DC    H'83'                                                    04068000
         DC    H'0'                                                     04069000
         DC    CL78'IKJ57614I FREEMAIN IN A TEST MODULE ATTEMPTED TO FRC04070000
               EE STORAGE THAT WAS"FIXED"+'                             04071000
         DC    CL1' '                                                   04072000
         DC    CL1' '                                                   04073000
M0520    DC    0H'0'                                            DSKC125 04075000
         DC    AL1(0)                                                   04077000
         DC    AL1(0)                                                   04078000
         DC    AL1(0)                                                   04079000
         DC    AL1(0)                                                   04080000
         DC    AL1(0)                                                   04081000
         DC    AL1(0)                                                   04082000
         DC    H'80'                                                    04083000
         DC    H'0'                                                     04084000
         DC    CL75'IKJ57615I GETMAIN IN A TEST MODULE WAS UNABLE TO OBC04085000
               TAIN ADDITIONAL STORAGE+'                                04086000
         DC    CL1' '                                                   04087000
         DC    CL1' '                                                   04088000
M0521    DC    0H'0'                                            DSKC125 04091000
         DC    AL1(0)                                                   04093000
         DC    AL1(0)                                                   04094000
         DC    AL1(0)                                                   04095000
         DC    AL1(0)                                                   04096000
         DC    AL1(0)                                                   04097000
         DC    AL1(0)                                                   04098000
         DC    H'94'                                                    04099000
         DC    H'0'                                                     04100000
         DC    CL89'IKJ57616I GETMAIN IN A TEST MODULE ATTEMPTED TO OBTC04101000
               AIN REAL PAGE STORAGE FOR SQA ON LSQA+'                  04102000
         DC    CL1' '                                                   04103000
         DC    CL1' '                                                   04104000
NULLMSG  DC    X'FF'                                                    04106000
         DC    0H'0'                                                    04107000
SUPERZAP DC    50CL1'Z'                                         DSKC125 04108000
M0043    EQU   NULLMSG                                                  04128000
M0044    EQU   NULLMSG                                                  04129000
M0055    EQU   NULLMSG                                                  04130000
M0056    EQU   NULLMSG                                                  04131000
M0057    EQU   NULLMSG                                                  04132000
M0059    EQU   NULLMSG                                                  04133000
M0060    EQU   NULLMSG                                                  04134000
M0061    EQU   NULLMSG                                                  04135000
M0062    EQU   NULLMSG                                                  04136000
M0063    EQU   NULLMSG                                                  04137000
M0065    EQU   NULLMSG                                                  04138000
M0102    EQU   NULLMSG                                                  04139000
M0254    EQU   NULLMSG                                                  04144000
M0256    EQU   NULLMSG                                                  04145000
M0261    EQU   NULLMSG                                                  04146000
M0262    EQU   NULLMSG                                                  04147000
M0263    EQU   NULLMSG                                                  04148000
M0264    EQU   NULLMSG                                                  04149000
M0265    EQU   NULLMSG                                                  04150000
M0282    EQU   NULLMSG                                                  04151000
M0286    EQU   NULLMSG                                                  04152000
M0288    EQU   NULLMSG                                                  04153000
M0289    EQU   NULLMSG                                                  04154000
M0290    EQU   NULLMSG                                                  04155000
M0291    EQU   NULLMSG                                                  04156000
M0292    EQU   NULLMSG                                                  04157000
M0293    EQU   NULLMSG                                                  04158000
I001     EQU   NULLMSG                                                  04159000
I005     EQU   NULLMSG                                                  04160000
I0021    EQU   NULLMSG                                                  04161000
I0028    EQU   NULLMSG                                                  04162000
I0029    EQU   NULLMSG                                                  04163000
I0032    EQU   NULLMSG                                                  04164000
I0037    EQU   NULLMSG                                                  04165000
I0038    EQU   NULLMSG                                                  04166000
I0039    EQU   NULLMSG                                                  04167000
I0044    EQU   NULLMSG                                                  04168000
I0045    EQU   NULLMSG                                                  04169000
I0051    EQU   NULLMSG                                                  04170000
I0052    EQU   NULLMSG                                                  04171000
I0053    EQU   NULLMSG                                                  04172000
I0062    EQU   NULLMSG                                                  04173000
I0063    EQU   NULLMSG                                                  04174000
I0064    EQU   NULLMSG                                                  04175000
I0065    EQU   NULLMSG                                                  04176000
I0066    EQU   NULLMSG                                                  04177000
I0067    EQU   NULLMSG                                                  04178000
I0068    EQU   NULLMSG                                                  04179000
I0069    EQU   NULLMSG                                                  04180000
I0075    EQU   NULLMSG                                                  04181000
I0076    EQU   NULLMSG                                                  04182000
I0088    EQU   NULLMSG                                                  04183000
I0090    EQU   NULLMSG                                                  04184000
I0091    EQU   NULLMSG                                                  04185000
         END   IKJEGMSG                                         DSKC125 04187000
