         MACRO                                                          00050002
&LABEL   IECALLWA &EP,&F4,&D1=(0),&D2=(0),&ADT=NO                       00100002
.*                                                                      00150002
.*       MACRO DELETIONS/CHANGES FOR VS2 RELEASE 2                      00200002
.*                                                                      00250002
.*                                                                      00300002
.********************************************************************** 00350002
.*                                                                      00400002
.* MODULE NAME = IECALLWA (VS2-2)                                       00450002
.*                                                                      00500002
.* DESCRIPTIVE NAME = DADSM ALLOCATE WORK AREA ADDRESSING MACRO         00550002
.*                                                                      00600002
.* COPYRIGHT = NONE                                                     00650002
.*                                                                      00700002
.* STATUS = CHANGE LEVEL 000                                            00750002
.*                                                                      00800002
.* FUNCTION = DADSM ALLOCATE MACRO WHICH PROVIDES ADDRESSABILITY        00850002
.*            TO THE 820 DECIMAL BYTE WORK AREA (NOT INCLUDING THE      00900002
.*            8 WORD PREFIX OR THE 6 WORD RECOVERY ROUTINE PARAMETER    00950002
.*            LIST) USED BY ALLOCATE, ISAM ALLOCATE, AND THE VTOC       01000002
.*            CONVERSION ROUTINES.                                      01050002
.*                                                                      01100002
.* NOTES = THIS MACRO IS AN INTERNAL MACRO USED IN THE FOLLOWING        01150002
.*         DADSM FUNCTIONS:                                             01200002
.*                                                                      01250002
.*             ALLOCATE                                                 01300002
.*             EXTEND (INTERFACE TO VTOC CONVERSION)                    01350002
.*             ISAM ALLOCATE                                            01400002
.*             VTOC CONVERSION                                          01450002
.*                                                                      01500002
.*         TO REFERENCE THIS WORK AREA WITHIN THE FUNCTIONS LISTED      01550002
.*         ABOVE, CODE A USING STATEMENT ON THE LABEL 'ALLOCWKA'.       01600002
.*                                                                      01650002
.*      DEPENDENCIES = THIS MACRO IS DESIGNED TO BE USED OPTIONALLY     01700002
.*                     WITH THE IECSDSL1 DSCB MAPPING MACRO, THE        01750002
.*                     PREFX MACRO (DEFINED IN THE IECDSECS MACRO)      01800002
.*                     WHICH DEFINES THE 8 WORD WORK AREA PREFIX,       01850002
.*                     THE 20 WORD EXTENDED WORK AREA PREFIX, AND       01900002
.*                     THE 4 WORD DADSM WTG TABLE, AND THE DSMADT       01950002
.*                     MACRO (ALSO DEFINED IN THE IECDSECS MACRO)       02000002
.*                     WHICH DEFINES THE 6 WORD DADSM AUDIT TRAIL.      02050002
.*                                                                      02100002
.*      RESTRICTIONS = NONE                                             02150002
.*                                                                      02200002
.*      REGISTER CONVENTIONS = NOT APPLICABLE                           02250002
.*                                                                      02300002
.* PATCH LABEL = NOT APPLICABLE                                         02350002
.*                                                                      02400002
.* MODULE TYPE = MACRO                                                  02450002
.*                                                                      02500002
.*      PROCESSOR = ASSEMBLER LANGUAGE                                  02550002
.*                                                                      02600002
.*      MODULE SIZE = 820 DECIMAL BYTES (NOT INCLUDING THE PREFIX)      02650002
.*                                                                      02700002
.*      ATTRIBUTES = NOT APPLICABLE                                     02750002
.*                                                                      02800002
.* ENTRY POINT = ALLPREFX                                               02850002
.*                                                                      02900002
.*      PURPOSE = THIS MACRO IS CALLED AT ASSEMBLY TIME BY THE          02950002
.*                FUNCTIONS LISTED UNDER 'NOTES' TO EXPAND THE          03000002
.*                ALLOCATE WORK AREA.                                   03050002
.*                                                                      03100002
.*      LINKAGE =                                                       03150002
.*                                                                      03200002
.*                LABEL IECALLWA EP,F4,D1=(N),D2=(N),ADT=YES            03250002
.*                                                                      03300002
.*      INPUT =                                                         03350002
.*                                                                      03400002
.*                OPTIONAL LABEL SPECIFIED AS AN ACCEPTABLE ASSEMBLER   03450002
.*                LABEL WHICH CAN BE USED BY THE CALLING CSECT TO       03500002
.*                ESTABLISH ADDRESSABILITY TO THE ENTIRE WORK AREA.     03550002
.*                                                                      03600002
.*                EP IS THE FIRST POSITIONAL PARAMETER, SPECIFYING      03650002
.*                THAT THE LABELS FOR EACH OF THE FIELDS IN THE 8       03700002
.*                WORD PREFIX, 20 WORD EXTENDED PREFIX, AND THE 4       03750002
.*                WORD DADSM WTG TABLE ARE TO BE EXPANDED. IF THESE     03800002
.*                FIELDS ARE NOT TO BE DEFINED, A COMMA MUST BE         03850002
.*                CODED TO INDICATE THE ABSENCE OF THIS PARAMETER.      03900002
.*                                                                      03950002
.*                F4 IS THE SECOND POSITIONAL PARAMETER, SPECIFYING     04000002
.*                THAT THE FIELDS OF THE FORMAT 4 DSCB ARE TO BE        04050002
.*                EXPANDED USING THE IECSDSL1 DSCB MAPPING MACRO.       04100002
.*                IF THESE FIELDS ARE NOT TO BE DEFINED AND A           04150002
.*                KEYWORD PARAMETER FOLLOWS, A COMMA MUST BE            04200002
.*                CODED TO INDICATE THE ABSENCE OF THIS PARAMETER.      04250002
.*                                                                      04300002
.*                D1=(N) IS A KEYWORD PARAMETER THAT SPECIFIES THE      04350002
.*                FORMAT(S) OF THE DSCB(S) TO BE EXPANDED IN THE        04400002
.*                FIRST 140 BYTE DSCB AREA, USING THE IECSDSL1 MACRO.   04450002
.*                N CAN BE A NUMBER FROM 0 - 6.  IF N IS 0 OR 4 OR      04500002
.*                IF THIS KEYWORD IS OMITTED, NO LABELS ARE EXPANDED.   04550002
.*                IF N IS 1, 2, 3, 5, OR 6, THE CORRESPONDING FORMAT    04600002
.*                OF THE DSCB WILL BE EXPANDED.  MORE THAN ONE DSCB     04650002
.*                FORMAT CAN BE MAPPED IN THE FIRST 140 BYTE DSCB       04700002
.*                AREA BY SEPARATING THE FORMAT NUMBERS BY COMMAS.      04750002
.*                                                                      04800002
.*                D2=(N) IS A KEYWORD PARAMETER THAT SPECIFIES          04850002
.*                THE FORMAT(S) OF THE DSCB(S) TO BE EXPANDED IN THE    04900002
.*                SECOND 140 BYTE DSCB AREA, USING THE IECSDSL1 MACRO.  04950002
.*                N CAN BE A NUMBER FROM 0 - 6.  IF N IS 0 OR 4 OR      05000002
.*                IF THIS KEYWORD IS OMITTED, NO LABELS ARE EXPANDED.   05050002
.*                IF N IS 1, 2, 3, 5, OR 6, THE CORRESPONDING FORMAT    05100002
.*                OF THE DSCB WILL BE EXPANDED.  MORE THAN ONE DSCB     05150002
.*                FORMAT CAN BE MAPPED IN THE SECOND 140 BYTE DSCB      05200002
.*                AREA BY SEPARATING THE FORMAT NUMBERS BY COMMAS.      05250002
.*                                                                      05300002
.*                ADT=YES IS A KEYWORD PARAMETER WHICH SPECIFIES THAT   05350002
.*                THE LABELS FOR EACH OF THE FIELDS WITHIN THE 6 WORD   05400002
.*                DADSM AUDIT TRAIL ARE TO BE EXPANDED.                 05450002
.*                                                                      05500002
.*      OUTPUT = DADSM ALLOCATE WORK AREA EXPANSION                     05550002
.*                                                                      05600002
.* EXIT-NORMAL = MEND STATEMENT                                         05650002
.*                                                                      05700002
.* EXIT-ERROR = ERROR MESSAGES:                                         05750002
.*                                                                      05800002
.*      MNOTE 12,***  IHB002 INVALID EP OPERAND SPECIFIED-&EP           05850002
.*      MNOTE 12,***  IHB002 INVALID F4 OPERAND SPECIFIED-&F4           05900002
.*      MNOTE 12,***  IHB002 INVALID ADT OPERAND SPECIFIED-&ADT         05950002
.*                                                                      06000002
.*      THE MACRO EXPANSION CONTINUES AS IF THE INVALID PARAMETER       06050002
.*      WERE NOT SPECIFIED.                                             06100002
.*                                                                      06150002
.* EXTERNAL REFERENCES = NONE                                           06200002
.*                                                                      06250002
.*      ROUTINES = NONE                                                 06300002
.*                                                                      06350002
.*      DATA AREAS = ALLOCATE WORK AREA                                 06400002
.*                                                                      06450002
.*      CONTROL BLOCKS = DSCB, ECB, IOB, DCB, DEB                       06500002
.*                                                                      06550002
.* TABLES = NONE                                                        06600002
.*                                                                      06650002
.* MACROS = IECDSECS DSMADT                                             06700002
.*          IECDSECS PREFX                                              06750002
.*          IECSDSL1                                                    06800002
.*          IHBERMAC                                                    06850002
.*                                                                      06900002
.* CHANGE ACTIVITY = SEE DELETIONS/CHANGES PRECEDING THE MACRO          06950002
.*                                                                      07000002
.********************************************************************** 07050002
.*                                                                      07100002
         LCLA  &C                                                       07150002
&LABEL   DSECT                                                          07200002
*********************************************************************** 07250002
*                                                                       07300002
*        ALLOCATE WORK AREA                                             07350002
*                                                                       07400002
*********************************************************************** 07450002
         SPACE 1                                                        07500002
*********************************************************************** 07550002
*        COMMON ALLOCATE PREFIX, EXTENDED PREFIX, AND WTG TABLE AREA    07600002
*********************************************************************** 07650002
         SPACE 1                                                        07700002
ALLPREFX DS    8F                       WORK AREA PREFIX                07750002
ALLOCWKA DS    20F                      EXTENDED PREFIX                 07800002
FIRST    EQU   ALLOCWKA                                                 07850002
AWTGTBL  DS    4F                       DADSM WTG TABLE                 07900002
         AIF   ('&EP' EQ 'EP').ALL0010                                  07950002
         AIF   ('&EP' EQ '').ALL0020                                    08000002
         IHBERMAC 1001,EP,&EP                                           08050002
         AGO   .ALL0020                                                 08100002
.ALL0010 ANOP                                                           08150002
         ORG   ALLPREFX                                                 08200002
         MNOTE '         IECDSECS PREFX,EXPAND=YES'                     08250002
         IECDSECS PREFX,EXPAND=YES                                      08300002
.ALL0020 ANOP                                                           08350002
         SPACE 1                                                        08352002
*********************************************************************** 08360002
*        COMMON ALLOCATE DSCB AREAS                                     08370002
*********************************************************************** 08394002
         SPACE 1                                                        08600002
ADSCBF4  DS    XL96                     COMMON ALLOCATE FORMAT 4 DSCB   08650002
*                                       AREA                            08660002
         AIF   ('&F4' EQ 'F4').ALL0030                                  08700002
         AIF   ('&F4' EQ '').ALL0040                                    08750002
         IHBERMAC 1001,F4,&F4                                           08800002
         AGO   .ALL0040                                                 08850002
.ALL0030 ANOP                                                           08900002
         ORG   ADSCBF4                                                  08950002
*        IECSDSL1 (4)                                                   09000002
         IECSDSL1 (4)                                                   09050002
.ALL0040 ANOP                                                           09100002
DSCBF1   DS    XL140                    COMMON ALLOCATE FIRST 140-BYTE  09400002
*                                       DSCB AREA                       09410002
F5OUT    EQU   DSCBF1+30                                                09450002
&C       SETA  1                                                        09500002
.ALL0050 AIF   (&C GT N'&D1).ALL0060                                    09550002
         AIF   (&D1(&C) EQ 0 OR &D1(&C) EQ 4).ALL0055                   09600002
         ORG   DSCBF1                                                   09650002
         MNOTE '         IECSDSL1 (&D1(&C))'                            09700002
         IECSDSL1 (&D1(&C))                                             09750002
.ALL0055 ANOP                                                           09800002
&C       SETA  &C+1                                                     09850002
         AGO   .ALL0050                                                 09900002
.ALL0060 ANOP                                                           09950002
DSCBF5   DS    XL140                    COMMON ALLOCATE SECOND 140-BYTE 10250002
*                                       DSCB AREA                       10260002
F5IN     EQU   DSCBF5                                                   10300002
&C       SETA  1                                                        10350002
.ALL0070 AIF   (&C GT N'&D2).ALL0080                                    10400002
         AIF   (&D2(&C) EQ 0 OR &D2(&C) EQ 4).ALL0075                   10450002
         ORG   DSCBF5                                                   10500002
         MNOTE '         IECSDSL1 (&D2(&C))'                            10550002
         IECSDSL1 (&D2(&C))                                             10600002
.ALL0075 ANOP                                                           10650002
&C       SETA  &C+1                                                     10700002
         AGO   .ALL0070                                                 10750002
.ALL0080 ANOP                                                           10800002
         SPACE 1                                                        10802002
*********************************************************************** 10810002
*        THE CONTROL BLOCK AREAS THAT FOLLOW (DEB/DCB, ECB/IOB, AND     10820002
*        THE CCW'S) ARE USED BY THE ALLOCATE ROUTINES TO READ AND WRITE 10830002
*        THE DSCB'S.                                                    10840002
*********************************************************************** 10842002
         SPACE 1                                                        10850002
DEB      DS    12F                      DEB                             11100002
DEBPTR   DS    F                        DCB POINTER TO DEB              11150002
DCB      EQU   DEBPTR-44                DCB ADDRESS                     11200002
ECB      DS    F                        ECB                             11500002
IOB      DS    8F                       IOB                             11550002
SEEK     DS    D                        DIRECT ACCESS ADDRESS           11600002
         SPACE 1                                                        11650002
*********************************************************************** 11700002
*        COMMON ALLOCATE CHANNEL CONTROL WORDS AREA                     11750002
*********************************************************************** 11800002
         SPACE 1                                                        11850002
CCW1     DS    D                                                        11900002
CCW2     DS    D                                                        11950002
CCW3     DS    D                                                        12000002
CCW4     DS    D                                                        12050002
CCW5     DS    D                                                        12100002
CCW6     DS    D                                                        12150002
CCW7     DS    D                                                        12200002
CCW8     DS    D                                                        12250002
CCW9     DS    D                                                        12300002
CCW10    DS    D                                                        12350002
CCW11    DS    D                                                        12400002
CCW12    DS    D                                                        12450002
CCW13    DS    D                                                        12500002
         SPACE 1                                                        12550002
*********************************************************************** 12600002
*        WORK AREA FIELDS USED BY ALLOCATE                              12650002
*********************************************************************** 12700002
         SPACE 1                                                        12750002
MBBCCHHR EQU   CCW12                    DOUBLEWORD                      12800002
FULLWORD DS    F                        FULLWORD                        12850002
SLOWCCHH DS    F                        CCHH OF THE DIRECTORY EXTENT    12900002
         SPACE 1                                                        12950002
*********************************************************************** 13000002
*        WORK AREA FIELDS USED BY THE VTOC CONVERSION ROUTINES          13050002
*********************************************************************** 13100002
         SPACE 1                                                        13150002
         ORG   CCW13                                                    13200002
F5FNDCT  DS    H                        NUMBER OF F5 DSCB'S FOUND       13250002
*                                       WHILE SEARCHING THE VTOC        13300002
MAXTRK   DS    H                        MAXIMUM TRACKS/CYLINDER         13350002
NEXTEXTN DS    F                        POINTER TO NEXT EXTENT          13400002
LASTF5AD DS    F                        ADDRESS OF LAST REBUILT F5      13450002
F5BLDCT  DS    H                        NUMBER OF REBUILT F5 DSCB'S     13500002
LSTF5CT  DS    H                        NUMBER OF EXTENTS IN LAST F5    13550002
         SPACE 1                                                        13600002
*********************************************************************** 13650002
*        WORK AREA FIELDS USED BY ISAM ALLOCATE                         13700002
*********************************************************************** 13750002
         SPACE 1                                                        13800002
         ORG   SLOWCCHH                                                 13850002
DIRQTY   DS    H                        EMBEDDED INDEX QUANTITY         13900002
PRIQTY   DS    H                        PRIMARY QUANTITY ON THIS VOLUME 13950002
         SPACE 1                                                        14000002
*********************************************************************** 14050002
*        COMMON ALLOCATE POINTERS AND ABSOLUTE TRACK ADDRESSES          14100002
*********************************************************************** 14150002
         SPACE 1                                                        14200002
ATIOTPTR DS    F                        POINTER TO DD ENTRY IN TIOT     14250002
ADSABLST DS    F                        POINTER TO INPUT DSAB LIST      14300002
AJFCBPTR DS    F                        JFCB POINTER                    14350002
TTRLL    DS    XL5                      TTRLL FOR ALLOCATE'S F1 DSCB,   14400002
*                                       F2 DSCB CCHHR FOR ISAM ALLOCATE 14450002
CCHHR    EQU   TTRLL                    CCHHR OF F1 DSCB                14500002
VTOCADR  DS    XL5                      F4 DSCB CCHHR                   14550002
DADSMADR DS    XL5                      F5 DSCB CCHHR                   14600002
COUNT    DS    XL5                      CHANNEL PROGRAM WORK AREA       14650002
IDAREA   EQU   COUNT                    CHANNEL PROGRAM WORK AREA       14700002
FMTINAD  DS    XL5                      CHANNEL PROGRAM WORK AREA       14750002
SAVEADR  EQU   FMTINAD                  F1 DSCB CCHHR FOR ISAM ALLOCATE 14800002
FMTOUTAD DS    XL5                      CHANNEL PROGRAM WORK AREA,      14850002
*                                       F3 DSCB CCHHR FOR ISAM ALLOCATE 14900002
ALLCCHHR DS    XL5                      CCHHR HOLD AREA                 14910002
         DS    XL3                      ALIGNMENT - NOT USED            14920002
MIELNAME DS    CL6                      MINOR ENQ/DEQ RESOURCE NAME     14950002
         SPACE 1                                                        15000002
*********************************************************************** 15050002
*        COMMON ALLOCATE DADSM EXTENT TABLE                             15100002
*********************************************************************** 15150002
         SPACE 1                                                        15200002
DADSMTBL DS    0XL24                    DADSM EXTENT TABLE              15250002
TYPEFLG  DS    XL1                      ALLOCATION TYPE FLAG            15300002
*                                                                       15350002
SMCDONE  EQU   X'80'                    STEP-MUST-COMPLETE ENQ ISSUED   15700002
USRLBL   EQU   X'40'                    USER LABEL TRACK REQUESTED      15750002
DIRREQ   EQU   X'02'                    DIRECTORY EXTENT NEEDED         15800002
*                                                                       15850002
AENTRYNM DS    XL1                      NUMBER OF ENTRIES IN DADSMTBL   15900002
UHOLECTR DS    H                        NUMBER OF USED F0 DSCB'S        15950002
AENTRIES DS    5F                       FIVE EXTENT ENTRIES             16000002
PDLIST1  EQU   AENTRIES+4               PUSHDOWN LIST FOR ALLOCATE      16050002
PDLIST5  DS    F                        5TH WORD OF ALLOCATE'S PDLIST   16100002
         SPACE 1                                                        16150002
*********************************************************************** 16200002
*        WORK AREA FIELDS USED BY THE VTOC CONVERSION ROUTINES          16250002
*********************************************************************** 16300002
         SPACE 1                                                        16350002
PREVF5AD DS    XL5                      VIRTUAL ADDRESS OF PREVIOUS F5  16400002
*                                       DSCB                            16410002
CCHHRSAV DS    XL5                      CCHHR SAVE AREA                 16450002
SAVEXTNT DS    XL5                      F6 DSCB EXTENT SAVE AREA        16500002
         DS    XL15                     UNDEFINED FOR ALLOCATE OR FOR   16550002
*                                       THE VTOC CONVERSION ROUTINES    16600002
         SPACE 1                                                        16650002
*********************************************************************** 16700002
*        WORK AREA FIELDS USED BY ISAM ALLOCATE                         16750002
*********************************************************************** 16800002
         SPACE 1                                                        16850002
         ORG   PDLIST5                                                  16900002
PDLIST   DS    XL25                     PUSHDOWN LIST FOR ISAM ALLOCATE 16950002
TYPE     DS    XL1                      EXTENT TYPE                     17000002
CTR      DS    XL1                      NUMBER OF VOLUMES               17050002
F2       DS    XL1                      BUILD F2 DSCB INDICATOR         17100002
HOWMUCH  DS    F                        TOTAL PRIMARY QUANTITY          17150002
ABSTR    DS    H                        ABSOLUTE TRACK ADDRESS          17200002
         SPACE 1                                                        17250002
*********************************************************************** 17300002
*        COMMON ALLOCATE INTERNAL SWITCHES                              17350002
*********************************************************************** 17400002
         SPACE 1                                                        17450002
ASWITCH  DS    XL1                      ALLOCATE SWITCH                 17500002
         SPACE 1                                                        17550002
*********************************************************************** 17560002
*        BIT SETTINGS USED BY ALLOCATE AND ISAM ALLOCATE                17600002
*********************************************************************** 17650002
         SPACE 1                                                        17700002
WRZERO   EQU   X'80'                    WRITE F0 DSCB                   18150002
RCDALT   EQU   X'40'                    F5 DSCB HAS BEEN MODIFIED       18200002
PRCNTL   EQU   X'20'                    PROCESS CONTROL SWITCH          18250002
WRTFNL   EQU   X'10'                    WRITE FINAL F5 DSCB TO VTOC     18300002
FRSTF5   EQU   X'08'                    FIRST F5 IN WORK AREA           18350002
NEWF5    EQU   X'04'                    NEW F5 DSCB HAS BEEN BUILT      18400002
DADBYP   EQU   X'02'                    BYPASS UPDATING DADSMTBL PTR    18450002
OUTBYP   EQU   X'01'                    BYPASS UPDATING OUTPUT F5 PTR   18500002
         SPACE 1                                                        18550002
*********************************************************************** 18560002
*        BIT SETTINGS USED BY THE VTOC CONVERSION ROUTINES              18600002
*********************************************************************** 18650002
         SPACE 1                                                        18700002
EOVSW    EQU   X'80'                    LAST DSCB IN VTOC HAS BEEN READ 18900002
SPCYLSW  EQU   X'40'                    SPLIT CYLINDER EXTENT FOUND     18950002
MERGESW  EQU   X'20'                    MORE THAN 1 F5 DSCB HAS BEEN    19000002
*                                       CREATED                         19010002
*                                                                       19050002
ACNVSW   DS    XL1                      ADDITIONAL SWITCHES             19100002
*                                                                       19500002
EXTENDID EQU   X'80'                    VTOC CONVERSION ENTERED FROM    19550002
*                                       EXTEND                          19560002
ALLOCID  EQU   X'40'                    VTOC CONVERSION ENTERED FROM    19600002
*                                       ALLOCATE                        19650002
DIRFSET  EQU   X'10'                    VTOC CONVERSION ENTERED         19700002
*                                       BECAUSE DIRF BIT WAS SET        19702002
AI7CNTRL EQU   X'08'                    IGG032I7 ENTRY CONTROL          19710002
AF5ZERO  EQU   X'04'                    F5 DSCB WITH NO EXTENT ENTRIES  19720002
*                                       EXISTS ON VTOC                  19730002
         SPACE 1                                                        19750002
*********************************************************************** 19800002
*        COMMON ALLOCATE RECOVERY ROUTINE AUDIT TRAIL AREA              19850002
*********************************************************************** 19900002
         SPACE 1                                                        19950002
ALLADTRL DS    6F                       ALLOCATE AUDIT TRAIL WORDS      20000002
         AIF   ('&ADT' EQ 'YES').ALL0090                                20050002
         AIF   ('&ADT' EQ 'NO').ALL0100                                 20100002
         IHBERMAC 1001,ADT,&ADT                                         20150002
         AGO   .ALL0100                                                 20200002
.ALL0090 ANOP                                                           20250002
         ORG   ALLADTRL                                                 20300002
         MNOTE '         IECDSECS DSMADT,EXPAND=YES'                    20350002
         IECDSECS DSMADT,EXPAND=YES                                     20400002
.ALL0100 ANOP                                                           20450002
         SPACE 1                                                        20500002
*********************************************************************** 20550002
ALLWAEND EQU   *                        ALLOCATE WORK AREA END          20600002
AWALNGTH EQU   ALLWAEND-AWTGTBL         WORK AREA LENGTH FOR IECRES GET 20650002
*********************************************************************** 20750002
         MEND                                                           20800002
