         MACRO                                                          00050002
         AFFINITY                                                       00100002
         COPY  SGGBLPAK                                                 00150002
         LCLA  &I,&J,&K,&L,&M,&N,&CT,&MASK,&TCPU,&TNME         @ZA27400 00200000
         LCLB  &CPU(16)                                                 00250002
         LCLC  &NAME                                                    00300002
         ACTR   10000                                          OZ00613  00302002
.***** START OF SPECIFICATIONS **************************************   00310002
.*                                                                      00350002
.* MODULE NAME - AFFINITY                                               00360002
.*                                                                      00370002
.* DESCRIPTIVE NAME - CPU AFFINITY SPECIFICATIONS                       00380002
.*                                                                      00390002
.* COPYRIGHT - NONE                                                     00392002
.*                                                                      00394002
.* STATUS - CHANGE LEVEL 01                                             00396002
.*                                                                      00398002
.* FUNCTION -                                                           00398402
.*       THE AFFINITY MACRO IS USED TO SPECIFY THOSE PROGRAMS WHICH     00400002
.*       CAN ONLY RUN ON SOME BUT NOT ALL OF THE CPUS WHICH ARE A       00450002
.*       PART OF THE MULTIPROCESSING SYSTEM.                            00500002
.*                                                                      00550002
.* NOTES - N/A                                                          00560002
.*                                                                      00570002
.* MODULE TYPE - MACRO                                                  00580002
.*                                                                      00590002
.* ENTRY POINT - N/A                                                    00592002
.*                                                                      00594002
.* INPUT - THE FOLLOWING PARAMETERS ARE ALLOWED ON THE AFFINITY MACRO   00596002
.*             AFF-NAME-(CPUA,CPUB---),...                              00600002
.*                                                                      00650002
.*             AFF  - THREE CHARACTER CONSTANT DEPICTING THE BEGINNING  00700002
.*                    OF AN ENTRY.                                      00750002
.*             NAME - NAME OF THE MODULE REQUIRING CPU AFFINITY         00800002
.*             CPUID- CPU NUMBERS ON WHICH THE ABOVE MODULE CAN RUN     00850002
.*                                                                      00900002
.* OUTPUT -                                                             00910002
.*       THE GLOBALS USED ARE -                                         00950002
.*             &SGMENTB(38)  - ENTRY SWITHC                             01000002
.*             &SGAFFNC(1-64)- NAMES REQUIRING CPU AFFINITY             01050002
.*             &SGAFFNA(1-64)- COMBINED MASK OF CPUS FOR THE ABOVE      01100002
.*                             NAMES.                                   01150002
.*                                                                      01200002
.*       THE LOCALS USED ARE -                                          01250002
.*             &I    - INDEX TO SUBLIST                                 01300002
.*             &J    - INDEX TO GLOBALS, VALID ONES                     01350002
.*             &K    - INDEX TO GLOBALS, DUPLICATE CHECK                01400002
.*             &L    - INDEX TO CHARACTERS IN EACH ENTRY                01450002
.*             &M    - NUMBER OF CHARACTERS IN NAME FIELD               01500002
.*             &N    - CHARACTERS IN CPUID                              01510002
.*             &TCPU - TOTAL CPU CHARACTERS                    @ZA27400 01520000
.*             &TNME - TOTAL PROGRAM NAME CHARACTERS           @ZA27400 01530000
.*             &CT   - NUMBER OF CHARACTERS IN EACH OPERAND             01550002
.*             &MASK - TOTAL MASK OF CPU BITS                           01600002
.*             &CPU  - BIT SET WHEN CPU ENCOUNTERED, DUPLICATE CK       01650002
.*             &NAME - SAVE AREA FOR THE NAME                           01700002
.*                                                                      01750002
.* EXIT, NORMAL - N/A                                                   01760002
.*                                                                      01770002
.* EXIT, ERROR - N/A                                                    01780002
.*                                                                      01790002
.* EXTERNAL REFERENCES - N/A                                            01792002
.*                                                                      01794002
.* TABLES - N/A                                                         01796002
.*                                                                      01798002
.* MACROS - NONE                                                        01798402
.*                                                                      01798802
.* CHANGE ACTIVITY - VS01199,OZ00613,@ZA27400                           01799200
.*                                                                      01799602
.****** END OF SPECIFICATIONS ***************************************   01799702
.*       THE FOLLOWING CHECKS FOR A PREVIOUS CALL TO AFFINITY           01800002
.*                                                                      01850002
         AIF   (&SGMENTB(38)).M1   CAN CALL AFFINITY ONLY ONCE          01900002
&SGMENTB(38) SETB 1                INDICATE CALL TO MACRO               01950002
.*                                                                      02000002
.*       THIS SECTION INITIALIZES FOR THE LOOP THROUGH THE OPERANDS     02050002
.*                                                                      02100002
&I       SETA  1                   INDEX TO FIRST OPERAND               02150002
&J       SETA  1                   INDEX TO FIRST SET OF GLOBALS        02200002
&TNME    SETA  1                                               @ZA27400 02210000
&TCPU    SETA  1                                               @ZA27400 02220000
         AIF   (N'&SYSLIST EQ 0).M2 NO OPERANDS SPECIFIED               02250002
.*                                                                      02300002
.*       THIS SECTION LOOPS THROUGH THE CHARACTERS LOOKING FOR A        02350002
.*       VALID PROGRAM NAME AFTER DETERMINING THE ENTRY STARTS          02400002
.*       CORRECTLY.                                                     02450002
.*                                                                      02500002
.LOOP1   ANOP                                                           02550002
         AIF   ('&SGAFFNC(64)' NE '').M8 TOO MANY NAMES                 02600002
&CT      SETA  K'&SYSLIST(&I)      NUMBER OF CHARACTERS IN OPERAND      02650002
         AIF   (&CT LT 7).M3       7 CHARACTER MINIMUM FOR OPERAND      02700002
         AIF   ('&SYSLIST(&I)'(1,4) NE 'AFF-').M3 ENTRY MUST START      02750002
.*                                 WITH AFF- OR IT IS INVALID           02800002
&L       SETA  5                   SET CHAR INDEX TO THE FIRST CHAR     02850002
.*                                 OF THE NAME FIELD                    02900002
         AIF   ('&SYSLIST(&I)'(5,1) GE 'A' AND '&SYSLIST(&I)'(5,1) LE '*02950002
               Z').LOOP2           ALPHABETIC FIRST CHARACTER           03000002
         AIF   ('&SYSLIST(&I)'(5,1) NE '$' AND '&SYSLIST(&I)'(5,1) NE '*03050002
               @' AND '&SYSLIST(&I)'(5,1) NE '#').M4 SPECIAL CHARACTERS 03100002
.*                                 ARE ALLOWED AS FIRST CHARACTER       03150002
.*                                 OF NAMES.                            03200002
.LOOP2   ANOP                                                           03250002
&L       SETA  &L+1                INCREMENT CHARACTER INDEX            03300002
         AIF   (&L GT &CT).M3      ENTRY TERMINATED TOO SOON            03350002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '-').NM1 END OF NAME FOUND      03400002
         AIF   ('&SYSLIST(&I)'(&L,1) GE 'A' AND '&SYSLIST(&I)'(&L,1) LE*03450002
               '9').LOOP2          ALPHAMERIC CHARACTER VALID           03500002
         AIF   ('&SYSLIST(&I)'(&L,1) NE '$' AND '&SYSLIST(&I)'(&L,1) NE*03550002
               '@' AND '&SYSLIST(&I)'(&L,1) NE '#').M4 SPECIAL CHARS OK 03600002
         AGO   .LOOP2              CONTINUE SCANNING NAME               03650002
.NM1     ANOP                                                           03700002
&M       SETA  &L-5                CALCULATE LENGTH OF NAME             03750002
         AIF   (&M GT 8).M4        IF NAME GT 8 CHARS, TOO LONG         03800002
&NAME    SETC  '&SYSLIST(&I)'(5,&M) SPECIFY THE CHARS IN THE NAME       03850002
.*                                                                      03900002
.*       CHECK FOR DUPLICATE NAMES IN GLOBALS, IGNORE IF A DUPLICATE.   03950002
.*                                                                      04000002
&K       SETA  1                   INITIALIZE DUPLICATE CK INDEX        04050002
.LOOP3   AIF   (&K EQ &J).NOTDUP   IF EXHAUST LIST, NAME IS NOT DUP     04100002
         AIF   ('&SGAFFNC(&K)' EQ '&NAME').M5 DUPLICATE FOUND           04150002
&K       SETA  &K+1                INCREMENT DUP INDEX                  04200002
         AGO   .LOOP3              CONTINUE SEARCH FOR DUPLICATE        04250002
.*                                                                      04300002
.*       NAME IS VALID, CHECK CPU IDS. 0 THROUGH 15 IS ALLOWED          04350002
.*                                                                      04400002
.NOTDUP  ANOP                                                           04450002
.*   INCREMENT TOTAL PROG CHARACTER COUNT INCLUDING THE COMMA  @ZA27400 04460000
&TNME    SETA  &TNME+(&M+1)                                    @ZA27400 04470000
         AIF   (&TNME GT 255).M10  ERROR IF MORE THAN 255      @ZA27400 04480000
&MASK    SETA  0                   INIT MASK TO ZERO                    04500002
&L       SETA  &L+1                GET TO FIRST CHAR OF CPUS            04550002
&CPU(1)  SETB  0                   INIT CPU 0 SWITCH                    04600002
&CPU(2)  SETB  0                   INIT CPU 1 SWITCH                    04650002
&CPU(3)  SETB  0                   INIT CPU 2 SWITCH                    04700002
&CPU(4)  SETB  0                   INIT CPU 3 SWITCH                    04750002
&CPU(5)  SETB  0                   INIT CPU 4 SWITCH                    04800002
&CPU(6)  SETB  0                   INIT CPU 5 SWITCH                    04850002
&CPU(7)  SETB  0                   INIT CPU 6 SWITCH                    04900002
&CPU(8)  SETB  0                   INIT CPU 7 SWITCH                    04950002
&CPU(9)  SETB  0                   INIT CPU 8 SWITCH                    05000002
&CPU(10) SETB  0                   INIT CPU 9 SWITCH                    05050002
&CPU(11) SETB  0                   INIT CPU 10 SWITCH                   05100002
&CPU(12) SETB  0                   INIT CPU 11 SWITCH                   05150002
&CPU(13) SETB  0                   INIT CPU 12 SWITCH                   05200002
&CPU(14) SETB  0                   INIT CPU 13 SWITCH                   05250002
&CPU(15) SETB  0                   INIT CPU 14 SWITCH                   05300002
&CPU(16) SETB  0                   INIT CPU 15 SWITCH                   05350002
         AIF   (&L GT &CT).M3      ENTRY TERMINATED TOO SOON            05400002
         AIF   ('&SYSLIST(&I)'(&L,1) NE '(').ONE ONLY ONE CPU SPEC.     05450002
&L       SETA  &L+1                INCR CHAR CTR TO NEXT CHAR           05500002
.LOOP4   AIF   (&L GT &CT-1).M9    INVALID SYNTAX IN CPU IDS            05550002
&N       SETA  1                   INDICATE NO OF CHARS IN CPUID        05600002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '0').CPU0 CPU 0 SPECIFIED       05650002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '1' AND ('&SYSLIST(&I)'(&L+1,1)*05700002
                EQ ')' OR '&SYSLIST(&I)'(&L+1,1) EQ ',')).CPU1          05750002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '2').CPU2 CPU 2 SPECIFIED       05800002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '3').CPU3 CPU 3 SPECIFIED       05850002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '4').CPU4 CPU 4 SPECIFIED       05900002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '5').CPU5 CPU 5 SPECIFIED       05950002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '6').CPU6 CPU 6 SPECIFIED       06000002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '7').CPU7 CPU 7 SPECIFIED       06050002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '8').CPU8 CPU 8 SPECIFIED       06100002
         AIF   ('&SYSLIST(&I)'(&L,1) EQ '9').CPU9 CPU 9 SPECIFIED       06150002
         AIF   (&L GT &CT-2).M9    INVALID SYNTAX IN CPU IDS            06200002
&N       SETA  2                   NO CHARS IN CPU ID                   06250002
         AIF   ('&SYSLIST(&I)'(&L,2) EQ '10').CPU10 CPU 10 SPECIFIED    06300002
         AIF   ('&SYSLIST(&I)'(&L,2) EQ '11').CPU11 CPU 11 SPECIFIED    06350002
         AIF   ('&SYSLIST(&I)'(&L,2) EQ '12').CPU12 CPU 12 SPECIFIED    06400002
         AIF   ('&SYSLIST(&I)'(&L,2) EQ '13').CPU13 CPU 13 SPECIFIED    06450002
         AIF   ('&SYSLIST(&I)'(&L,2) EQ '14').CPU14 CPU 14 SPECIFIED    06500002
         AIF   ('&SYSLIST(&I)'(&L,2) NE '15').M6 CPUID NOT 0 TO 15      06550002
         AIF   (&CPU(16)).M7       DUPLICATE CPU CHECK                  06600002
&CPU(16) SETB  1                   INDICATE CPU 15 ENTRY                06650002
&MASK    SETA  &MASK+1             SET MASK FOR CPU 15                  06700002
         AGO   .CONT                                                    06750002
.CPU14   AIF   (&CPU(15)).M7       DUPLICATE CPU CHECK                  06800002
&CPU(15) SETB  1                   INDICATE CPU 14 ENTRY                06850002
&MASK    SETA  &MASK+2             SET MASK FOR CPU 14                  06900002
         AGO   .CONT                                                    06950002
.CPU13   AIF   (&CPU(14)).M7       DUPLICATE CPU CHECK                  07000002
&CPU(14) SETB  1                   INDICATE CPU 13 ENTRY                07050002
&MASK    SETA  &MASK+4             SET MASK FOR CPU 13                  07100002
         AGO   .CONT                                                    07150002
.CPU12   AIF   (&CPU(13)).M7       DUPLICATE CPU CHECK                  07200002
&CPU(13) SETB  1                   INDICATE CPU 12 ENTRY                07250002
&MASK    SETA  &MASK+8             SET MASK FOR CPU 12                  07300002
         AGO   .CONT                                                    07350002
.CPU11   AIF   (&CPU(12)).M7       DUPLICATE CPU CHECK                  07400002
&CPU(12) SETB  1                   INDICATE CPU 11 ENTRY                07450002
&MASK    SETA  &MASK+16            SET MASK FOR CPU 11                  07500002
         AGO   .CONT                                                    07550002
.CPU10   AIF   (&CPU(11)).M7       DUPLICATE CPU CHECK                  07600002
&CPU(11) SETB  1                   INDICATE CPU 10 ENTRY                07650002
&MASK    SETA  &MASK+32            SET MASK FOR CPU 10                  07700002
         AGO   .CONT                                                    07750002
.CPU9    AIF   (&CPU(10)).M7       DUPLICATE CPU CHECK                  07800002
&CPU(10) SETB  1                   INDICATE CPU 9 ENTRY                 07850002
&MASK    SETA  &MASK+64            SET MASK FOR CPU 9                   07900002
         AGO   .CONT                                                    07950002
.CPU8    AIF   (&CPU(9)).M7        DUPLICATE CPU CHECK                  08000002
&CPU(9)  SETB  1                   INDICATE CPU 8 ENTRY                 08050002
&MASK    SETA  &MASK+128           SET MASK FOR CPU 8                   08100002
         AGO   .CONT                                                    08150002
.CPU7    AIF   (&CPU(8)).M7        DUPLICATE CPU CHECK                  08200002
&CPU(8)  SETB  1                   INDICATE CPU 7 ENTRY                 08250002
&MASK    SETA  &MASK+256           SET MASK FOR CPU 7                   08300002
         AGO   .CONT                                                    08350002
.CPU6    AIF   (&CPU(7)).M7        DUPLICATE CPU CHECK                  08400002
&CPU(7)  SETB  1                   INDICATE CPU 6 ENTRY                 08450002
&MASK    SETA  &MASK+512           SET MASK FOR CPU 6                   08500002
         AGO   .CONT                                                    08550002
.CPU5    AIF   (&CPU(6)).M7        DUPLICATE CPU CHECK                  08600002
&CPU(6)  SETB  1                   INDICATE CPU 5 ENTRY                 08650002
&MASK    SETA  &MASK+1024          SET MASK FOR CPU 5                   08700002
         AGO   .CONT                                                    08750002
.CPU4    AIF   (&CPU(5)).M7        DUPLICATE CPU CHECK                  08800002
&CPU(5)  SETB  1                   INDICATE CPU 4 ENTRY                 08850002
&MASK    SETA  &MASK+2048          SET MASK FOR CPU 4                   08900002
         AGO   .CONT                                                    08950002
.CPU3    AIF   (&CPU(4)).M7        DUPLICATE CPU CHECK                  09000002
&CPU(4)  SETB  1                   INDICATE CPU 3 ENTRY                 09050002
&MASK    SETA  &MASK+4096          SET MASK FOR CPU 3                   09100002
         AGO   .CONT                                                    09150002
.CPU2    AIF   (&CPU(3)).M7        DUPLICATE CPU CHECK                  09200002
&CPU(3)  SETB  1                   INDICATE CPU 2 ENTRY                 09250002
&MASK    SETA  &MASK+8192          SET MASK FOR CPU 2                   09300002
         AGO   .CONT                                                    09350002
.CPU1    AIF   (&CPU(2)).M7        DUPLICATE CPU CHECK                  09400002
&CPU(2)  SETB  1                   INDICATE CPU 1 ENTRY                 09450002
&MASK    SETA  &MASK+16384         SET MASK FOR CPU 1                   09500002
         AGO   .CONT                                                    09550002
.CPU0    AIF   (&CPU(1)).M7        DUPLICATE CPU CHECK                  09600002
&CPU(1)  SETB  1                   INDICATE CPU 0 ENTRY                 09650002
&MASK    SETA  &MASK+32768         SET MASK FOR CPU 0                   09700002
.CONT    AIF   ('&SYSLIST(&I)'(&L+&N,1) EQ ')').ENDCK                   09750002
         AIF   ('&SYSLIST(&I)'(&L+&N,1) NE ',').M9                      09800002
&L       SETA  &L+&N+1             INCREMENT COUNTER                    09850002
         AGO   .LOOP4              CONTINUE CPUID SCAN                  09900002
.ENDCK   AIF   (&L+&N NE &CT).M3   END OF PARAMETER HERE                09950002
.UPDTGLB ANOP                                                           10000002
&SGAFFNC(&J) SETC '&NAME'          SET NAME GLOBAL                      10050002
&SGAFFNA(&J) SETA &MASK            SET MASK GLOBAL                      10100002
.* ROUTINE TO CALC TOTAL CPU ID CHARACTERS INC TWO PARENS      @ZA27400 10102000
.*                   CPU ID LENGTH = 5 IF GE 10000             @ZA27400 10104000
         AIF   (&MASK LT 10000).LGTH5                          @ZA27400 10106000
&TCPU    SETA  &TCPU+6             INCREMENT TOTAL CPU CHARS   @ZA27400 10108000
         AGO   .TESTT                                          @ZA27400 10110000
.LGTH5   AIF   (&MASK LT 1000).LGTH4 CPU ID LGTH=4 IF GE 1000  @ZA27400 10112000
&TCPU    SETA  &TCPU+5             INCREMENT TOTAL CPU CHARS   @ZA27400 10114000
         AGO   .TESTT                                          @ZA27400 10116000
.LGTH4   AIF   (&MASK LT 100).LGTH3  CPU ID LGTH=3 IF GE 100   @ZA27400 10118000
&TCPU    SETA  &TCPU+4             INCREMENT TOTAL CPU CHARS   @ZA27400 10120000
         AGO   .TESTT                                          @ZA27400 10122000
.LGTH3   AIF   (&MASK LT 10).LGTH2   CPU ID LGTH=2 IF GE 10    @ZA27400 10124000
&TCPU    SETA  &TCPU+3             INCREMENT TOTAL CPU CHARS   @ZA27400 10126000
         AGO   .TESTT                                          @ZA27400 10128000
.LGTH2   ANOP                        CPU ID LGTH=1             @ZA27400 10130000
&TCPU    SETA  &TCPU+2             INCREMENT TOTAL CPU CHARS   @ZA27400 10132000
.TESTT   AIF   (&TCPU GT 255).M11  TOTAL CPU CHAR GT 255       @ZA27400 10134000
         MNOTE *,'PROGRAM &NAME AVAILABLE FOR CPUS MASKED AS &MASK'     10150002
&J       SETA  &J+1                INCREMENT GLOBAL INDEX               10200002
.LOOP5   ANOP                                                           10250002
&I       SETA  &I+1                INCREMENT PARAMETER INDEX            10300002
         AIF   (N'&SYSLIST LT &I).MEND END OF ENTRIES                   10350002
         AGO   .LOOP1              NO, CONTINUE LOOP                    10450002
.ONE     AIF   (&CT EQ &L).N10     ONE CHARACTER FIELD                  10500002
         AIF   (&CT NE &L+1).M3    IF MORE THAN TWO, ERROR              10550002
         AIF   ('&SYSLIST(&I)'(&L,2) NE '15').N15 NOT A 15              10600002
&MASK    SETA  1                   SET MASK FOR 15                      10650002
         AGO   .UPDTGLB            UPDATE GLOBALS                       10700002
.N15     AIF   ('&SYSLIST(&I)'(&L,2) NE '14').N14 NOT A 14              10750002
&MASK    SETA  2                   SET MASK FOR 14                      10800002
         AGO   .UPDTGLB            UPDATE GLOBALS                       10850002
.N14     AIF   ('&SYSLIST(&I)'(&L,2) NE '13').N13 NOT A 13              10900002
&MASK    SETA  4                   SET MASK FOR 13                      10950002
         AGO   .UPDTGLB            UPDATE GLOBALS                       11000002
.N13     AIF   ('&SYSLIST(&I)'(&L,2) NE '12').N12 NOT A 12              11050002
&MASK    SETA  8                   SET MASK FOR 12                      11100002
         AGO   .UPDTGLB            UPDATE GLOBALS                       11150002
.N12     AIF   ('&SYSLIST(&I)'(&L,2) NE '11').N11 NOT A 11              11200002
&MASK    SETA  16                  SET MASK FOR 11                      11250002
         AGO   .UPDTGLB            UPDATE GLOBALS                       11300002
.N11     AIF   ('&SYSLIST(&I)'(&L,2) NE '10').M8 NOT A 10               11350002
&MASK    SETA  32                  SET MASK FOR 10                      11400002
         AGO   .UPDTGLB            UPDATE GLOBALS                       11450002
.N10     AIF   ('&SYSLIST(&I)'(&L,1) NE '9').N9 NOT A 9                 11500002
&MASK    SETA  64                  SET MASK FOR 9                       11550002
         AGO   .UPDTGLB            UPDATE GLOBALS                       11600002
.N9      AIF   ('&SYSLIST(&I)'(&L,1) NE '8').N8 NOT A 8                 11650002
&MASK    SETA  128                 SET MASK FOR 8                       11700002
         AGO   .UPDTGLB            UPDATE GLOBALS                       11750002
.N8      AIF   ('&SYSLIST(&I)'(&L,1) NE '7').N7 NOT A 7                 11800002
&MASK    SETA  256                 SET MASK FOR 7                       11850002
         AGO   .UPDTGLB            UPDATE GLOBALS                       11900002
.N7      AIF   ('&SYSLIST(&I)'(&L,1) NE '6').N6 NOT A 6                 11950002
&MASK    SETA  512                 SET MASK FOR 6                       12000002
         AGO   .UPDTGLB            UPDATE GLOBALS                       12050002
.N6      AIF   ('&SYSLIST(&I)'(&L,1) NE '5').N5 NOT A 5                 12100002
&MASK    SETA  1024                SET MASK FOR 5                       12150002
         AGO   .UPDTGLB            UPDATE GLOBALS                       12200002
.N5      AIF   ('&SYSLIST(&I)'(&L,1) NE '4').N4 NOT A 4                 12250002
&MASK    SETA  2048                SET MASK FOR 4                       12300002
         AGO   .UPDTGLB            UPDATE GLOBALS                       12350002
.N4      AIF   ('&SYSLIST(&I)'(&L,1) NE '3').N3 NOT A 3                 12400002
&MASK    SETA  4096                SET MASK FOR 3                       12450002
         AGO   .UPDTGLB            UPDATE GLOBALS                       12500002
.N3      AIF   ('&SYSLIST(&I)'(&L,1) NE '2').N2 NOT A 2                 12550002
&MASK    SETA  8192                SET MASK FOR 2                       12600002
         AGO   .UPDTGLB            UPDATE GLOBALS                       12650002
.N2      AIF   ('&SYSLIST(&I)'(&L,1) NE '1').N1 NOT A 1                 12700002
&MASK    SETA  16384               SET MASK FOR 1                       12750002
         AGO   .UPDTGLB            UPDATE GLOBALS                       12800002
.N1      AIF   ('&SYSLIST(&I)'(&L,1) NE '0').M6 NOT A 0                 12850002
&MASK    SETA  32768               SET MASK FOR 0                       12900002
         AGO   .UPDTGLB            UPDATE GLOBALS                       12950002
.*                                                                      13000002
.*       MESSAGES - WARNING AND ERROR                                   13050002
.*                                                                      13100002
.M1      MNOTE 5,'* * * IEIAFF001 AFFINITY MAY BE SPECIFIED ONLY ONCE'  13150002
&SGQUITB SETB  1                   QUIT SWITCH                          13200002
         MEXIT                                                          13250002
.M2      MNOTE 5,'* * * IEIAFF002 NO OPERANDS SPECIFIED ON AFFINITY'    13300002
&SGQUITB SETB  1                   QUIT SWITCH                          13350002
         MEXIT                                                          13400002
.M3      MNOTE 5,'* * * IEIAFF003 GENERAL SYNTAX OF OPERAND INVALID'    13450002
&SGQUITB SETB  1                   QUIT SWITCH                          13500002
         MEXIT                                                          13550002
.M4    MNOTE 5,'* * * IEIAFF004 INVALID PROGRAM NAME &SYSLIST(&I)(5,8)' 13600002
&SGQUITB SETB  1                   QUIT SWITCH                          13650002
         MEXIT                                                          13700002
.M5      MNOTE *,'* * * IEIAFF005 DUPLICATE NAME &NAME'                 13750002
         AGO   .LOOP5              LOOK AT NEXT ENTRY                   13800002
.M6     MNOTE 5,'* * * IEIAFF006 CPU ID NOT BETWEEN 0 AND 15 &SYSLIST(&*13850002
               I)(&L,2)'                                                13900002
&SGQUITB SETB  1                   QUIT SWITCH                          13950002
         MEXIT                                                          14000002
.M7     MNOTE *,'* * * IEIAFF007 DUPLICATE CPU SPECIFICATION &SYSLIST(&*14050002
               I)(&L,2)'                                                14100002
         AGO   .CONT               CONTINUE SCAN                        14150002
.M8     MNOTE 0,'* * * IEIAFF008 MORE THAN 64 NAMES SPECIFIED. THE LAST*14200002
                ARE IGNORED'                                            14250002
            AGO .MEND                                                   14260002
.M9  MNOTE  5,'* * * IEIAFF009 INVALID SYNTAX IN CPUIDS, ENTRY &I'      14270002
&SGQUITB SETB  1                   QUIT SWITCH                          14280002
         AGO   .NOTDUP                                                  14290002
.M10 MNOTE  5,'* * * IEIAFF010 TOTAL CHARACTERS IN PROGRAM NAMES EXCEED*14300000
                255.'                                          @ZA27400 14350000
&SGQUITB SETB  1                   QUIT SWITCH                 @ZA27400 14400000
         MEXIT                                                 @ZA27400 14450000
.M11 MNOTE  5,'* * * IEIAFF011 TOTAL CHARACTERS IN CPU IDS EXCEEDS 255' 14500000
.*                                                             @ZA27400 14550000
&SGQUITB SETB  1                   QUIT SWITCH                 @ZA27400 14600000
         MEXIT                                                 @ZA27400 14650000
.MEND    MEND                                                           14700000
