         MACRO                                                          00100003
         CUPOINT                                                        00200003
         COPY  SGGBLPAK                                                 00300003
         LCLA  &M,&K,&J,&I,&A,&B,&T,&T1                         Z40ASVN 00400037
         ACTR  &SGACTR                                                  00500003
.***** START OF SPECIFICATIONS **************************************   00600003
.*                                                                      00700003
.* MODULE NAME - CUPOINT                                                00800003
.*                                                                      00900003
.* DESCRIPTIVE NAME - CUPOINT                                           01000003
.*                                                                      01100003
.* COPYRIGHT - NONE                                                     01200003
.*                                                                      01300003
.* STATUS - CHANGE LEVEL 04                                             01400037
.*                                                                      01500003
.* FUNCTION -                                                           01600003
.*       THE CUPOINT MACRO IS USED TO CHECK THE NUMBER OF DEVICES AND   01700003
.*       ALSO TO SORT AND PRINT THEM IN SEQUENTIAL ORDER FOR THE USER.  01800003
.*                                                                      01900003
.* NOTES - N/A                                                          02000003
.*                                                                      02100003
.* MODULE TYPE - MACRO                                                  02200003
.*                                                                      02300003
.* ENTRY POINT - N/A                                                    02400003
.*                                                                      02500003
.* INPUT - THE IODEVICES AS THEY ARE IN THE DADRA BOX                   02600003
.*          &SGACTR     - NUMBER OF AIF AND AGO STATEMENTS TO BE        02700003
.*                        EXECUTED IN THIS MACRO.                       02800003
.*          &SGCNTRA(3) - THE COUNT OF ACTUAL DEVICES IN THE SYSTEM     02900003
.*          &SGDADRA    - CONTAINS THE IO ADDRESSES OF ALL DEVICES      03000003
.*                        WHEN THIS GLOBAL IS SUBSCRIPTED.              03100003
.*          &SGDASPA    - CONTAINS THE SWITCH POINTER (UCB NUMBER)      03101037
.*                                                                      03200003
.* OUTPUT - ADDRESSES PRINTED IN THE STAGE ONE LISTING                  03300003
.*       GLOBALS USED ARE -                                             03400003
.*             &EBCDIC      - THE ADDRESS CONVERTED TO EBCDIC           03500003
.*             &SGQUITB     - QUIT SWITCH                               03600003
.*                                                                      03700003
.*       LOCALS USED ARE -                                              03800003
.*             &A      - SET TO ADDRESS AND CONVERTED TO EBCDIC.        03900003
.*             &B      - COUNTER TO PRINT ALL DEVICES.                  04000003
.*             &I      - SUBSCRIPT INTO DADRA BOX.                      04100003
.*             &J      - OUTER INDEX VALUE.                             04200003
.*             &K      - SET TO CHECK IF AT END OF A PASS.              04300003
.*             &M      - THE NUMBER OF IODEVICES IN SYSTEM.             04400003
.*             &T      - SET IF TWO EQUAL ADDRESSES FOUND.              04500003
.*             &T1     - USED IN SORTING &SGDASPA                       04501037
.*                                                                      04600003
.* EXIT, NORMAL - N/A                                                   04700003
.*                                                                      04800003
.* EXIT, ERROR - N/A                                                    04900003
.*                                                                      05000003
.* EXTERNAL REFERENCES - N/A                                            05100003
.*                                                                      05200003
.* TABLES - N/A                                                         05300003
.*                                                                      05400003
.* MACROS - NONE                                                        05500003
.*                                                                      05600003
.* CHANGE ACTIVITY - Z30AALG,Z40ASVN                                    05700037
.*                                                                      05800003
.****** END OF SPECIFICATIONS ***************************************   05900003
.L1      AIF   (&SGCNTRA(3) LT 2 OR &SGCNTRA(3) GT 1917).L8     Z40ASVN 06000037
&M       SETA  &SGCNTRA(3)  GET THE NUMBER OF IO DEVICE ADDRESSES.      06100003
.L2      AIF   (&M/2 LE 0).L6  TRANSFER OUT IO DEVICE ADDRESS SORTED.   06200003
&M       SETA  &M/2  SET INDEX TO OFF SET FOR SECOND IO DEVICE ADDRESS. 06300003
&K       SETA  &SGCNTRA(3)-&M  SET VALUE TO CHECK END OF PASS.          06400003
&J       SETA  1  SET OUTER INDEX VALUE.                                06500003
.L3      ANOP    RETURN TO CONTINUE PASS AT SAME INCREMENT.             06600003
&I       SETA  &J  SET INDEX TO FIRST IO DEVICE ADDRESS.                06700003
.L4      AIF   (&SGDADRA(&I)-&SGDADRA(&I)/4096*4096 LT &SGDADRA(&I+&M)-106800003
               &SGDADRA(&I+&M)/4096*4096).L5  TRANSFER DEVICES ORDERED. 06900003
         AIF   (&SGDADRA(&I)-&SGDADRA(&I)/4096*4096 EQ &SGDADRA(&I+&M)-107000003
               &SGDADRA(&I+&M)/4096*4096).L9  ERROR DEVICES EQUAL.      07100003
.LA      ANOP                                                           07200003
&T       SETA  &SGDADRA(&I)  IO ADDRESS OUT OF ORDER.                   07300003
&SGDADRA(&I) SETA &SGDADRA(&I+&M)  SAVE FIRST ADDRESS AND PUT SECOND    07400003
&SGDADRA(&I+&M) SETA &T  ADDRESS IN FIRST. THEN PUT FIRST IN SECOND.    07500003
&T1      SETA  &SGDASPA(&I)             DO                      Z40ASVN 07510037
&SGDASPA(&I) SETA &SGDASPA(&I+&M)       IT                      Z40ASVN 07511037
&SGDASPA(&I+&M) SETA &T1                AGAIN                   Z40ASVN 07512037
&I       SETA  &I-&M  RESET INNER INDEX TO MOVE ADDRESS FURTHER BACK.   07600003
         AIF   (&I GE 1).L4  TRANSFER TO MOVE ADDRESS FURTHER BACK.     07700037
.L5      AIF   (&J+1 GT &K).L2  TRANSFER FOR ANOTHER PASS.              07800003
&J       SETA  &J+1  STEP OUTER INDEX BY ONE.                           07900003
         AGO   .L3  TRANSFER TO CONTINUE PASS AT SAME INCREMENT.        08000003
.L8 MNOTE 5,'* * * IEIGEN120 INVALID NUMBER OF IO DEVICES'              08100003
&SGQUITB SETB  1                                                        08200003
         AIF   (&SGCNTRA(3) LT 2).E2                                    08300003
&SGCNTRA(3)  SETA  1917                                         Z40ASVN 08400037
         AGO   .L1                                                      08500003
.L9      ANOP                                                           08600003
&A       SETA  &SGDADRA(&I)-&SGDADRA(&I)/4096*4096                      08700003
         CONVERT TO=EBCDIC,VALUE=&A,DIGITS=3                            08800003
    MNOTE 5,'* * * IEIGEN121 TWO EQUAL IO ADDRESSES &EBCDIC'            08900003
&SGQUITB SETB  1                                                        09000003
         AGO   .LA                                                      09100003
.L6 MNOTE *,'      THE SORTED DEVICE A BOXES CONTAIN:'                  09200037
    MNOTE *,'         SEQ  ADDRESS  DEVICE POINTER C.U. POINTER'        09300003
&B       SETA  0                                                        09400003
.E1      AIF   (&B EQ &SGCNTRA(3)).E2                                   09500003
&B       SETA  &B+1                                                     09600003
&I SETA &SGDADRA(&B)/4096-&SGDADRA(&B)/1048576*256   GET CU POINTER     09700003
&J SETA &SGDASPA(&B)                    GET DEVICE POINTER      Z40ASVN 09800037
&A SETA &SGDADRA(&B)-&SGDADRA(&B)/4096*4096                             09900003
         CONVERT  TO=EBCDIC,DIGITS=3,VALUE=&A                           10000003
    MNOTE *,'         &B   &EBCDIC        &J              &I'           10100003
         AGO   .E1                                                      10200003
.E2      MEND                                                           10300003
