         MACRO                                                          00900013
    SGIEC2PT   &UCBNO,&DEVAD,&TYPC,&DEVTAB,&STATAB,&LCHN,&DEVNDX,&ALOCC*01800013
               NT,&SYSRES,&SQOPT,&OFF                            Y02146 02700002
.*                                                                      02750002
.* CHANGE ACTIVITY                                                      02800002
.*            APARS                     PTMS                            02850002
.*        YA02442  (10/22/73)       YM0160  (8/16/73)                   02900002
.*        YA03245  (1/30/74)        YM5809  (2/1/74) = YA03252          02910000
.*        YA03252  (1/30/74)                                            02920000
.*        OZ00522  (8/16/74)                                            02930000
.*        ZA02837  (2/19/75)                                LG @ZA02837 02940000
.*        AZ04864  (02/23/76)                                  @ZA04864 02950000
.*        AZ15410  (11/15/76)                                           03150000
.*        AZ20108  (05/25/77)                                           03350000
.*        AZ25208  (07/29/77)                                           03400000
         COPY  SGGBLPAK                                                 03600013
         LCLA  &SCR,&CHNL,&TUCB                               LF YM0160 04500002
         LCLA  &LCHCNT,&COUNTB,&COUNTCU                                 05400013
         LCLC  &TYPEA,&ERRTAB,&CHNLAD                                   06000018
&CHNLAD  SETC  '&DEVAD'(1,1)                                            06600018
&LCHCNT  SETA  0                                                        07200013
&COUNTB  SETA  &SGDASPA(&UCBNO)                                @ZA15410 08100000
&COUNTCU SETA  &COUNTB                                                  08600002
&TUCB    SETA  &UCBNO+1    CALC TAG UCB FOR PUNCHED AGO STM   LF YM0160 08650002
         AIF   (NOT (&SGDT12B(&COUNTB) AND &SGDU10B(&COUNTB))).SSERR0   08658000
&ERRTAB  SETC  '00'                                            @AZ25208 08666000
&TYPEA   SETC  '500040F1'                                      @AZ25208 08674000
         AGO   .UCB0P2                                         @AZ25208 08682000
.SSERR0  ANOP                                                  @AZ25208 08690000
         AIF   (NOT (&SGDT12B(&COUNTB) AND &SGDU05B(&COUNTB))).SSERR1   08700020
&ERRTAB  SETC  'C7'                                                000R 08800020
&TYPEA   SETC  '50004014'                                          000R 08900020
         AGO   .UCB0P2                                             000R 09000020
.SSERR1  AIF   (NOT &SGDAD7B(&COUNTB)).SSERR                       000R 09100020
&ERRTAB  SETC  '2B'                                                     09200014
         AGO   .SETCU                                              000T 09300020
.SSERR   ANOP                                                           09400014
         AIF   (NOT (&SGDT12B(&COUNTB) AND                             *09450000
               (&SGDU06B(&COUNTB) OR &SGDU07B(&COUNTB)))).SSERR2  Z2837 09460000
         AIF   (NOT &SGDAD1B(&COUNTB)).RNCHMX                     21101 09500002
&TYPEA   SETC  '50004015'                                         21101 09550002
&ERRTAB  SETC  '31'                                         LD @ZA00522 09560000
         AGO   .UCB0P2                                          YA03245 09570000
.RNCHMX  AIF   (NOT &SGDAD2B(&COUNTB)).SSERR2                     21101 09650002
&TYPEA   SETC  '50004025'                                         21101 09700002
.*           ONE LINE DELETED BY THE FOLLOWING APAR:            YA03245 09750000
&ERRTAB  SETC  '31'                                               21101 09800002
         AGO   .UCB0P2                                            M1257 09850002
.SSERR2  ANOP                                                           09860002
&ERRTAB  SETC  '29'                                                     09900013
.SETCU   ANOP                                                      000T 10100020
         AIF   (&SGDT12B(&COUNTB) AND &SGDU04B(&COUNTB) AND &SGDCLSB(33*10300002
               ) AND &SGDCLSB(67)).IBM7770                        M3967 10500002
.CU2702  AIF   (NOT (&SGUNT2B(&COUNTCU) AND &SGUNU2B(&COUNTCU))).CU2701 10800014
&TYPEA   SETC  '50004001'               SET 2702 BASIC                  11700013
         AGO   .ACALANS                                                 12600013
.CU2701  AIF   (NOT (&SGUNT2B(&COUNTCU) AND &SGUNU1B(&COUNTCU))).CU2703 13500013
&TYPEA   SETC  '50004002'               SET 2701 BASIC                  14400013
         AGO   .ACALANS                                                 15300013
.CU2703  ANOP                                                      000T 16200020
&TYPEA   SETC  '50004003'                                               17100013
         AGO   .ACALANS                                            000T 17300020
.IBM7770 ANOP                                                      000T 17500020
&TYPEA   SETC  '51904000'                                        A42394 17700002
.*       THE FOLLOWING LINE CORRECTS APAR YA02442               YA03252 17750000
         AGO   .UCB0P1                                          YA03252 17800000
.ACALANS ANOP                                                           18000013
&CHNL    SETA  1                                                  M0923 18050002
.CHNLP   AIF   ('&CHNLAD' EQ '0123456789ABCDEF'(&CHNL,1)).CHNOUT  M0923 18060002
&CHNL    SETA  &CHNL+1                                            M0923 18070002
         AGO   .CHNLP                                             M0923 18080002
.CHNOUT  ANOP                                                     M0923 18090002
&CHNL    SETA  &CHNL-1                                            M0923 18100002
         AIF   (NOT &SGCHANB(&CHNL*15+3)).MULTPLX                       18200020
&TYPEA   SETC  '7'.'&TYPEA'(2,7)                                        18400014
.MULTPLX ANOP                                                           18600014
         AIF   (NOT &SGDAD7B(&COUNTB)).SETFEAT    IS THIS SDA2?         18630019
         AIF   (NOT &SGDU08B(&COUNTB)).SWITCH     BSC3 HAS POLLING      18660019
&SGDF01B(&COUNTB) SETB 1                                                18690019
         AGO   .SETFEAT                                                 18720019
.SWITCH  AIF   (NOT &SGDU07B(&COUNTB)).SETFEAT    BSC2 HAS SWITCHED     18750019
&SGDF02B(&COUNTB) SETB 1                                                18780019
&SGDF03B(&COUNTB) SETB 1                                                18810019
.*                                                                      18840019
.SETFEAT ANOP                                                           18870019
         AIF   (NOT &SGDF01B(&COUNTB)).AUTOCAL    IS IT AUTOPOLL        18900013
&LCHCNT  SETA  &LCHCNT+64                                               19800013
.AUTOCAL AIF   (NOT &SGDF02B(&COUNTB)).AUTOANS    AUTOCALL              20700013
&LCHCNT  SETA  &LCHCNT+128                                              21600013
.AUTOANS AIF   (NOT &SGDF03B(&COUNTB)).CHECKNG    AUTOANSWER            22500013
&LCHCNT  SETA  &LCHCNT+16                                               23400013
.CHECKNG AIF   (NOT &SGDF06B(&COUNTB)).SCONTRL    CHECKING              24300013
&LCHCNT  SETA  &LCHCNT+32                                               25200013
.SCONTRL AIF   (NOT &SGDF04B(&COUNTB)).XCONTRL    SCONTROL              26100013
&LCHCNT  SETA  &LCHCNT+8                                                27000013
.XCONTRL  AIF  (NOT &SGDF05B(&COUNTB)).OIU        XCONTROL         000K 27900018
&LCHCNT  SETA  &LCHCNT+4                                                28800013
.OIU      AIF  (NOT &SGDF07B(&COUNTB)).CHKSAD     OIU              000K 29100018
&LCHCNT   SETA &LCHCNT+4+8                                         000K 29400018
.CHKSAD  AIF   (&SGDM01B(&COUNTB)).TPADPCK                              29700013
         AIF   (NOT &SGDM02B(&COUNTB)).SAD2                             30600013
&LCHCNT  SETA  &LCHCNT+1                          SET SAD 1             31500013
.SAD2    AIF   (NOT &SGDM03B(&COUNTB)).SAD3                             32400013
&LCHCNT  SETA  &LCHCNT+2                          SET SAD 2             33300013
.SAD3    AIF   (NOT &SGDM04B(&COUNTB)).TPADPCK                          34200013
&LCHCNT  SETA  &LCHCNT+3                                                35100013
.TPADPCK AIF   (NOT &SGDAD1B(&COUNTB)).IBMT2      TYPE 1 - IBM1         36000013
&TYPEA   SETC  '&TYPEA'(1,6).'1'.'&TYPEA'(8,1)                          36900013
         AGO   .UNITCHK                                                 37800013
.IBMT2   AIF   (NOT &SGDAD2B(&COUNTB)).IBMT3      TYPE 2 - IBM2         38700013
&TYPEA   SETC  '&TYPEA'(1,6).'2'.'&TYPEA'(8,1)                          39600013
         AGO   .UNITCHK                                                 40500013
.IBMT3   AIF   (NOT &SGDAD3B(&COUNTB)).IBMT4      TYPE 3 - IBMT         41400013
&TYPEA   SETC  '&TYPEA'(1,6).'3'.'&TYPEA'(8,1)                          42300013
         AGO   .UNITCHK                                                 43200013
.IBMT4   AIF   (NOT &SGDAD4B(&COUNTB)).IBMT5      TYPE 4 - TELE1        44100013
&TYPEA   SETC  '&TYPEA'(1,6).'4'.'&TYPEA'(8,1)                          45000013
         AGO   .UNITCHK                                                 45900013
.IBMT5 AIF (NOT &SGDAD5B(&COUNTB)).IBMT8     TYPE 5 - TELE2             46800013
&TYPEA   SETC  '&TYPEA'(1,6).'5'.'&TYPEA'(8,1)                          47700013
         AGO   .UNITCHK                                                 48600013
.IBMT8   AIF   (NOT &SGDAD6B(&COUNTB)).IBMT9      TYPE 8 - IBM3         49500014
&TYPEA SETC '&TYPEA'(1,6).'8'.'&TYPEA'(8,1)                             50400013
         AGO   .UNITCHK                                                 51300013
.IBMT9   AIF   (NOT &SGDAD7B(&COUNTB)).IBMT6  TYPE 9 - BSCA             51500017
&TYPEA   SETC  '&TYPEA'(1,6).'9'.'&TYPEA'(8,1)                          51700014
         AGO   .UNITCHK                                                 51900014
.IBMT6   AIF   (NOT &SGDAD8B(&COUNTB)).UNITCHK  TYPE 6 - WTTA           52900017
&TYPEA SETC '&TYPEA'(1,6).'6'.'&TYPEA'(8,1)                             54000013
         AGO   .UNITCHK                                                 54900013
.*   NOT CURRENTLY SUPPORTED                                            55300017
.IBMT7  ANOP                           TYPE 7 - SAA1                    55800013
&TYPEA SETC '&TYPEA'(1,6).'7'.'&TYPEA'(8,1)                             56700013
.UNITCHK AIF   (NOT &SGDT02B(&COUNTB)).T08B                             57100019
         AIF   (&SGDU01B(&COUNTB)).M1        WTTA                       57500019
         AIF   (&SGDU02B(&COUNTB)).M6        2741P                      57900019
         AIF   (&SGDU03B(&COUNTB)).M5        2741C                      58300019
         AIF   (&SGDU04B(&COUNTB)).X1050     1050X                      58700019
         AIF   (&SGDU06B(&COUNTB)).M5        BSC1                       59200019
         AIF   (&SGDU07B(&COUNTB)).M6        BSC2                       59700019
         AIF   (&SGDU08B(&COUNTB)).M7        BSC3                       60200019
         AGO   .TNCSUP                                                  60700019
.*                                                                      61100019
.T08B    AIF   (NOT &SGDT08B(&COUNTB)).T12B                             61500019
         AIF   (&SGDU01B(&COUNTB)).M1        1030                       61900019
         AIF   (&SGDU02B(&COUNTB)).M1        1050                       62300019
         AIF   (&SGDU03B(&COUNTB)).M2        1060                       62700019
         AIF   (&SGDU04B(&COUNTB)).M1        2260                       63100019
         AIF   (&SGDU05B(&COUNTB)).M2        115A                       63500019
         AIF   (&SGDU06B(&COUNTB)).M1        83B3                       63900019
         AIF   (&SGDU07B(&COUNTB)).M1        TWX                        64300019
         AIF   (&SGDU08B(&COUNTB)).INTCHK    2740                  00MC 64700020
         AGO   .TNCSUP                                                  65100019
.*                                                                      65500019
.INTCHK  AIF   (NOT &SGDF08B(&COUNTB)).M4                          00MC 65600020
         AGO   .M9                                                 00MC 65700020
.*                                                                 00MC 65800020
.T12B    AIF   (NOT &SGDT12B(&COUNTB)).TNCSUP                           65900019
         AIF   (&SGDU01B(&COUNTB)).M8        2740X                      66300019
         AIF   (&SGDU02B(&COUNTB)).M3        2740C                      66700019
         AIF   (&SGDU03B(&COUNTB)).M1        2265                  000T 66800020
         AIF   (&SGDU04B(&COUNTB) AND &SGDM03B(&COUNTB)).M1 7770 MOD 3  66900020
         AGO   .TNCSUP                                                  67100019
.*                                                                      67500019
.X1050   AIF   (&SGDAD3B(&COUNTB)).M2                                   67900019
         AGO   .M7                                                      68300019
.*                                                                      68700019
.TNCSUP  ANOP                                 NOT CURRENTLY SUPPORTED   70200013
&TYPEA   SETC  '30004003'               DUMMY                           71100013
         AGO   .UCBOPUT                                                 72000013
.*                                                                      72040019
.M9      ANOP                                                      00MC 72050020
&LCHCNT  SETA  &LCHCNT+256                                         00MC 72060020
.M8      ANOP                                                           72080019
&LCHCNT  SETA  &LCHCNT+256                                              72120019
.M7      ANOP                                                           72160019
&LCHCNT  SETA  &LCHCNT+256                                              72200019
.M6      ANOP                                                           72240019
&LCHCNT  SETA  &LCHCNT+256                                              72280019
.M5      ANOP                                                           72320019
&LCHCNT  SETA  &LCHCNT+256                                              72360019
.M4      ANOP                                                           72400019
&LCHCNT  SETA  &LCHCNT+256                                              72440019
.M3      ANOP                                                           72480019
&LCHCNT  SETA  &LCHCNT+256                                              72520019
.M2      ANOP                                                           72560019
&LCHCNT  SETA  &LCHCNT+256                                              72600019
.M1      ANOP                                                           72640019
&LCHCNT  SETA  &LCHCNT+256                                              72680019
         AGO   .SETYPA                                                  72720019
.SETYPA  ANOP                 CONVERT BEFORE SETTING FINAL TYPE         72900013
         CONVERT TO=EBCDIC,VALUE=&LCHCNT,DIGITS=3                       73800013
&TYPEA   SETC  '&TYPEA'(1,1).'&EBCDIC'(1,3).'&TYPEA'(5,4)               74700013
.UCBOPUT ANOP                                                           75600013
         AIF   (NOT &SGDEVB(1)).UCB0P2  SKIP INSPECTION                 76500013
&SCR     SETA  &SGETABA(&COUNTB)-&SGETABA(&COUNTB)/256*256              78300013
.*                                  LAST TWO CHAR DEVTAB                79200013
         AIF   (&SGDEVTP(&COUNTB) EQ 0 AND &SCR EQ 0).UCB0P1            80100013
         CONVERT  TO=EBCDIC,VALUE=&SGDEVTP(&COUNTB),DIGITS=6            81000013
&TYPEA   SETC  '&EBCDIC'                                                81900013
         CONVERT  TO=EBCDIC,VALUE=&SCR,DIGITS=2                         82800013
&TYPEA   SETC  '&TYPEA'.'&EBCDIC'                                       83700013
&ERRTAB  SETC  '0'            ERRTAB UNKNOWN                            84100016
.UCB0P1  ANOP                                                           84600013
&SCR     SETA  (&SGETABA(&COUNTB)-&SGETABA(&COUNTB)/65536*65536)/256    85500013
         AIF   (&SCR EQ 0).UCB0P2                                       86400013
&SCR     SETA  &SCR-1                                                   87300013
         CONVERT TO=EBCDIC,VALUE=&SCR,DIGITS=2                          88200013
&ERRTAB  SETC  '&EBCDIC'                                                89100013
.UCB0P2  ANOP                                                           90000013
         PUNCH '.UCB&UCBNO   ANOP       UCB ENTRY'                      90900013
         PUNCH ' IECVUCB &UCBNO,&DEVAD,&TYPC,&DEVTAB,&ERRTAB,&STATAB,&L*91800002
               CHN,&DEVNDX,&TYPEA,&ALOCCNT,&SYSRES,&SQOPT,&OFF,,,0'     92700002
         PUNCH ' AGO .UCB&TUCB'                               LF YM0160 92800002
         PUNCH '.UCX&UCBNO   ANOP       UCB ENTRY'           NE Z30ANNE 92850000
         PUNCH ' IECVUCB &UCBNO,&DEVAD,&TYPC,&DEVTAB,&ERRTAB,&STATAB,&L*92900002
               CHN,&DEVNDX,&TYPEA,&ALOCCNT,&SYSRES,&SQOPT,&OFF,,,1'     92950002
         MEND                                                           93600013
