         MACRO                                                          01000000
         SGIEA4D1                                                       02000000
.*                                                                      03000000
.*  GLOBAL DEFINITION                                                   04000000
         COPY SGGBLPAK                                                  05000000
.*  LOCAL A DEFINITION                                                  06000000
         LCLA &I,&N,&X,&DEV,&NUM(5),&LIM(5),&J,&K              @ZA14064 07000000
.*  LOCAL C DEFINITION                                                  08000000
         LCLC &H(2),&TYPC,&ADDR(495)                           @ZA14064 09000000
.*                                                                      10000000
.*  THIS MACRO CREATED FOR VS/2 RELEASE 2 DIDOCS (SD CODE Y02958).      11000000
.*  IT CREATES LINK EDIT JCL TO INCLUDE THE PAGEABLE DCM'S INTO         12000000
.*  THE SYS1.LPALIB.                                                    13000000
.*                                                                      14000000
&LIM(1)  SETA  0                                               @ZA14064 15000000
&NUM(2)  SETA  99                                              @ZA14064 16000000
&LIM(2)  SETA  99                                              @ZA14064 17000000
&NUM(3)  SETA  198                                             @ZA14064 18000000
&LIM(3)  SETA  198                                             @ZA14064 19000000
&NUM(4)  SETA  297                                             @ZA14064 20000000
&LIM(4)  SETA  297                                             @ZA14064 21000000
&NUM(5)  SETA  396                                             @ZA14064 22000000
&LIM(5)  SETA  396                                             @ZA14064 23000000
&H(1)    SETC  '&SGSCHDC(1)'(1,3)                                       24000000
&H(2)    SETC  '&SGSCHDC(1)'(4,3)                                       25000000
.STARTI  ANOP                                                           26000000
&I       SETA  1                                                        27000000
         AIF   ('&H(1)' NE '&H(2)').LEAVEI                              28000000
.NEXTI   ANOP                                                           29000000
&I       SETA  2                                                        30000000
.LEAVEI  CONVERT TO=HEX,VALUE=&H(&I),DIGITS=3                           31000000
&X       SETA  &HEX                                                     32000000
         IOCHECK LOOKFOR=&X                                             33000000
&X       SETA  &SGDASPA(&HEX)                                  @ZA15421 34000000
         AIF   (NOT &SGDT05B(&X)).HALFDUN                               35000000
&DEV     SETA  4                                              MB YM4087 36000000
         AIF   (&SGDU10B(&X) OR &SGDU08B(&X) AND &SGDM02B(&X) OR &SGDU1X37000000
               3B(&X)).GR                                      @G51AK02 37500000
&DEV     SETA  5                                              MB YM4087 38000000
         AIF   (&SGDU08B(&X) AND &SGDM01B(&X)).GR                       39000000
&DEV     SETA  3                                              MB YM4087 40000000
         AIF   (&SGDU02B(&X)).GR                                        41000000
&DEV     SETA  2                                              MB YM4087 42000000
         AIF   (&SGDU01B(&X)).GR                                        43000000
&DEV     SETA  1                                              MB YM4087 44000000
         AIF   (NOT &SGDU06B(&X)).HALFDUN                               45000000
.GR      ANOP                                                           46000000
&NUM(&DEV) SETA &NUM(&DEV)+1                                  MB YM4087 47000000
&ADDR(&NUM(&DEV)) SETC  'DCM&H(&I)'                           MB YM4087 48000000
.HALFDUN AIF   ('&H(2)' NE 'FFF' AND &I EQ 1).NEXTI                     49000000
.JESCON  AIF   (&N GE &SGSCNYA(1)).OUT                      JE @ZM32389 50000000
&N       SETA  &N+1                                                     51000000
         AIF   ('&SGSCNCC(&N)' EQ 'JESJES').JESCON          JE @ZM32389 52000000
&H(1)    SETC  '&SGSCNCC(&N)'(1,3)                                      53000000
&H(2)    SETC  '&SGSCNCC(&N)'(4,3)                                      54000000
         AIF   ('&H(1)' EQ 'FFF').NEXTI                                 55000000
         AGO   .STARTI                                                  56000000
.OUT     ANOP                                                           57000000
         AIF   (&NUM(1)+&NUM(2)+&NUM(3)+&NUM(4)+&NUM(5) LE 990).NOPCH   58000000
.*                                                             @ZA14064 58500000
.*  THE FOLLOWING COMMENT CARD WILL BE GENERATED INTO THE STAGE 1       59000000
.*  OUTPUT TO IDENTIFY THE LEVEL AND CHANGE DATE ASSOCIATED WITH        60000000
.*  THE COPY OF SGIEA4D1 BEING USED IN ANY GIVEN SYSGEN.                61000000
.*  THE COMMENT SHOULD BE UPDATED WITH A NEW LEVEL NUMBER               62000000
.*  AND DATE WHENEVER ANY CHANGES ARE MADE TO THIS MACRO                63000000
.*                                                                      64000000
*** SGIEA4D1 *** DIDOCS *** 05/23/77 *** CHANGE LEVEL 04 ***   @G51AK02 65000000
.*                                                                      66000000
&SGCTRLC(7) SETC '&SGCTRLC(20)' SET LPALIB VOLSER                       67000000
&SGCTRLC(8) SETC '&SGCTRLC(19)' SET LPALIB UNIT                         68000000
&SGCTRLC(9) SETC 'LPALIB' SET LPALIB NAME                               69000000
         COPY  SGLEDPK1                                                 70000000
         COPY  SGLEDPK2                                                 71000000
&J       SETA  0                                              MB YM4087 72000000
&DEV     SETA  1                                              MB YM4087 73000000
.GENLOOP ANOP                                                 MB YM4087 74000000
&K       SETA  0                                               @ZA14064 74500000
&J       SETA  &J+1                                           MB YM4087 75000000
         AIF   (&J GT &NUM(&DEV)).NXTYPE                      MB YM4087 76000000
&TYPC    SETC  '&ADDR(&J)'        SET PAGEABLE DCM NAME       MB YM4087 77000000
.ENTRY   ANOP                                                 MB YM4087 78000000
         AIF   (&K EQ 15).ENDDCM                               @ZA14064 78300000
&K       SETA  &K+1                                            @ZA14064 78600000
&J       SETA  &J+1                                           MB YM4087 79000000
         AIF   (&J GT &NUM(&DEV)).ENDDCM                      MB YM4087 80000000
         PUNCH '  ALIAS &ADDR(&J)'                            MB YM4087 81000000
         AGO   .ENTRY                                          @ZA14064 82000000
.ENDDCM  ANOP                                                 MB YM4087 83000000
         PUNCH '  INCLUDE SYSPUNCH(&TYPC) '                   MB YM4087 84000000
         PUNCH '  NAME &TYPC.(R)    '                         JE YM5842 85000000
         AGO   .GENLOOP                                        @ZA14064 86600000
.NXTYPE  ANOP                                                 MB YM4087 87000000
&DEV     SETA  &DEV+1                                          @ZA14064 89000000
         AIF   (&DEV GE 6).PCH                                 @ZA14064 89200000
&J       SETA  &LIM(&DEV)                                      @ZA14064 89500000
         AGO   .GENLOOP                                        @ZA14064 90000000
.PCH     PUNCH '/*'                                            @ZA14064 91000000
.NOPCH   MEND                                                 MB YM4302 92000000
