         MACRO                                                          00060000
         SGIEA2D3                                                       00120000
.*                                                                      00180000
.*  GLOBAL DEFINITION                                                   00240000
         COPY SGGBLPAK                                                  00300000
.*  LOCAL A DEFINITION                                                  00360000
.* THE FOLLOWING CHANGE TO 99 FOR PFKLIM,NDX, AND PFKORG SUPPORT        00420045
.* THE CHANGE FROM 32 TO 99 CONSOLES                         @ZA36190   00456045
         LCLA &TOTPFK,&PFKLIM(99),&NDX(99),&P,&N,&I,&J,&X               00492045
.*  LOCAL B DEFINITION                                                  00528045
         LCLB &PFKORG(99)                                               00564045
.*  LOCAL C DEFINITION                                                  00600000
         LCLC &H                                                        00660000
.*                                                                      00720000
.*  THIS MACRO WAS CREATED FOR VS/2 RELEASE 2 DIDOCS (SD CODE Y02958)   00780000
.*  TO ASSEMBLE IEEPFKEY TO RESIDE IN SYS1.DCMLIB                       00840000
.*                                                                      00900000
         AIF   (&SGSCHDA(16) EQ 0).HALFDUN                              01000000
&H       SETC  '&SGSCHDC(1)'(1,3)                                       01050000
&P       SETA  1                                                        01100000
&PFKLIM(1) SETA &SGSCHDA(16)                                            01150000
&TOTPFK  SETA  &SGSCHDA(16)                                             01200000
         AGO   .ENDMAST                                                 01250000
.HALFDUN ANOP                                                           01300000
&N       SETA  &N+1                                                     01350000
         AIF   (&N GT &SGSCNYA(1)).PFKDUN                     MB YM3307 01400000
         AIF   (&SGSCNPA(&N) EQ 0).HALFDUN                              01450000
&H       SETC  '&SGSCNCC(&N)'(1,3)                                      01500000
&P       SETA  &P+1                                                     01550000
&PFKLIM(&P) SETA &SGSCNPA(&N)                                           01600000
&TOTPFK  SETA  &TOTPFK+&SGSCNPA(&N)                                     01650000
.ENDMAST ANOP                                                           01700000
&NDX(&P) SETA  &N                                                       01750000
         CONVERT TO=HEX,VALUE=&H,DIGITS=3                               01800000
&X       SETA  &HEX                                                     02000000
         IOCHECK LOOKFOR=&X                                             02030000
&X       SETA  &SGDASPA(&HEX)                                  @ZA15421 02060000
&PFKORG(&P) SETB (NOT &SGDU01B(&X))                                     02090000
&PFKLIM(&P) SETA &PFKLIM(&P)+&PFKORG(&P)                                02120000
         AGO   .HALFDUN                                       MB YM3307 02150000
.PFKDUN  AIF   (&P EQ 0).OUT                                            02180000
.*  THE FOLLOWING COMMENT CARD WILL BE GENERATED INTO THE STAGE 1       02210000
.*  OUTPUT TO IDENTIFY THE LEVEL AND CHANGE DATE ASSOCIATED WITH        02240000
.*  THE COPY OF SGIEA2D3 BEING USED IN ANY GIVEN SYSGEN.                02270000
.*  THE COMMENT SHOULD BE UPDATED WITH A NEW LEVEL NUMBER AND DATE      02300000
.*  WHENEVER ANY CHANGES ARE MADE TO THIS MACRO                         02330000
.*                                                                      02360000
*** SGIEA2D3 *** DIDOCS *** 05/09/79 *** CHANGE LEVEL 3.7***   @ZA36190 02390045
.*                                                                      02420000
&SGCTRLC(6) SETC 'IEEPFKEY'                                             02450000
         COPY  SGASMPAK                                                 02480000
         PUNCH 'IEEPFKEY CSECT'                                         02510000
         PUNCH '         DC    A(KEY)'                                  02540000
&X       SETA  (((&TOTPFK*110+99)+3000)/3000)  X=TOTAL # PFKS           02570045
         PUNCH '         DC    &X.XL10''0''' LLMBBCCHHR                 02600000
         PUNCH 'KEY   DC   AL2(ENDPFK-IEEPFKEY)  '                      02630000
         PUNCH '    DC   H''0''   '                                     02660000
&I       SETA  1                                                        02690000
.CONLOOP ANOP                                                           02720000
         PUNCH '         ENTRY IEECVK&NDX(&I)'                          02750000
         PUNCH 'IEECVK&NDX(&I)  EQU   *'                                02780000
&J       SETA  &PFKORG(&I)                                              02810000
.KEYLOOP ANOP                                                           03000000
         PUNCH '         DC    FL1''&J'''                               03070000
         PUNCH '         DC    X''0'''                                  03140000
         PUNCH '         DC    CL108'' '''                              03210000
&J       SETA  &J+1                                                     03280000
         AIF   (&J LT &PFKLIM(&I)).KEYLOOP                              03350000
         PUNCH '         DC    FL1''100'''                              03420000
&I       SETA  &I+1                                                     03490000
         AIF   (&I LE &P).CONLOOP                                       03560000
         PUNCH 'ENDPFK   EQU   *'                                       03630000
         PUNCH '         END'                                           03700000
         PUNCH '/*'                                                     03770000
.OUT     MEND                                                           03840000
