         MACRO                                                          00200001
         SGIFB600 &RESTYPE                                       S21021 00400001
         COPY  SGGBLPAK                                          S21021 00600001
         LCLA  &A,&B,&C,&D,&E,&F                                 S21021 00800001
         LCLA  &G                                                       00900045
.*                                                                      01000001
.*          AOS EXECUTION OF DIP                                        01200001
.*                                                                      01400001
.* THIS MACRO ALLOCATES SPACE FOR THE SYS1.LOGREC DEPENDENT UPON S21021 01600001
.* THE DEVICE WHERE IT IS TO RESIDE.                             S21021 01800001
.*    -COMPLETE REPLACEMENT                                      S21021 02000001
&A       SETA  &SGCNTRA(3)+&SG2314A     .TOTAL STAT CTRS IN SYS  S21021 02200001
.START   AIF   ('&RESTYPE' EQ '2311').D2311    .SYSRES 2311      S21021 02400001
         AIF   ('&RESTYPE' EQ '2301').D2301    .SYSRES 2301      S21021 02600001
         AIF   ('&RESTYPE' EQ '2303').D2303    .SYSRES 2303      S21021 02800001
         AIF   ('&RESTYPE' EQ '2302').D2302    .SYSRES 2302      S21021 03000001
         AIF   ('&RESTYPE' EQ '2305-1').D23051 .SYSRES 2305 MOD 1S21021 03200001
         AIF   ('&RESTYPE' EQ '2305-2').D23052 .SYSRES 2305 MOD 2S21021 03400001
         AIF   ('&RESTYPE' EQ '2314').D2314    .SYSRES 2314      S21021 03600001
         AIF   ('&RESTYPE' EQ '3330').D3330    .SYSRES 3330      S21021 03800001
         AIF   ('&RESTYPE' EQ '3330-1').D33301 .SYSRES 3330-1   XL03145 03850003
         AIF   ('&RESTYPE' EQ '3340').D3340    .SYSRES 3340     XL03130 03900003
         AIF   ('&RESTYPE' EQ '3350').D3350    .SYSRES 3350    @X50RIVS 03920005
         AIF   ('&RESTYPE' EQ '3375').D3375 +3375 ??             MVS38J 03925038
         AIF   ('&RESTYPE' EQ '3380').D3380 +3380 ??             MVS38J 03930038
         AIF   ('&RESTYPE' EQ '3390').D3390 +3390 ??             MVS38J 03940038
.*                                                                      03950003
 MNOTE 5,'* * * IEIFFB600 DEVICE NOT FOUND'                             04000001
&SGQUITB SETB  1                        .ABEND SYSGEN            S21021 04200001
         MEXIT                                                   S21021 04400001
.D3375   ANOP                             +TRACK ALLOC PRMS      MVS38J 04401038
         MNOTE *,'SGIFB600 - D3375 DIP probably wrong - MVS38J'  MVS38J 04402038
&B       SETA  80                         + DEVICES/TRACK        MVS38J 04403038
&C       SETA  03                         + 125K                 MVS38J 04404038
&D       SETA  02                         + RMS/SER1             MVS38J 04405038
&G       SETA  03                         + FRAMES               MVS38J 04406038
         AGO   .LOOP                      +                      MVS38J 04407038
.D3390   ANOP                             +TRACK ALLOC PRMS      MVS38J 04500038
         MNOTE *,'SGIFB600 - D3390 probably wrong - MVS38J'      MVS38J 04500538
&B       SETA  80                         + DEVICES/TRACK        MVS38J 04501038
&C       SETA  03                         + 125K                 MVS38J 04502038
&D       SETA  02                         + RMS/SER1             MVS38J 04503038
&G       SETA  03                         + FRAMES               MVS38J 04504038
         AGO   .LOOP                      +                      MVS38J 04505038
.D3380   ANOP                             +TRACK ALLOC PRMS      MVS38J 04550038
&B       SETA  80                         + DEVICES/TRACK        MVS38J 04551038
&C       SETA  03                         + 125K                 MVS38J 04552038
&D       SETA  02                         + RMS/SER1             MVS38J 04553038
&G       SETA  03                         + FRAMES               MVS38J 04554038
         AGO   .LOOP                      +                      MVS38J 04555038
.D2311   ANOP                      .2311                         S21021 04600001
&B       SETA  25                       .DEVICES/TRACK           S21021 04800001
&C       SETA  35                       .TRACK ALLOC 125K        S21021 05000001
&D       SETA  17                       .TRACK ALLOC-RMS/SER1    S21021 05200001
&G       SETA  52                  .TRACK ALLOC-FRAMES                  05300045
         AGO   .LOOP                             .CONTINUE       S21021 05400001
.D2301   ANOP                      .2301                         S21021 05600001
&B       SETA  85                       .DEVICES/TRACK           S21021 05800001
&C       SETA  6                        .TRACK ALLOC 125K        S21021 06000001
&D       SETA  4                        .TRACK ALLOC-RMS/SER1    S21021 06200001
&G       SETA  5                   .TRACK ALLOC-FRAMES                  06300045
         AGO   .LOOP                             .CONTINUE       S21021 06400001
.D2303   ANOP                      .2303                         S21021 06600001
&B       SETA  25                       .DEVICES/TRACK           S21021 06800001
&C       SETA  26                       .TRACK ALLOC 125K        S21021 07000001
&D       SETA  17                       .TRACK ALLOC-RMS/SER1    S21021 07200001
&G       SETA  26                  .TRACK ALLOC-FRAMES                  07300045
         AGO   .LOOP                             .CONTINUE       S21021 07400001
.D2302   ANOP                      .2302                         S21021 07600001
&B       SETA  35                       .DEVICES/TRACK           S21021 07800001
&C       SETA  25                       .TRACK ALLOC 125K        S21021 08000001
&D       SETA  17                       .TRACK ALLOC-RMS/SER1    S21021 08200001
&G       SETA  26                  .TRACK ALLOC-FRAMES                  08300045
         AGO   .LOOP                             .CONTINUE       S21021 08400001
.D23051  ANOP                     .2305 MOD 1                    S21021 08600001
&B       SETA  20                       .DEVICE/TRACK                   08800001
&C       SETA  10                       .TRACK ALLOC 125K        S21021 09000001
&D       SETA  5                        .TRACK ALLOC-RMS/SER1    S21021 09200001
&G       SETA  8                   .TRACK ALLOC-FRAMES                  09300045
         AGO   .LOOP                             .CONTINUE       S21021 09400001
.D23052  ANOP                      .2305 MOD 2                   S21021 09600001
&B       SETA  40                       .DEVICES/TRACK           S21021 09800001
&C       SETA  10                       .TRACK ALLOC 125K        S21021 10000001
&D       SETA  5                        .TRACK ALLOC-RMS/SER1    S21021 10200001
&G       SETA  8                   .TRACK ALLOC-FRAMES                  10300045
         AGO   .LOOP                             .CONTINUE       S21021 10400001
.D2314   ANOP                      .2314                         S21021 10600001
&B       SETA  30                       .DEVICES/TRACK           S21021 10800001
&C       SETA  17                       .TRACK ALLOC 125K        S21021 11000001
&D       SETA  11                       .TRACK ALLOC-RMS/SER1    S21021 11200001
&G       SETA  18                  .TRACK ALLOC-FRAMES                  11300045
         AGO   .LOOP                             .CONTINUE       S21021 11400001
.D3330   ANOP                      .3330                         S21021 11600001
&B       SETA  50                       .DEVICES/TRACK           S21021 11800001
&C       SETA  10                       .TRACK ALLOC 125K        S21021 12000001
&D       SETA  5                        .TRACK ALLOC-RMS/SER1    S21021 12200001
&G       SETA  9                   .TRACK ALLOC-FRAMES                  12300045
         AGO   .LOOP           .CONTINUE                         S21021 12400001
.D33301  ANOP                      .3330 MOD 1                  XL03145 12450003
&B       SETA  50                       .DEVICE/TRACK           XL03145 12500003
&C       SETA  10                       .TRACK ALLOC 125K       XL03145 12550003
&D       SETA  5                        .TRACK ALLOC-RMS/SER1   XL03145 12560003
&G       SETA  9                   .TRACK ALLOC-FRAMES                  12565045
         AGO   .LOOP           .CONTINUE                        XL03145 12570003
.D3340   ANOP                      .3340                        XL03130 12580003
&B       SETA  30                       .DEVICE/TRACK           XL03130 12590003
&C       SETA  16                       .TRACK ALLOC 125K       XL03130 12592003
&D       SETA  9                        .TRACK ALLOC-RMS/SER1   XL03130 12594003
&G       SETA  13                  .TRACK ALLOC-FRAMES                  12595045
         AGO   .LOOP           .CONTINUE                        XL03130 12596003
.D3350   ANOP                      .3350                       @X50RIVS 12596605
&B       SETA  60                       .DEV/TRK               @X50RIVS 12597205
&C       SETA  6                        .TRK ALLOC 125K        @X50RIVS 12597805
&D       SETA  4                        .TRK ALLOC-RMS/SER1    @X50RIVS 12598405
&G       SETA  6                   .TRACK ALLOC-FRAMES                  12598745
         AGO   .LOOP           .CONTINUE                       @X50RIVS 12599005
.LOOP    ANOP                                                    S21021 12600001
&A       SETA  (&A+&B-1)/&B             .NUMBER TRKS FOR OVERFLOWS21021 12800001
&E       SETA  &SGBSCA/100                   .ONE TRACK/100 TERMSS21021 14200000
&A       SETA  &A+&C+&D+&E                   .TOTAL TRACKS       S21021 14600001
         AIF   (&SGCPRGB(4) EQ 1).NOTMVM .BRANCH IF NOT MVM     YL02021 14650003
&A       SETA  &A+&A                    .DOUBLE TRACK ALLOCATIONYL02021 14700003
.NOTMVM  ANOP                                                   YL02021 14750003
         AIF   (&SGDCLSB(44) EQ 0).NOSRF                                14752045
&A       SETA  &A+&G                                                    14754045
.NOSRF   ANOP                                                           14756045
         AIF   (&SGDCLSB(28) EQ 0).NOTSS1    .NO SS/1 IN SYSTEM Y30LPDW 14760003
&A       SETA  &A+&D                         .ADD TRACKS - SS/1 Y30LPDW 14770003
.NOTSS1  ANOP                                                   Y30LPDW 14780003
&SGCTRLA(1) SETA &SGCTRLA(1)+1     .ADD ONE TO STEP NAME         S21021 14800001
 PUNCH '//SG&SGCTRLA(1) EXEC PGM=IFCDIP00,COND=(8,LT)'                  15000001
 PUNCH '//SERERDS DD   DSN=&SGCTRLC(40)..LOGREC,DISP=(NEW,KEEP),'       15200001
 PUNCH '//             VOLUME=(,RETAIN,SER=&SGCTRLC(30)),'              15400001
 PUNCH '//             SPACE=(TRK,(&A),,CONTIG),UNIT=&SGCTRLC(29)'      15600001
 PUNCH '//*THE ABOVE STEP WILL INITIALIZE THE SYS1.LOGREC  '   @OZ58826 15616600
 PUNCH '//*DATA SET ON THE SYSTEM RESIDENCE VOLUME THAT IS '   @OZ58826 15633200
 PUNCH '//*THE TARGET OF THIS SYSGEN. AFTER IPL-ING THE    '   @OZ58826 15649800
 PUNCH '//*NEWLY GENERATED SYSTEM IT WILL BE NECESSARY TO  '   @OZ58826 15666400
 PUNCH '//*EXECUTE IFCDIP00 AND RE-INITIALIZE SYS1.LOGREC  '   @OZ58826 15683000
 PUNCH '//*TO ENSURE THAT THE LATEST MAINTENANCE LEVEL     '   @OZ58826 15699600
 PUNCH '//*SOFTWARE IS USED. ADDITIONAL INFORMATION AS TO  '   @OZ58826 15716200
 PUNCH '//*THE PARM=FRAMES AND FRAMES DD STATEMENTS        '   @OZ58826 15732800
 PUNCH '//*REQUIRED WHEN RUNNING ON A 303X TYPE CPU IS     '   @OZ58826 15749400
 PUNCH '//*CONTAINED IN THE OS/VS2 MVS SYSTEM PROGRAMMING  '   @OZ58826 15766000
 PUNCH '//*LIBRARY SYS1.LOGREC RECORDING MANUAL.           '   @OZ58826 15782600
&SGCTRLA(1) SETA &SGCTRLA(1)+1     .ADD ONE TO STEP NAME         S21021 15800001
         AIF   (&SGCPRGB(4) EQ 0).VS2   .BRANCH IF MVM           YM2830 15900002
 PUNCH '//SG&SGCTRLA(1) EXEC PGM=IEHPROGM,COND=(8,LT)'                  16000001
 PUNCH '//TARG DD VOLUME=SER=&SGCTRLC(30),DISP=OLD,UNIT=&SGCTRLC(29)'   16200001
 PUNCH '//SYSPRINT DD SYSOUT=&SGCTRLC(41)'                              16400001
 PUNCH '//SYSIN DD *'                                            S21021 16600001
 PUNCH ' CATLG CVOL=&SGCTRLC(29)=&SGCTRLC(30),VOL=&SGCTRLC(29)=&SGCTRLCX16800001
               (30),DSNAME=SYS1.LOGREC'                          S21021 17000001
         AGO   .VS1                                              YM2830 17200002
.VS2     AIF   (&GETB(3)).VS1                                   YM6505P 20200002
 PUNCH '//SG&SGCTRLA(1) EXEC PGM=IDCAMS,COND=(8,LT),REGION=512K' YM5838 23200002
 PUNCH '//SYSPRINT DD  SYSOUT=&SGCTRLC(41)'                      YM2830 26200002
 PUNCH '//CATLG DD DSN=&SGVSNMC,'                              @ZM40007 29200004
 PUNCH '//  VOL=(,RETAIN,SER=&SGDSVLC(15)),'                   @ZM40169 30200004
 PUNCH '//             UNIT=&SGDSUNC(15),DISP=SHR'              YM2830P 32200002
 PUNCH '//TARG     DD  DSN=&SGCTRLC(40)..LOGREC,DISP=OLD,'       YM2830 35200002
 PUNCH '//             VOL=SER=&SGCTRLC(30),UNIT=&SGCTRLC(29)'   YM2830 38200002
 PUNCH '//SYSIN    DD  *'                                        YM2830 41200002
 PUNCH ' DEFINE NONVSAM (NAME(&SGCTRLC(40)..LOGREC) VOL(&SGCTRLC(30))-' 44200002
 PUNCH '        DEVT(&SGCTRLC(29))) CAT(&SGVSNMC)'       @ZA41682YM2830 47200000
.VS1     ANOP                                                    YM2830 47250000
 PUNCH '/* '                                                     YM2830 47300000
.END     MEND                                                           47350000
