*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
ICKTSAN0 CSECT                                                          00000060
         DC    XL4'003F0080'                                            00000070
         DC    XL3'00B400'                                              00000080
         DC    CL1'0'                                                   00000090
         DC    XL4'01260176'                                            00000100
         DC    XL4'01BC020A'                                            00000110
         DC    XL4'023C0278'                                            00000120
         DC    XL4'02BA030C'                                            00000130
         DC    XL1'03'                                                  00000140
         DC    CL1'!'                                                   00000150
         DC    XL1'03'                                                  00000160
         DC    CL1's'                                                   00000170
         DC    XL4'03DE041E'                                            00000180
         DC    XL3'045404'                                              00000190
         DC    CL1'm'                                                   00000200
         DC    XL4'04CE0508'                                            00000210
         DC    XL1'05'                                                  00000220
         DC    CL1'&&'                                                  00000230
         DC    XL1'05'                                                  00000240
         DC    CL1'q'                                                   00000250
         DC    XL1'05'                                                  00000260
         DC    CL1'U'                                                   00000270
         DC    H'1582'                                                  00000280
         DC    XL3'066A06'                                              00000290
         DC    CL1'y'                                                   00000300
         DC    XL1'06'                                                  00000310
         DC    CL1'6'                                                   00000320
         DC    XL1'07'                                                  00000330
         DC    CL1'!'                                                   00000340
         DC    XL4'07BE0808'                                            00000350
         DC    XL1'08'                                                  00000360
         DC    CL1'>'                                                   00000370
         DC    XL1'08'                                                  00000380
         DC    CL1'M'                                                   00000390
         DC    XL4'093A09A0'                                            00000400
         DC    XL4'09EC0A3A'                                            00000410
         DC    XL4'0A8A0AC0'                                            00000420
         DC    XL4'0B240B56'                                            00000430
         DC    XL4'0B9A0BEA'                                            00000440
         DC    XL3'0C360C'                                              00000450
         DC    CL1'b'                                                   00000460
         DC    XL1'0C'                                                  00000470
         DC    CL1'B'                                                   00000480
         DC    H'3348'                                                  00000490
         DC    XL1'0D'                                                  00000500
         DC    CL1';'                                                   00000510
         DC    H'3502'                                                  00000520
         DC    XL1'0D'                                                  00000530
         DC    CL1'8'                                                   00000540
         DC    H'3640'                                                  00000550
         DC    XL3'0EA00E'                                              00000560
         DC    CL1'K'                                                   00000570
         DC    XL4'0F120F54'                                            00000580
         DC    XL4'0FA00FFA'                                            00000590
         DC    XL3'103810'                                              00000600
         DC    CL1':'                                                   00000610
         DC    XL4'10BCFFFF'                                            00000620
         DC    XL4'FFFFFFFF'                                            00000630
         DC    XL4'111C1168'                                            00000640
         DC    XL4'002F9000'                                            00000650
         DC    CL1' '                                                   00000660
         DC    XL1'00'                                                  00000670
         DC    H'0002'                                                  00000680
         DC    CL3'R d'                                                 00000690
         DC    XL1'80'                                                  00000700
         DC    XL4'001D0012'                                            00000710
         DC    F'65565'                                                 00000720
         DC    H'0'                                                     00000730
         DC    CL29'ICK01400I     ANALYZE STARTED'                      00000740
         DC    XL1'00'                                                  00000750
         DC    XL4'00379000'                                            00000760
         DC    CL1' '                                                   00000770
         DC    XL1'00'                                                  00000780
         DC    H'0002'                                                  00000790
         DC    CL3'R d'                                                 00000800
         DC    XL1'80'                                                  00000810
         DC    XL4'00250012'                                            00000820
         DC    F'65573'                                                 00000830
         DC    H'0'                                                     00000840
         DC    CL32'ICK31401I     SUSPECTED DRIVE PR'                   00000850
         DC    CL5'OBLEM'                                               00000860
         DC    XL1'00'                                                  00000870
         DC    XL4'00329000'                                            00000880
         DC    CL1' '                                                   00000890
         DC    XL1'00'                                                  00000900
         DC    H'0002'                                                  00000910
         DC    CL3'R d'                                                 00000920
         DC    XL1'80'                                                  00000930
         DC    XL4'00200012'                                            00000940
         DC    F'65568'                                                 00000950
         DC    H'0'                                                     00000960
         DC    CL32'ICK11402I     ERROR READING DATA'                   00000970
         DC    XL1'00'                                                  00000980
         DC    CL1'<'                                                   00000990
         DC    XL2'9000'                                                00001000
         DC    CL1' '                                                   00001010
         DC    XL1'00'                                                  00001020
         DC    H'0002'                                                  00001030
         DC    CL3'R d'                                                 00001040
         DC    XL1'80'                                                  00001050
         DC    H'0058'                                                  00001060
         DC    XL4'00120001'                                            00001070
         DC    XL4'003A0000'                                            00001080
         DC    CL32'ICK31403I     DATA SCAN LIMITS I'                   00001090
         DC    CL26'NVALID, TESTING TERMINATED'                         00001100
         DC    H'0066'                                                  00001110
         DC    XL2'9000'                                                00001120
         DC    CL1' '                                                   00001130
         DC    XL1'00'                                                  00001140
         DC    H'0002'                                                  00001150
         DC    CL3'R d'                                                 00001160
         DC    XL1'80'                                                  00001170
         DC    H'0048'                                                  00001180
         DC    XL4'00120001'                                            00001190
         DC    XL4'00300000'                                            00001200
         DC    CL32'ICK31404I     VOLUME HAS UNFORMA'                   00001210
         DC    CL16'TTED DATA BLOCKS'                                   00001220
         DC    XL4'004A9000'                                            00001230
         DC    CL1' '                                                   00001240
         DC    XL1'00'                                                  00001250
         DC    H'0002'                                                  00001260
         DC    CL3'R d'                                                 00001270
         DC    XL1'80'                                                  00001280
         DC    XL4'00380012'                                            00001290
         DC    F'65592'                                                 00001300
         DC    H'0'                                                     00001310
         DC    CL32'ICK01405I     ALL DATA ''MACHINE '                  00001320
         DC    CL24'READABLE'' WITHOUT ERRORS'                          00001330
         DC    H'0045'                                                  00001340
         DC    XL2'9000'                                                00001350
         DC    CL1' '                                                   00001360
         DC    XL1'00'                                                  00001370
         DC    H'0002'                                                  00001380
         DC    CL3'R d'                                                 00001390
         DC    XL1'80'                                                  00001400
         DC    H'0027'                                                  00001410
         DC    XL4'00120001'                                            00001420
         DC    XL4'001B0000'                                            00001430
         DC    CL27'ICK01406I     ANALYZE ENDED'                        00001440
         DC    XL1'00'                                                  00001450
         DC    XL4'00379000'                                            00001460
         DC    CL1' '                                                   00001470
         DC    XL1'00'                                                  00001480
         DC    H'0002'                                                  00001490
         DC    CL3'R d'                                                 00001500
         DC    XL1'80'                                                  00001510
         DC    XL4'00250012'                                            00001520
         DC    F'65573'                                                 00001530
         DC    H'0'                                                     00001540
         DC    CL32'ICK01407I     NO DRIVE PROBLEMS '                   00001550
         DC    CL5'FOUND'                                               00001560
         DC    XL1'00'                                                  00001570
         DC    XL4'003E9000'                                            00001580
         DC    CL1' '                                                   00001590
         DC    XL1'00'                                                  00001600
         DC    H'0002'                                                  00001610
         DC    CL3'R d'                                                 00001620
         DC    XL1'80'                                                  00001630
         DC    XL4'002C0012'                                            00001640
         DC    F'65580'                                                 00001650
         DC    H'0'                                                     00001660
         DC    CL32'ICK01408I     DATA VERIFICATION '                   00001670
         DC    CL12'TEST STARTED'                                       00001680
         DC    XL1'00'                                                  00001690
         DC    CL1'+'                                                   00001700
         DC    XL2'9000'                                                00001710
         DC    CL1' '                                                   00001720
         DC    XL1'00'                                                  00001730
         DC    H'0002'                                                  00001740
         DC    CL3'R d'                                                 00001750
         DC    XL1'80'                                                  00001760
         DC    H'0060'                                                  00001770
         DC    XL4'00120001'                                            00001780
         DC    XL4'003C0000'                                            00001790
         DC    CL32'ICK31410I     MAIN STORAGE NOT A'                   00001800
         DC    CL28'VAILABLE, TESTING TERMINATED'                       00001810
         DC    XL4'00499000'                                            00001820
         DC    CL1' '                                                   00001830
         DC    XL1'00'                                                  00001840
         DC    H'0002'                                                  00001850
         DC    CL3'R d'                                                 00001860
         DC    XL1'80'                                                  00001870
         DC    XL4'00370012'                                            00001880
         DC    F'65591'                                                 00001890
         DC    H'0'                                                     00001900
         DC    CL32'ICK31411I     INCORRECT DEVICE T'                   00001910
         DC    CL23'YPE, TESTING TERMINATED'                            00001920
         DC    XL1'00'                                                  00001930
         DC    H'0068'                                                  00001940
         DC    XL2'9000'                                                00001950
         DC    CL1' '                                                   00001960
         DC    XL1'00'                                                  00001970
         DC    H'0002'                                                  00001980
         DC    CL3'R d'                                                 00001990
         DC    XL1'80'                                                  00002000
         DC    H'0050'                                                  00002010
         DC    XL4'00120001'                                            00002020
         DC    XL4'00320000'                                            00002030
         DC    CL32'ICK31412I     DEVICE NOT READY,T'                   00002040
         DC    CL18'ESTING TERMINATED '                                 00002050
         DC    H'0055'                                                  00002060
         DC    XL2'9000'                                                00002070
         DC    CL1' '                                                   00002080
         DC    XL1'00'                                                  00002090
         DC    H'0002'                                                  00002100
         DC    CL3'R d'                                                 00002110
         DC    XL1'00'                                                  00002120
         DC    H'0037'                                                  00002130
         DC    XL4'00120001'                                            00002140
         DC    XL4'00250000'                                            00002150
         DC    CL32'FIXED BLOCK WRITE CE AREA TEST: '                   00002160
         DC    CL5'BWRCE'                                               00002170
         DC    XL1'00'                                                  00002180
         DC    H'0059'                                                  00002190
         DC    XL2'9000'                                                00002200
         DC    CL1' '                                                   00002210
         DC    XL1'00'                                                  00002220
         DC    H'0002'                                                  00002230
         DC    CL3'R d'                                                 00002240
         DC    XL1'00'                                                  00002250
         DC    H'0041'                                                  00002260
         DC    XL4'00120001'                                            00002270
         DC    XL4'00290000'                                            00002280
         DC    CL32'FIXED BLOCK CALIBRATION SEEK TES'                   00002290
         DC    CL9'T: BCALSK'                                           00002300
         DC    XL1'00'                                                  00002310
         DC    H'0050'                                                  00002320
         DC    XL2'9000'                                                00002330
         DC    CL1' '                                                   00002340
         DC    XL1'00'                                                  00002350
         DC    H'0002'                                                  00002360
         DC    CL3'R d'                                                 00002370
         DC    XL1'00'                                                  00002380
         DC    H'0032'                                                  00002390
         DC    XL4'00120001'                                            00002400
         DC    XL4'00200000'                                            00002410
         DC    CL32'MULTIPLE BLOCK WRITE TEST: BHDSK'                   00002420
         DC    XL4'003B9000'                                            00002430
         DC    CL1' '                                                   00002440
         DC    XL1'00'                                                  00002450
         DC    H'0002'                                                  00002460
         DC    CL3'R d'                                                 00002470
         DC    XL1'00'                                                  00002480
         DC    XL4'00290012'                                            00002490
         DC    F'65577'                                                 00002500
         DC    H'0'                                                     00002510
         DC    CL32'FIXED BLOCK INCREMENTAL SEEK TES'                   00002520
         DC    CL9'T: BINCSK'                                           00002530
         DC    XL1'00'                                                  00002540
         DC    XL4'00369000'                                            00002550
         DC    CL1' '                                                   00002560
         DC    XL1'00'                                                  00002570
         DC    H'0002'                                                  00002580
         DC    CL3'R d'                                                 00002590
         DC    XL1'00'                                                  00002600
         DC    XL4'00240012'                                            00002610
         DC    F'65572'                                                 00002620
         DC    H'0'                                                     00002630
         DC    CL32'FIXED BLOCK SERVO SEEK TEST: BSR'                   00002640
         DC    CL4'VOSK'                                                00002650
         DC    H'0054'                                                  00002660
         DC    XL2'9000'                                                00002670
         DC    CL1' '                                                   00002680
         DC    XL1'00'                                                  00002690
         DC    H'0002'                                                  00002700
         DC    CL3'R d'                                                 00002710
         DC    XL1'00'                                                  00002720
         DC    H'0036'                                                  00002730
         DC    XL4'00120001'                                            00002740
         DC    XL4'00240000'                                            00002750
         DC    CL32'FIXED BLOCK RANDOM SEEK TEST: BR'                   00002760
         DC    CL4'ANSK'                                                00002770
         DC    XL4'00439000'                                            00002780
         DC    CL1' '                                                   00002790
         DC    XL1'00'                                                  00002800
         DC    H'0002'                                                  00002810
         DC    CL3'R d'                                                 00002820
         DC    XL1'00'                                                  00002830
         DC    XL4'00310012'                                            00002840
         DC    F'65585'                                                 00002850
         DC    H'0'                                                     00002860
         DC    CL32'FIXED BLOCK READ PREFORMATTED BL'                   00002870
         DC    CL17'OCK TEST: BWRNFPS'                                  00002880
         DC    XL1'00'                                                  00002890
         DC    XL4'00439000'                                            00002900
         DC    CL1' '                                                   00002910
         DC    XL1'00'                                                  00002920
         DC    H'0002'                                                  00002930
         DC    CL3'R d'                                                 00002940
         DC    XL1'00'                                                  00002950
         DC    XL4'00310012'                                            00002960
         DC    F'65585'                                                 00002970
         DC    H'0'                                                     00002980
         DC    CL32'FIXED BLOCK WRITE PRESELECTED BL'                   00002990
         DC    CL17'OCKS TEST: BWRNFP'                                  00003000
         DC    XL1'00'                                                  00003010
         DC    XL4'00489000'                                            00003020
         DC    CL1' '                                                   00003030
         DC    XL1'00'                                                  00003040
         DC    H'0002'                                                  00003050
         DC    CL3'R d'                                                 00003060
         DC    XL1'00'                                                  00003070
         DC    XL4'00360012'                                            00003080
         DC    F'65590'                                                 00003090
         DC    H'0'                                                     00003100
         DC    CL32'FIXED BLOCK ERROR READING ID FIE'                   00003110
         DC    CL22'LD, TESTING TERMINATED'                             00003120
         DC    XL4'00469000'                                            00003130
         DC    CL1' '                                                   00003140
         DC    XL1'00'                                                  00003150
         DC    H'0002'                                                  00003160
         DC    CL3'R d'                                                 00003170
         DC    XL1'00'                                                  00003180
         DC    XL4'00340012'                                            00003190
         DC    F'65588'                                                 00003200
         DC    H'0'                                                     00003210
         DC    CL32'UNIT HAS UNFORMATTED DATA BLOCKS'                   00003220
         DC    CL20', TESTING TERMINATED'                               00003230
         DC    H'0056'                                                  00003240
         DC    XL2'9000'                                                00003250
         DC    CL1' '                                                   00003260
         DC    XL1'00'                                                  00003270
         DC    H'0002'                                                  00003280
         DC    CL3'R d'                                                 00003290
         DC    XL1'00'                                                  00003300
         DC    H'0038'                                                  00003310
         DC    XL4'00120001'                                            00003320
         DC    XL4'00260000'                                            00003330
         DC    CL32'FIXED BLOCK DATA COMPARE FAILED:'                   00003340
         DC    CL6' BWRCE'                                              00003350
         DC    H'0057'                                                  00003360
         DC    XL2'9000'                                                00003370
         DC    CL1' '                                                   00003380
         DC    XL1'00'                                                  00003390
         DC    H'0002'                                                  00003400
         DC    CL3'R d'                                                 00003410
         DC    XL1'00'                                                  00003420
         DC    H'0039'                                                  00003430
         DC    XL4'00120001'                                            00003440
         DC    XL4'00270000'                                            00003450
         DC    CL32'DATAVER: DATA CHECKS EXCEEDED TH'                   00003460
         DC    CL7'RESHOLD'                                             00003470
         DC    XL1'00'                                                  00003480
         DC    XL4'00499000'                                            00003490
         DC    CL1' '                                                   00003500
         DC    XL1'00'                                                  00003510
         DC    H'0001'                                                  00003520
         DC    CL3'E d'                                                 00003530
         DC    XL1'00'                                                  00003540
         DC    XL4'00370012'                                            00003550
         DC    F'65591'                                                 00003560
         DC    H'0'                                                     00003570
         DC    CL32'                              MO'                   00003580
         DC    CL23'VEABLE HEAD ERROR TABLE'                            00003590
         DC    XL1'00'                                                  00003600
         DC    XL1'00'                                                  00003610
         DC    CL1'¬'                                                   00003620
         DC    XL2'9000'                                                00003630
         DC    CL1' '                                                   00003640
         DC    XL1'00'                                                  00003650
         DC    H'0001'                                                  00003660
         DC    CL3'R d'                                                 00003670
         DC    XL1'00'                                                  00003680
         DC    XL1'00'                                                  00003690
         DC    CL1'('                                                   00003700
         DC    XL4'00120001'                                            00003710
         DC    XL1'00'                                                  00003720
         DC    CL1'('                                                   00003730
         DC    H'0'                                                     00003740
         DC    CL32'      HEAD NUMBER   DATA CHK   S'                   00003750
         DC    CL32'EEK VERIFY   WRITE CHK   DATA CH'                   00003760
         DC    CL13'K   DATA COMP'                                      00003770
         DC    XL1'00'                                                  00003780
         DC    XL1'00'                                                  00003790
         DC    CL1'-'                                                   00003800
         DC    XL2'9000'                                                00003810
         DC    CL1' '                                                   00003820
         DC    XL1'00'                                                  00003830
         DC    H'0'                                                     00003840
         DC    CL3'R d'                                                 00003850
         DC    XL1'00'                                                  00003860
         DC    XL1'00'                                                  00003870
         DC    CL1'+'                                                   00003880
         DC    XL4'00120001'                                            00003890
         DC    XL1'00'                                                  00003900
         DC    CL1'+'                                                   00003910
         DC    H'0'                                                     00003920
         DC    CL32'                                '                   00003930
         DC    CL32'  CHECK                     CE C'                   00003940
         DC    CL14'YL    ERROR   '                                     00003950
         DC    H'0069'                                                  00003960
         DC    XL2'9000'                                                00003970
         DC    CL1' '                                                   00003980
         DC    XL1'00'                                                  00003990
         DC    H'0001'                                                  00004000
         DC    CL3'E d'                                                 00004010
         DC    XL1'00'                                                  00004020
         DC    H'0051'                                                  00004030
         DC    XL4'00120001'                                            00004040
         DC    XL4'00330000'                                            00004050
         DC    CL32'                             FIX'                   00004060
         DC    CL19'ED HEAD ERROR TABLE'                                00004070
         DC    XL1'00'                                                  00004080
         DC    XL4'00629000'                                            00004090
         DC    CL1' '                                                   00004100
         DC    XL1'00'                                                  00004110
         DC    H'0001'                                                  00004120
         DC    CL3'R d'                                                 00004130
         DC    XL1'00'                                                  00004140
         DC    XL1'00'                                                  00004150
         DC    CL1'&&'                                                  00004160
         DC    H'0018'                                                  00004170
         DC    XL3'000100'                                              00004180
         DC    CL1'&&'                                                  00004190
         DC    H'0'                                                     00004200
         DC    CL32'   HEAD NUMBER  DATA CHECK SEEK '                   00004210
         DC    CL32'VERIFY     HEAD NUMBER  DATA CHE'                   00004220
         DC    CL16'CK SEEK VERIFY  '                                   00004230
         DC    H'0098'                                                  00004240
         DC    XL2'9000'                                                00004250
         DC    CL1' '                                                   00004260
         DC    XL1'00'                                                  00004270
         DC    H'0'                                                     00004280
         DC    CL3'R d'                                                 00004290
         DC    XL1'00'                                                  00004300
         DC    XL1'00'                                                  00004310
         DC    CL1'&&'                                                  00004320
         DC    XL4'00120001'                                            00004330
         DC    XL1'00'                                                  00004340
         DC    CL1'&&'                                                  00004350
         DC    H'0'                                                     00004360
         DC    CL32'                              CH'                   00004370
         DC    CL32'ECK                             '                   00004380
         DC    CL16'      CHECK     '                                   00004390
         DC    XL4'00629000'                                            00004400
         DC    CL1' '                                                   00004410
         DC    XL1'00'                                                  00004420
         DC    H'0'                                                     00004430
         DC    CL3'R d'                                                 00004440
         DC    XL1'00'                                                  00004450
         DC    XL1'00'                                                  00004460
         DC    CL1'&&'                                                  00004470
         DC    H'0018'                                                  00004480
         DC    XL3'000100'                                              00004490
         DC    CL1'&&'                                                  00004500
         DC    H'0'                                                     00004510
         DC    CL18'          -- -----'                                 00004520
         DC    XL1'4F'                                                  00004530
         DC    CL10'----------'                                         00004540
         DC    XL1'4F'                                                  00004550
         DC    CL13'-------------'                                      00004560
         DC    XL1'4F'                                                  00004570
         DC    CL11'-----------'                                        00004580
         DC    XL1'4F'                                                  00004590
         DC    CL10'----------'                                         00004600
         DC    XL1'4F'                                                  00004610
         DC    CL10'----------'                                         00004620
         DC    XL1'4F'                                                  00004630
         DC    CL2'  '                                                  00004640
         DC    H'0098'                                                  00004650
         DC    XL2'9000'                                                00004660
         DC    CL1' '                                                   00004670
         DC    XL1'00'                                                  00004680
         DC    H'0'                                                     00004690
         DC    CL3'R d'                                                 00004700
         DC    XL1'00'                                                  00004710
         DC    XL1'00'                                                  00004720
         DC    CL1'&&'                                                  00004730
         DC    XL4'00120001'                                            00004740
         DC    XL1'00'                                                  00004750
         DC    CL1'&&'                                                  00004760
         DC    H'0'                                                     00004770
         DC    CL14'      -- -----'                                     00004780
         DC    XL1'4F'                                                  00004790
         DC    CL11'-----------'                                        00004800
         DC    XL1'4F'                                                  00004810
         DC    CL11'-----------'                                        00004820
         DC    XL1'4F'                                                  00004830
         DC    CL15'       -- -----'                                    00004840
         DC    XL1'4F'                                                  00004850
         DC    CL11'-----------'                                        00004860
         DC    XL1'4F'                                                  00004870
         DC    CL11'-----------'                                        00004880
         DC    XL1'4F'                                                  00004890
         DC    CL1' '                                                   00004900
         DC    XL4'00489000'                                            00004910
         DC    CL1' '                                                   00004920
         DC    XL1'00'                                                  00004930
         DC    H'0002'                                                  00004940
         DC    CL3'R d'                                                 00004950
         DC    XL1'80'                                                  00004960
         DC    XL4'00360012'                                            00004970
         DC    F'65590'                                                 00004980
         DC    H'0'                                                     00004990
         DC    CL32'ICK31413I DATA FORMAT UNACCEPTAB'                   00005000
         DC    CL22'LE, TESTING TERMINATED'                             00005010
         DC    XL4'00499000'                                            00005020
         DC    CL1' '                                                   00005030
         DC    XL1'00'                                                  00005040
         DC    H'0002'                                                  00005050
         DC    CL3'R d'                                                 00005060
         DC    XL1'80'                                                  00005070
         DC    XL4'00370012'                                            00005080
         DC    F'65591'                                                 00005090
         DC    H'0'                                                     00005100
         DC    CL32'ICK01414I WRITE INHIBIT SWITCH O'                   00005110
         DC    CL23'N, WRITE TESTS BYPASSED'                            00005120
         DC    XL1'00'                                                  00005130
         DC    XL1'00'                                                  00005140
         DC    CL1'.'                                                   00005150
         DC    XL2'9000'                                                00005160
         DC    CL1' '                                                   00005170
         DC    XL1'00'                                                  00005180
         DC    H'0002'                                                  00005190
         DC    CL3'R d'                                                 00005200
         DC    XL1'80'                                                  00005210
         DC    H'0057'                                                  00005220
         DC    XL4'00120001'                                            00005230
         DC    XL4'00390000'                                            00005240
         DC    CL32'ICK01415I INVALID UNITADDRESS,SY'                   00005250
         DC    CL25'SNAME OR DDNAME SPECIFIED'                          00005260
         DC    XL1'00'                                                  00005270
         DC    H'0049'                                                  00005280
         DC    XL2'9000'                                                00005290
         DC    CL1' '                                                   00005300
         DC    XL1'00'                                                  00005310
         DC    H'0002'                                                  00005320
         DC    CL3'R d'                                                 00005330
         DC    XL1'80'                                                  00005340
         DC    H'0031'                                                  00005350
         DC    XL4'00120001'                                            00005360
         DC    XL4'001F0000'                                            00005370
         DC    CL31'ICK01416I UNABLE TO OPEN VOLUME'                    00005380
         DC    XL1'00'                                                  00005390
         DC    XL1'00'                                                  00005400
         DC    CL1'-'                                                   00005410
         DC    XL2'9000'                                                00005420
         DC    CL1' '                                                   00005430
         DC    XL1'00'                                                  00005440
         DC    H'0002'                                                  00005450
         DC    CL3'R d'                                                 00005460
         DC    XL1'80'                                                  00005470
         DC    XL1'00'                                                  00005480
         DC    CL1'+'                                                   00005490
         DC    H'0018'                                                  00005500
         DC    XL3'000100'                                              00005510
         DC    CL1'+'                                                   00005520
         DC    H'0'                                                     00005530
         DC    CL32'ICK01417I     WRITE TESTS BYPASS'                   00005540
         DC    CL32'ED: BAD HOME ADDRESS DETECTED ON'                   00005550
         DC    CL14' C.E. CYLINDER'                                     00005560
         DC    XL4'002E9000'                                            00005570
         DC    CL1' '                                                   00005580
         DC    XL1'00'                                                  00005590
         DC    H'0002'                                                  00005600
         DC    CL3'R d'                                                 00005610
         DC    XL1'00'                                                  00005620
         DC    XL4'001C0012'                                            00005630
         DC    F'65564'                                                 00005640
         DC    H'0'                                                     00005650
         DC    CL28'SNS TEST: ERROR IN SENSE CCW'                       00005660
         DC    H'0063'                                                  00005670
         DC    XL2'9000'                                                00005680
         DC    CL1' '                                                   00005690
         DC    XL1'00'                                                  00005700
         DC    H'0002'                                                  00005710
         DC    CL3'R d'                                                 00005720
         DC    XL1'00'                                                  00005730
         DC    H'0045'                                                  00005740
         DC    XL4'00120001'                                            00005750
         DC    XL4'002D0000'                                            00005760
         DC    CL32'RECAL TEST: RECALIBRATE TO CYL 0'                   00005770
         DC    CL13' HEAD 0 FAILS'                                      00005780
         DC    XL1'00'                                                  00005790
         DC    XL1'00'                                                  00005800
         DC    CL1'.'                                                   00005810
         DC    XL2'9000'                                                00005820
         DC    CL1' '                                                   00005830
         DC    XL1'00'                                                  00005840
         DC    H'0002'                                                  00005850
         DC    CL3'R d'                                                 00005860
         DC    XL1'00'                                                  00005870
         DC    H'0057'                                                  00005880
         DC    XL4'00120001'                                            00005890
         DC    XL4'00390000'                                            00005900
         DC    CL32'RHAMH TEST: READ HOME ADDRESS UN'                   00005910
         DC    CL25'DER MOVEABLE HEADS FAILED'                          00005920
         DC    XL1'00'                                                  00005930
         DC    H'0072'                                                  00005940
         DC    XL2'9000'                                                00005950
         DC    CL1' '                                                   00005960
         DC    XL1'00'                                                  00005970
         DC    H'0002'                                                  00005980
         DC    CL3'R d'                                                 00005990
         DC    XL1'00'                                                  00006000
         DC    H'0054'                                                  00006010
         DC    XL4'00120001'                                            00006020
         DC    XL4'00360000'                                            00006030
         DC    CL32'RHAFH TEST: READ HOME ADDRESS UN'                   00006040
         DC    CL22'DER FIXED HEADS FAILED'                             00006050
         DC    H'0072'                                                  00006060
         DC    XL2'9000'                                                00006070
         DC    CL1' '                                                   00006080
         DC    XL1'00'                                                  00006090
         DC    H'0002'                                                  00006100
         DC    CL3'R d'                                                 00006110
         DC    XL1'00'                                                  00006120
         DC    H'0054'                                                  00006130
         DC    XL4'00120001'                                            00006140
         DC    XL4'00360000'                                            00006150
         DC    CL32'SKINCR TEST: INCREMENTAL MOVEMEN'                   00006160
         DC    CL22'T OF ACCESS ARM FAILED'                             00006170
         DC    H'0059'                                                  00006180
         DC    XL2'9000'                                                00006190
         DC    CL1' '                                                   00006200
         DC    XL1'00'                                                  00006210
         DC    H'0002'                                                  00006220
         DC    CL3'R d'                                                 00006230
         DC    XL1'00'                                                  00006240
         DC    H'0041'                                                  00006250
         DC    XL4'00120001'                                            00006260
         DC    XL4'00290000'                                            00006270
         DC    CL32'SKRAN TEST: RANDOM CYLINDER ACCE'                   00006280
         DC    CL9'SS FAILED'                                           00006290
         DC    XL1'00'                                                  00006300
         DC    XL1'00'                                                  00006310
         DC    CL1'('                                                   00006320
         DC    XL2'9000'                                                00006330
         DC    CL1' '                                                   00006340
         DC    XL1'00'                                                  00006350
         DC    H'0002'                                                  00006360
         DC    CL3'R d'                                                 00006370
         DC    XL1'00'                                                  00006380
         DC    H'0059'                                                  00006390
         DC    XL4'00120001'                                            00006400
         DC    XL4'003B0000'                                            00006410
         DC    CL32'SKMAX TEST: SEEK FROM CYLINDER 0'                   00006420
         DC    CL27' TO MAXIMUM CYLINDER FAILED'                        00006430
         DC    XL1'00'                                                  00006440
         DC    XL4'00459000'                                            00006450
         DC    CL1' '                                                   00006460
         DC    XL1'00'                                                  00006470
         DC    H'0002'                                                  00006480
         DC    CL3'R d'                                                 00006490
         DC    XL1'00'                                                  00006500
         DC    XL4'00330012'                                            00006510
         DC    F'65587'                                                 00006520
         DC    H'0'                                                     00006530
         DC    CL32'RHA TEST: READ HOME ADDRESS ON C'                   00006540
         DC    CL19'.E. CYLINDER FAILED'                                00006550
         DC    XL1'00'                                                  00006560
         DC    XL1'00'                                                  00006570
         DC    CL1'.'                                                   00006580
         DC    XL2'9000'                                                00006590
         DC    CL1' '                                                   00006600
         DC    XL1'00'                                                  00006610
         DC    H'0002'                                                  00006620
         DC    CL3'R d'                                                 00006630
         DC    XL1'00'                                                  00006640
         DC    H'0057'                                                  00006650
         DC    XL4'00120001'                                            00006660
         DC    XL4'00390000'                                            00006670
         DC    CL32'WRT TEST: WRITE RECORDS R0 AND R'                   00006680
         DC    CL25'1 ON C.E. CYLINDER FAILED'                          00006690
         DC    XL1'00'                                                  00006700
         DC    H'0069'                                                  00006710
         DC    XL2'9000'                                                00006720
         DC    CL1' '                                                   00006730
         DC    XL1'00'                                                  00006740
         DC    H'0002'                                                  00006750
         DC    CL3'R d'                                                 00006760
         DC    XL1'00'                                                  00006770
         DC    H'0051'                                                  00006780
         DC    XL4'00120001'                                            00006790
         DC    XL4'00330000'                                            00006800
         DC    CL32'RDMT TEST: MULTI-TRACK READ ON C'                   00006810
         DC    CL19'.E. CYLINDER FAILED'                                00006820
         DC    XL1'00'                                                  00006830
         DC    XL4'003B9000'                                            00006840
         DC    CL1' '                                                   00006850
         DC    XL1'00'                                                  00006860
         DC    H'0002'                                                  00006870
         DC    CL3'R d'                                                 00006880
         DC    XL1'00'                                                  00006890
         DC    XL4'00290012'                                            00006900
         DC    F'65577'                                                 00006910
         DC    H'0'                                                     00006920
         DC    CL32'RDMT DATA COMPARE TEST: WRONG RE'                   00006930
         DC    CL9'CORD READ'                                           00006940
         DC    XL1'00'                                                  00006950
         DC    XL4'00639000'                                            00006960
         DC    CL1' '                                                   00006970
         DC    XL1'00'                                                  00006980
         DC    H'0002'                                                  00006990
         DC    CL3'R d'                                                 00007000
         DC    XL1'00'                                                  00007010
         DC    XL4'00510012'                                            00007020
         DC    F'65617'                                                 00007030
         DC    H'0'                                                     00007040
         DC    CL32'WRTPAD READ WRONG RECORD--EXP=  '                   00007050
         DC    CL32'                     REC=       '                   00007060
         DC    CL17'                 '                                  00007070
         DC    XL1'00'                                                  00007080
         DC    XL4'002D9000'                                            00007090
         DC    CL1' '                                                   00007100
         DC    XL1'00'                                                  00007110
         DC    H'0002'                                                  00007120
         DC    CL3'R d'                                                 00007130
         DC    XL1'00'                                                  00007140
         DC    XL4'001B0012'                                            00007150
         DC    F'65563'                                                 00007160
         DC    H'0'                                                     00007170
         DC    CL27'*** WRITE INHIBIT SWITCH ON'                        00007180
         DC    XL1'00'                                                  00007190
         DC    H'0060'                                                  00007200
         DC    XL2'9000'                                                00007210
         DC    CL1' '                                                   00007220
         DC    XL1'00'                                                  00007230
         DC    H'0002'                                                  00007240
         DC    CL3'R d'                                                 00007250
         DC    XL1'00'                                                  00007260
         DC    H'0042'                                                  00007270
         DC    XL4'00120001'                                            00007280
         DC    XL4'002A0000'                                            00007290
         DC    CL32'WRTPAD TEST: WRITE COUNT, KEY, D'                   00007300
         DC    CL10'ATA FAILED'                                         00007310
         DC    H'0061'                                                  00007320
         DC    XL2'9000'                                                00007330
         DC    CL1' '                                                   00007340
         DC    XL1'00'                                                  00007350
         DC    H'0002'                                                  00007360
         DC    CL3'R d'                                                 00007370
         DC    XL1'00'                                                  00007380
         DC    H'0043'                                                  00007390
         DC    XL4'00120001'                                            00007400
         DC    XL4'002B0000'                                            00007410
         DC    CL32'DATAVER TEST: ERROR DURING DATA '                   00007420
         DC    CL11'VERFICATION'                                        00007430
         DC    XL1'00'                                                  00007440
         DC    XL4'00479000'                                            00007450
         DC    CL1' '                                                   00007460
         DC    XL1'00'                                                  00007470
         DC    H'0002'                                                  00007480
         DC    CL3'R d'                                                 00007490
         DC    XL1'00'                                                  00007500
         DC    XL4'00350012'                                            00007510
         DC    F'65589'                                                 00007520
         DC    H'0'                                                     00007530
         DC    CL32'CLEANUP TEST: CLEANUP OF C.E. CY'                   00007540
         DC    CL21'LINDER TRACK 0 FAILED'                              00007550
         DC    XL1'00'                                                  00007560
         DC    XL4'00559000'                                            00007570
         DC    CL1' '                                                   00007580
         DC    XL1'00'                                                  00007590
         DC    H'0002'                                                  00007600
         DC    CL3'R d'                                                 00007610
         DC    XL1'00'                                                  00007620
         DC    XL4'00430012'                                            00007630
         DC    F'65603'                                                 00007640
         DC    H'0'                                                     00007650
         DC    CL32'RHA HA INCORRECT: HOME ADDRESS R'                   00007660
         DC    CL32'EAD FROM C.E. CYLINDER IS INCORR'                   00007670
         DC    CL3'ECT'                                                 00007680
         DC    XL1'00'                                                  00007690
         DC    H'0057'                                                  00007700
         DC    XL2'9000'                                                00007710
         DC    CL1' '                                                   00007720
         DC    XL1'00'                                                  00007730
         DC    H'0002'                                                  00007740
         DC    CL3'R d'                                                 00007750
         DC    XL1'00'                                                  00007760
         DC    H'0039'                                                  00007770
         DC    XL4'00120001'                                            00007780
         DC    XL4'00270000'                                            00007790
         DC    CL32'DATAVER DATA FORMAT UNACCEPTABLE'                   00007800
         DC    CL7' ON CYL'                                             00007810
         DC    XL1'00'                                                  00007820
         DC    XL4'003D9000'                                            00007830
         DC    CL1' '                                                   00007840
         DC    XL1'00'                                                  00007850
         DC    H'0002'                                                  00007860
         DC    CL3'R d'                                                 00007870
         DC    XL1'00'                                                  00007880
         DC    XL4'002B0012'                                            00007890
         DC    F'65579'                                                 00007900
         DC    H'0'                                                     00007910
         DC    CL32'RPS ERROR: READ SECTOR OR SET SE'                   00007920
         DC    CL11'CTOR FAILED'                                        00007930
         DC    XL1'00'                                                  00007940
         DC    H'0062'                                                  00007950
         DC    XL2'9000'                                                00007960
         DC    CL1' '                                                   00007970
         DC    XL1'00'                                                  00007980
         DC    H'0002'                                                  00007990
         DC    CL3'R d'                                                 00008000
         DC    XL1'00'                                                  00008010
         DC    H'0044'                                                  00008020
         DC    XL4'00120001'                                            00008030
         DC    XL4'002C0000'                                            00008040
         DC    CL32'INVALID LIMITS SPECIFIED, TESTIN'                   00008050
         DC    CL12'G TERMINATED'                                       00008060
         DC    XL1'00'                                                  00008070
         DC    CL1'$'                                                   00008080
         DC    XL2'9000'                                                00008090
         DC    CL1' '                                                   00008100
         DC    XL1'00'                                                  00008110
         DC    H'0002'                                                  00008120
         DC    CL3'R d'                                                 00008130
         DC    XL1'00'                                                  00008140
         DC    XL4'00490012'                                            00008150
         DC    F'65609'                                                 00008160
         DC    H'0'                                                     00008170
         DC    CL32'DATA CHECK ON ID OR DATA FIELD O'                   00008180
         DC    CL32'RIENTATION ADDR =               '                   00008190
         DC    CL9'         '                                           00008200
         DC    XL1'00'                                                  00008210
         DC    XL4'00489000'                                            00008220
         DC    CL1' '                                                   00008230
         DC    XL1'00'                                                  00008240
         DC    H'0002'                                                  00008250
         DC    CL3'R d'                                                 00008260
         DC    XL1'00'                                                  00008270
         DC    XL4'00360012'                                            00008280
         DC    F'65590'                                                 00008290
         DC    H'0'                                                     00008300
         DC    CL32'DATAVER PERMANENT ERROR ADDR =  '                   00008310
         DC    CL22'                      '                             00008320
         DC    XL4'00489000'                                            00008330
         DC    CL1' '                                                   00008340
         DC    XL1'00'                                                  00008350
         DC    H'0002'                                                  00008360
         DC    CL3'R d'                                                 00008370
         DC    XL1'00'                                                  00008380
         DC    XL4'00360012'                                            00008390
         DC    F'65590'                                                 00008400
         DC    H'0'                                                     00008410
         DC    CL32'DATAVER TEMPORARY ERROR ADDR =  '                   00008420
         DC    CL30'                      03/16/82'                     00008430
R0       EQU   0                                                        00008440
R1       EQU   1                                                        00008450
R2       EQU   2                                                        00008460
R3       EQU   3                                                        00008470
R4       EQU   4                                                        00008480
R5       EQU   5                                                        00008490
R6       EQU   6                                                        00008500
R7       EQU   7                                                        00008510
R8       EQU   8                                                        00008520
R9       EQU   9                                                        00008530
R10      EQU   10                                                       00008540
R11      EQU   11                                                       00008550
R12      EQU   12                                                       00008560
R13      EQU   13                                                       00008570
R14      EQU   14                                                       00008580
R15      EQU   15                                                       00008590
         END                                                            00008600
