*/********************************************************************/ 00300003
*/*                                                                  */ 00600003
*/*  MODULE NAME - IDCCDAL                                           */ 00900003
*/*                                                                  */ 01200003
*/*  DESCRIPTIVE NAME - 'ALTER   ' COMMAND DESCRIPTOR                */ 01500003
*/*                                                                  */ 01800003
*/*  COPYRIGHT - NONE                                                */ 02100003
*/*                                                                  */ 02400003
*/*  STATUS - CHANGE LEVEL = 0                                       */ 02700003
*/*                                                                  */ 03000003
*/*  FUNCTION - UPON RECOGNITION OF THE 'ALTER   ' VERBNAME          */ 03300003
*/*             (OR AN ALLOWABLE ABBREVIATION), THIS MODULE          */ 03600003
*/*             IS LOADED BY THE IDCAMS READER/INTERPRETER.          */ 03900003
*/*             THE INFORMATION CONTAINED IN THIS MODULE IS USED TO  */ 04200003
*/*             SCAN THE INPUT COMMAND AND PERFORM SYNTACTIC AND     */ 04500003
*/*             SEMANTIC CHECKING ON THE PARAMETERS SPECIFIED, AND   */ 04800003
*/*             TO BUILD THE FUNCTION DATA TABLE (FDT) WHICH IS      */ 05100003
*/*             PASSED TO THE 'ALTER   ' FUNCTION SUPPORT ROUTINE    */ 05400003
*/*             (IDCAL01 ).                                          */ 05700003
*/*                                                                  */ 06000003
*/*  NOTES -                                                         */ 06300003
*/*                                                                  */ 06600003
*/*     DEPENDENCIES - THE CHARACTER CODES CONTAINED IN THIS TABLE   */ 06900003
*/*                    MUST MATCH THOSE OF THE INPUT COMMAND.        */ 07200003
*/*                    THE CURRENT CHARACTER CODE IS 'EBCDIC'.       */ 07500003
*/*                                                                  */ 07800003
*/*     RESTRICTIONS - N/A                                           */ 08100003
*/*                                                                  */ 08400003
*/*     REGISTER CONVENTIONS - N/A                                   */ 08700003
*/*                                                                  */ 09000003
*/*     PATCH LABEL - N/A                                            */ 09300003
*/*                                                                  */ 09600003
*/*  MODULE TYPE - TABLE                                             */ 09900003
*/*                                                                  */ 10200003
*/*     PROCESSOR - ASSEMBLER                                        */ 10500003
*/*                                                                  */ 10800003
*/*     MODULE SIZE - 6946 DECIMAL BYTES                             */ 11100003
*/*                                                                  */ 11400003
*/*     ATTRIBUTES - READ ONLY                                       */ 11700003
*/*                                                                  */ 12000003
*/*  ENTRY POINT - N/A                                               */ 12300003
*/*                                                                  */ 12600003
*/*     PURPOSE - N/A                                                */ 12900003
*/*                                                                  */ 13200003
*/*     LINKAGE - N/A                                                */ 13500003
*/*                                                                  */ 13800003
*/*  INPUT - N/A                                                     */ 14100003
*/*                                                                  */ 14400003
*/*  OUTPUT - N/A                                                    */ 14700003
*/*                                                                  */ 15000003
*/*  EXIT NORMAL - N/A                                               */ 15300003
*/*                                                                  */ 15600003
*/*  EXIT ERROR - N/A                                                */ 15900003
*/*                                                                  */ 16200003
*/*  EXTERNAL REFERENCES - N/A                                       */ 16500003
*/*                                                                  */ 16800003
*/*     ROUTINES - N/A                                               */ 17100003
*/*                                                                  */ 17400003
*/*     DATA AREAS - N/A                                             */ 17700003
*/*                                                                  */ 18000003
*/*     CONTROL BLOCKS - N/A                                         */ 18300003
*/*                                                                  */ 18600003
*/*  TABLES - N/A                                                    */ 18900003
*/*                                                                  */ 19200003
*/*  MACROS - N/A                                                    */ 19500003
*/*                                                                  */ 19800003
*/*  CHANGE ACTIVITY - NONE                                          */ 20100003
*/*                                                                  */ 20400003
*/********************************************************************/ 20700003
         PRINT DATA                                                     21000003
IDCCDAL  CSECT                                                          21300003
        DC    C'CDAL'                                           DSK0210 21600003
        DC    AL2(3376)       0D30                              DSK0210 21900003
        DC    AL2(56)         0038                              DSK0210 22200003
        DC    AL2(67)         0043                              DSK0210 22500003
        DC    AL2(73)         0049                              DSK0210 22800003
        DC    C'IDCAL01 '                                       DSK0210 23100003
        DC    AL2(3072)       0C00                              DSK0210 23400003
        DC    AL2(3601)       0E11                              DSK0210 23700003
        DC    AL2(1)          0001                              DSK0210 24000003
        DC    AL2(1)          0001                              DSK0210 24300003
        DC    AL2(1)          0001                              DSK0210 24600003
        DC    AL2(1)          0001                              DSK0210 24900003
        DC    AL2(1)          0001                              DSK0210 25200003
        DC    AL2(12)         000C                              DSK0210 25500003
        DC    AL2(2)          0002                              DSK0210 25800003
        DC    AL2(18)         0012                              DSK0210 26100003
        DC    AL2(19)         0013                              DSK0210 26400003
        DC    AL2(2)          0002                              DSK0210 26700003
        DC    AL2(21)         0015                              DSK0210 27000003
        DC    AL2(22)         0016                              DSK0210 27300003
        DC    AL2(2)          0002                              DSK0210 27600003
        DC    AL2(46)         002E                              DSK0210 27900003
        DC    AL2(47)         002F                              DSK0210 28200003
        DC    AL2(2)          0002                              DSK0210 28500003
        DC    AL2(34)         0022                              DSK0210 28800003
        DC    AL2(35)         0023                              DSK0210 29100003
        DC    AL2(2)          0002                              DSK0210 29400003
        DC    AL2(40)         0028                              DSK0210 29700003
        DC    AL2(41)         0029                              DSK0210 30000003
        DC    AL2(2)          0002                              DSK0210 30300003
        DC    AL2(50)         0032                              DSK0210 30600003
        DC    AL2(51)         0033                              DSK0210 30900003
        DC    AL2(2)          0002                              DSK0210 31200003
        DC    AL2(52)         0034                              DSK0210 31500003
        DC    AL2(53)         0035                              DSK0210 31800003
        DC    AL2(2)          0002                              DSK0210 32100003
        DC    AL2(62)         003E                              DSK0210 32400003
        DC    AL2(63)         003F                              DSK0210 32700003
        DC    AL2(2)          0002                              DSK0210 33000003
        DC    AL2(64)         0040                              DSK0210 33300003
        DC    AL2(65)         0041                              DSK0210 33600003
        DC    AL2(2)          0002                              DSK0210 33900003
        DC    AL2(66)         0042                              DSK0210 34200003
        DC    AL2(67)         0043                              DSK0210 34500003
        DC    AL2(3)          0003                              DSK0210 34800003
        DC    AL2(69)         0045                              DSK0210 35100003
        DC    AL2(70)         0046                              DSK0210 35400003
        DC    AL2(71)         0047                              DSK0210 35700003
        DC    AL2(2)          0002                              DSK0210 36000003
        DC    AL2(72)         0048                              DSK0210 36300003
        DC    AL2(73)         0049                              DSK0210 36600003
        DC    AL2(0)          0000                              DSK0210 36900003
        DC    AL2(4096)       1000                              DSK0210 37200003
        DC    AL2(1)          0001                              DSK0210 37500003
        DC    AL2(3072)       0C00                              DSK0210 37800003
        DC    AL2(0)          0000                              DSK0210 38100003
        DC    AL2(0)          0000                              DSK0210 38400003
        DC    AL2(208)        00D0                              DSK0210 38700003
        DC    AL2(0)          0000                              DSK0210 39000003
        DC    AL2(0)          0000                              DSK0210 39300003
        DC    AL2(0)          0000                              DSK0210 39600003
        DC    AL2(0)          0000                              DSK0210 39900003
        DC    AL2(11264)      2C00                              DSK0210 40200003
        DC    AL2(54)         0036                              DSK0210 40500003
        DC    AL2(1)          0001                              DSK0210 40800003
        DC    AL2(1)          0001                              DSK0210 41100003
        DC    AL2(8)          0008                              DSK0210 41400003
        DC    AL2(0)          0000                              DSK0210 41700003
        DC    AL2(6144)       1800                              DSK0210 41700004
        DC    AL2(1)          0001                              DSK0210 41700005
        DC    AL2(2059)       080B                              DSK0210 41700006
        DC    AL2(0)          0000                              DSK0210 41700007
        DC    AL2(1)          0001                              DSK0210 41700008
        DC    AL2(66)         0042                              DSK0210 41700009
        DC    AL2(0)          0000                              DSK0210 41700010
        DC    AL2(4608)       1200                              DSK0210 41700011
        DC    AL2(1)          0001                              DSK0210 41700012
        DC    AL2(2)          0002                              DSK0210 41700013
        DC    AL2(32)         0020                              DSK0210 41700014
        DC    AL2(519)        0207                              DSK0210 41700015
        DC    C'CATALOG'                                        DSK0210 41700016
        DC    AL1(3)          03                                DSK0210 41700017
        DC    C'CAT'                                            DSK0210 41700018
        DC    AL2(0)          0000                              DSK0210 41700019
        DC    AL2(727)        02D7                              DSK0210 41700020
        DC    AL2(16384)      4000                              DSK0210 41700021
        DC    AL2(983)        03D7                              DSK0210 41700022
        DC    AL2(16384)      4000                              DSK0210 41700023
        DC    AL2(1024)       0400                              DSK0210 41700024
        DC    AL2(16)         0010                              DSK0210 41700025
        DC    AL2(0)          0000                              DSK0210 41700026
        DC    AL2(268)        010C                              DSK0210 41700027
        DC    AL2(0)          0000                              DSK0210 41700028
        DC    AL2(0)          0000                              DSK0210 41700029
        DC    AL2(0)          0000                              DSK0210 41700030
        DC    AL2(36864)      9000                              DSK0210 41700031
        DC    AL2(0)          0000                              DSK0210 41700032
        DC    AL2(0)          0000                              DSK0210 41700033
        DC    AL2(0)          0000                              DSK0210 41700034
        DC    AL2(44)         002C                              DSK0210 41700035
        DC    AL2(0)          0000                              DSK0210 41700036
        DC    AL2(9728)       2600                              DSK0210 41700037
        DC    AL2(256)        0100                              DSK0210 41700038
        DC    AL2(768)        0300                              DSK0210 41700039
        DC    AL2(24576)      6000                              DSK0210 41700040
        DC    AL2(16)         0010                              DSK0210 41700041
        DC    AL2(0)          0000                              DSK0210 41700042
        DC    AL2(268)        010C                              DSK0210 41700043
        DC    AL2(0)          0000                              DSK0210 41700044
        DC    AL2(0)          0000                              DSK0210 41700045
        DC    AL2(0)          0000                              DSK0210 41700046
        DC    AL2(36864)      9000                              DSK0210 41700047
        DC    AL2(0)          0000                              DSK0210 41700048
        DC    AL2(0)          0000                              DSK0210 41700049
        DC    AL2(0)          0000                              DSK0210 41700050
        DC    AL2(8)          0008                              DSK0210 41700051
        DC    AL2(0)          0000                              DSK0210 41700052
        DC    AL2(16384)      4000                              DSK0210 41700053
        DC    AL2(256)        0100                              DSK0210 41700054
        DC    AL2(1024)       0400                              DSK0210 41700055
        DC    AL2(30720)      7800                              DSK0210 41700056
        DC    AL2(24)         0018                              DSK0210 41700057
        DC    AL2(0)          0000                              DSK0210 41700058
        DC    AL2(268)        010C                              DSK0210 41700059
        DC    AL2(3840)       0F00                              DSK0210 41700060
        DC    AL2(0)          0000                              DSK0210 41700061
        DC    AL2(256)        0100                              DSK0210 41700062
        DC    AL2(53248)      D000                              DSK0210 41700063
        DC    AL2(0)          0000                              DSK0210 41700064
        DC    AL2(0)          0000                              DSK0210 41700065
        DC    AL2(0)          0000                              DSK0210 41700066
        DC    AL2(44)         002C                              DSK0210 41700067
        DC    AL2(0)          0000                              DSK0210 41700068
        DC    AL2(13312)      3400                              DSK0210 41700069
        DC    AL2(256)        0100                              DSK0210 41700070
        DC    AL2(1280)       0500                              DSK0210 41700071
        DC    AL2(32770)      8002                              DSK0210 41700072
        DC    AL1(7)          07                                DSK0210 41700073
        DC    C'NEWNAME'                                        DSK0210 41700074
        DC    AL1(5)          05                                DSK0210 41700075
        DC    C'NEWNM'                                          DSK0210 41700076
        DC    AL2(0)          0000                              DSK0210 41700077
        DC    AL2(18)         0012                              DSK0210 41700078
        DC    AL2(0)          0000                              DSK0210 41700079
        DC    AL2(268)        010C                              DSK0210 41700080
        DC    AL2(3840)       0F00                              DSK0210 41700081
        DC    AL2(0)          0000                              DSK0210 41700082
        DC    AL2(256)        0100                              DSK0210 41700083
        DC    AL2(53248)      D000                              DSK0210 41700084
        DC    AL2(0)          0000                              DSK0210 41700085
        DC    AL2(0)          0000                              DSK0210 41700086
        DC    AL2(0)          0000                              DSK0210 41700087
        DC    AL2(8)          0008                              DSK0210 41700088
        DC    AL2(0)          0000                              DSK0210 41700089
        DC    AL2(16384)      4000                              DSK0210 41700090
        DC    AL2(256)        0100                              DSK0210 41700091
        DC    AL2(1536)       0600                              DSK0210 41700092
        DC    AL2(38913)      9801                              DSK0210 41700093
        DC    AL1(4)          04                                DSK0210 41700094
        DC    C'FILE'                                           DSK0210 41700095
        DC    AL2(6144)       1800                              DSK0210 41700096
        DC    AL2(1)          0001                              DSK0210 41700097
        DC    AL2(3087)       0C0F                              DSK0210 41700098
        DC    AL2(0)          0000                              DSK0210 41700099
        DC    AL2(1)          0001                              DSK0210 41700100
        DC    AL2(208)        00D0                              DSK0210 41700101
        DC    AL2(0)          0000                              DSK0210 41700102
        DC    AL2(0)          0000                              DSK0210 41700103
        DC    AL2(0)          0000                              DSK0210 41700104
        DC    AL2(0)          0000                              DSK0210 41700105
        DC    AL2(2048)       0800                              DSK0210 41700106
        DC    AL2(64)         0040                              DSK0210 41700107
        DC    AL2(1)          0001                              DSK0210 41700108
        DC    AL2(8)          0008                              DSK0210 41700109
        DC    AL2(160)        00A0                              DSK0210 41700110
        DC    AL2(520)        0208                              DSK0210 41700111
        DC    C'MASTERPW'                                       DSK0210 41700112
        DC    AL1(4)          04                                DSK0210 41700113
        DC    C'MRPW'                                           DSK0210 41700114
        DC    AL2(0)          0000                              DSK0210 41700115
        DC    AL2(24)         0018                              DSK0210 41700116
        DC    AL2(0)          0000                              DSK0210 41700117
        DC    AL2(268)        010C                              DSK0210 41700118
        DC    AL2(3840)       0F00                              DSK0210 41700119
        DC    AL2(0)          0000                              DSK0210 41700120
        DC    AL2(256)        0100                              DSK0210 41700121
        DC    AL2(53248)      D000                              DSK0210 41700122
        DC    AL2(0)          0000                              DSK0210 41700123
        DC    AL2(0)          0000                              DSK0210 41700124
        DC    AL2(0)          0000                              DSK0210 41700125
        DC    AL2(8)          0008                              DSK0210 41700126
        DC    AL2(0)          0000                              DSK0210 41700127
        DC    AL2(16384)      4000                              DSK0210 41700128
        DC    AL2(256)        0100                              DSK0210 41700129
        DC    AL2(2304)       0900                              DSK0210 41700130
        DC    AL2(43010)      A802                              DSK0210 41700131
        DC    AL1(9)          09                                DSK0210 41700132
        DC    C'CONTROLPW'                                      DSK0210 41700133
        DC    AL1(5)          05                                DSK0210 41700134
        DC    C'CTLPW'                                          DSK0210 41700135
        DC    AL2(24)         0018                              DSK0210 41700136
        DC    AL2(0)          0000                              DSK0210 41700137
        DC    AL2(268)        010C                              DSK0210 41700138
        DC    AL2(3840)       0F00                              DSK0210 41700139
        DC    AL2(0)          0000                              DSK0210 41700140
        DC    AL2(256)        0100                              DSK0210 41700141
        DC    AL2(53248)      D000                              DSK0210 41700142
        DC    AL2(0)          0000                              DSK0210 41700143
        DC    AL2(0)          0000                              DSK0210 41700144
        DC    AL2(0)          0000                              DSK0210 41700145
        DC    AL2(8)          0008                              DSK0210 41700146
        DC    AL2(0)          0000                              DSK0210 41700147
        DC    AL2(16384)      4000                              DSK0210 41700148
        DC    AL2(256)        0100                              DSK0210 41700149
        DC    AL2(2560)       0A00                              DSK0210 41700150
        DC    AL2(45058)      B002                              DSK0210 41700151
        DC    AL1(8)          08                                DSK0210 41700152
        DC    C'UPDATEPW'                                       DSK0210 41700153
        DC    AL1(5)          05                                DSK0210 41700154
        DC    C'UPDPW'                                          DSK0210 41700155
        DC    AL2(0)          0000                              DSK0210 41700156
        DC    AL2(5632)       1600                              DSK0210 41700157
        DC    AL2(1)          0001                              DSK0210 41700158
        DC    AL2(3087)       0C0F                              DSK0210 41700159
        DC    AL2(0)          0000                              DSK0210 41700160
        DC    AL2(1)          0001                              DSK0210 41700161
        DC    AL2(208)        00D0                              DSK0210 41700162
        DC    AL2(0)          0000                              DSK0210 41700163
        DC    AL2(0)          0000                              DSK0210 41700164
        DC    AL2(0)          0000                              DSK0210 41700165
        DC    AL2(0)          0000                              DSK0210 41700166
        DC    AL2(2048)       0800                              DSK0210 41700167
        DC    AL2(64)         0040                              DSK0210 41700168
        DC    AL2(1)          0001                              DSK0210 41700169
        DC    AL2(11)         000B                              DSK0210 41700170
        DC    AL2(184)        00B8                              DSK0210 41700171
        DC    AL2(518)        0206                              DSK0210 41700172
        DC    C'READPW'                                         DSK0210 41700173
        DC    AL1(4)          04                                DSK0210 41700174
        DC    C'RDPW'                                           DSK0210 41700175
        DC    AL2(18)         0012                              DSK0210 41700176
        DC    AL2(0)          0000                              DSK0210 41700177
        DC    AL2(268)        010C                              DSK0210 41700178
        DC    AL2(3840)       0F00                              DSK0210 41700179
        DC    AL2(0)          0000                              DSK0210 41700180
        DC    AL2(256)        0100                              DSK0210 41700181
        DC    AL2(53248)      D000                              DSK0210 41700182
        DC    AL2(0)          0000                              DSK0210 41700183
        DC    AL2(0)          0000                              DSK0210 41700184
        DC    AL2(0)          0000                              DSK0210 41700185
        DC    AL2(8)          0008                              DSK0210 41700186
        DC    AL2(0)          0000                              DSK0210 41700187
        DC    AL2(16384)      4000                              DSK0210 41700188
        DC    AL2(256)        0100                              DSK0210 41700189
        DC    AL2(3072)       0C00                              DSK0210 41700190
        DC    AL2(49153)      C001                              DSK0210 41700191
        DC    AL1(4)          04                                DSK0210 41700192
        DC    C'CODE'                                           DSK0210 41700193
        DC    AL2(6656)       1A00                              DSK0210 41700194
        DC    AL2(1)          0001                              DSK0210 41700195
        DC    AL2(3087)       0C0F                              DSK0210 41700196
        DC    AL2(0)          0000                              DSK0210 41700197
        DC    AL2(1)          0001                              DSK0210 41700198
        DC    AL2(208)        00D0                              DSK0210 41700199
        DC    AL2(0)          0000                              DSK0210 41700200
        DC    AL2(7)          0007                              DSK0210 41700201
        DC    AL2(0)          0000                              DSK0210 41700202
        DC    AL2(0)          0000                              DSK0210 41700203
        DC    AL2(1024)       0400                              DSK0210 41700204
        DC    AL2(128)        0080                              DSK0210 41700205
        DC    AL2(1)          0001                              DSK0210 41700206
        DC    AL2(13)         000D                              DSK0210 41700207
        DC    AL2(200)        00C8                              DSK0210 41700208
        DC    AL2(776)        0308                              DSK0210 41700209
        DC    C'ATTEMPTS'                                       DSK0210 41700210
        DC    AL1(7)          07                                DSK0210 41700211
        DC    C'ATTEMPT'                                        DSK0210 41700212
        DC    AL1(3)          03                                DSK0210 41700213
        DC    C'ATT'                                            DSK0210 41700214
        DC    AL2(6656)       1A00                              DSK0210 41700215
        DC    AL2(1)          0001                              DSK0210 41700216
        DC    AL2(2059)       080B                              DSK0210 41700217
        DC    AL2(0)          0000                              DSK0210 41700218
        DC    AL2(1)          0001                              DSK0210 41700219
        DC    AL2(66)         0042                              DSK0210 41700220
        DC    AL2(0)          0000                              DSK0210 41700221
        DC    AL2(5376)       1500                              DSK0210 41700222
        DC    AL2(1)          0001                              DSK0210 41700223
        DC    AL2(14)         000E                              DSK0210 41700224
        DC    AL2(50)         0032                              DSK0210 41700225
        DC    AL2(525)        020D                              DSK0210 41700226
        DC    C'AUTHORIZATION'                                  DSK0210 41700227
        DC    AL1(4)          04                                DSK0210 41700228
        DC    C'AUTH'                                           DSK0210 41700229
        DC    AL2(2)          0002                              DSK0210 41700230
        DC    AL2(55104)      D740                              DSK0210 41700231
        DC    AL2(15)         000F                              DSK0210 41700232
        DC    AL2(55104)      D740                              DSK0210 41700233
        DC    AL2(16)         0010                              DSK0210 41700234
        DC    AL2(4096)       1000                              DSK0210 41700235
        DC    AL2(1)          0001                              DSK0210 41700236
        DC    AL2(3072)       0C00                              DSK0210 41700237
        DC    AL2(0)          0000                              DSK0210 41700238
        DC    AL2(0)          0000                              DSK0210 41700239
        DC    AL2(144)        0090                              DSK0210 41700240
        DC    AL2(0)          0000                              DSK0210 41700241
        DC    AL2(0)          0000                              DSK0210 41700242
        DC    AL2(0)          0000                              DSK0210 41700243
        DC    AL2(0)          0000                              DSK0210 41700244
        DC    AL2(2048)       0800                              DSK0210 41700245
        DC    AL2(64)         0040                              DSK0210 41700246
        DC    AL2(1)          0001                              DSK0210 41700247
        DC    AL2(15)         000F                              DSK0210 41700248
        DC    AL2(208)        00D0                              DSK0210 41700249
        DC    AL2(0)          0000                              DSK0210 41700250
        DC    AL2(4096)       1000                              DSK0210 41700251
        DC    AL2(1)          0001                              DSK0210 41700252
        DC    AL2(3072)       0C00                              DSK0210 41700253
        DC    AL2(0)          0000                              DSK0210 41700254
        DC    AL2(0)          0000                              DSK0210 41700255
        DC    AL2(144)        0090                              DSK0210 41700256
        DC    AL2(0)          0000                              DSK0210 41700257
        DC    AL2(0)          0000                              DSK0210 41700258
        DC    AL2(0)          0000                              DSK0210 41700259
        DC    AL2(0)          0000                              DSK0210 41700260
        DC    AL2(65280)      FF00                              DSK0210 41700261
        DC    AL2(64)         0040                              DSK0210 41700262
        DC    AL2(1)          0001                              DSK0210 41700263
        DC    AL2(16)         0010                              DSK0210 41700264
        DC    AL2(216)        00D8                              DSK0210 41700265
        DC    AL2(0)          0000                              DSK0210 41700266
        DC    AL2(10240)      2800                              DSK0210 41700267
        DC    AL2(1)          0001                              DSK0210 41700268
        DC    AL2(3087)       0C0F                              DSK0210 41700269
        DC    AL2(4352)       1100                              DSK0210 41700270
        DC    AL2(1)          0001                              DSK0210 41700271
        DC    AL2(208)        00D0                              DSK0210 41700272
        DC    AL2(1)          0001                              DSK0210 41700273
        DC    AL2(34463)      869F                              DSK0210 41700274
        DC    AL2(0)          0000                              DSK0210 41700275
        DC    AL2(0)          0000                              DSK0210 41700276
        DC    AL2(1280)       0500                              DSK0210 41700277
        DC    AL2(128)        0080                              DSK0210 41700278
        DC    AL2(1)          0001                              DSK0210 41700279
        DC    AL2(18)         0012                              DSK0210 41700280
        DC    AL2(224)        00E0                              DSK0210 41700281
        DC    AL2(258)        0102                              DSK0210 41700282
        DC    AL2(58326)      E3D6                              DSK0210 41700283
        DC    AL2(21)         0015                              DSK0210 41700284
        DC    AL2(21)         0015                              DSK0210 41700285
        DC    AL2(22)         0016                              DSK0210 41700286
        DC    AL2(23)         0017                              DSK0210 41700287
        DC    AL2(31)         001F                              DSK0210 41700288
        DC    AL2(34)         0022                              DSK0210 41700289
        DC    AL2(35)         0023                              DSK0210 41700290
        DC    AL2(37)         0025                              DSK0210 41700291
        DC    AL2(38)         0026                              DSK0210 41700292
        DC    AL2(40)         0028                              DSK0210 41700293
        DC    AL2(41)         0029                              DSK0210 41700294
        DC    AL2(55)         0037                              DSK0210 41700295
        DC    AL2(56)         0038                              DSK0210 41700296
        DC    AL2(59)         003B                              DSK0210 41700297
        DC    AL2(62)         003E                              DSK0210 41700298
        DC    AL2(63)         003F                              DSK0210 41700299
        DC    AL2(68)         0044                              DSK0210 41700300
        DC    AL2(69)         0045                              DSK0210 41700301
        DC    AL2(70)         0046                              DSK0210 41700302
        DC    AL2(71)         0047                              DSK0210 41700303
        DC    AL2(72)         0048                              DSK0210 41700304
        DC    AL2(73)         0049                              DSK0210 41700305
        DC    AL2(0)          0000                              DSK0210 41700306
        DC    AL2(10240)      2800                              DSK0210 41700307
        DC    AL2(1)          0001                              DSK0210 41700308
        DC    AL2(3087)       0C0F                              DSK0210 41700309
        DC    AL2(4608)       1200                              DSK0210 41700310
        DC    AL2(2)          0002                              DSK0210 41700311
        DC    AL2(208)        00D0                              DSK0210 41700312
        DC    AL2(0)          0000                              DSK0210 41700313
        DC    AL2(9999)       270F                              DSK0210 41700314
        DC    AL2(0)          0000                              DSK0210 41700315
        DC    AL2(0)          0000                              DSK0210 41700316
        DC    AL2(1024)       0400                              DSK0210 41700317
        DC    AL2(128)        0080                              DSK0210 41700318
        DC    AL2(1)          0001                              DSK0210 41700319
        DC    AL2(19)         0013                              DSK0210 41700320
        DC    AL2(232)        00E8                              DSK0210 41700321
        DC    AL2(259)        0103                              DSK0210 41700322
        DC    C'FOR'                                            DSK0210 41700323
        DC    AL2(0)          0000                              DSK0210 41700324
        DC    AL2(5376)       1500                              DSK0210 41700325
        DC    AL2(5376)       1500                              DSK0210 41700326
        DC    AL2(5632)       1600                              DSK0210 41700327
        DC    AL2(5888)       1700                              DSK0210 41700328
        DC    AL2(7936)       1F00                              DSK0210 41700329
        DC    AL2(8704)       2200                              DSK0210 41700330
        DC    AL2(8960)       2300                              DSK0210 41700331
        DC    AL2(9472)       2500                              DSK0210 41700332
        DC    AL2(9728)       2600                              DSK0210 41700333
        DC    AL2(10240)      2800                              DSK0210 41700334
        DC    AL2(10496)      2900                              DSK0210 41700335
        DC    AL2(14080)      3700                              DSK0210 41700336
        DC    AL2(14336)      3800                              DSK0210 41700337
        DC    AL2(15104)      3B00                              DSK0210 41700338
        DC    AL2(15872)      3E00                              DSK0210 41700339
        DC    AL2(16128)      3F00                              DSK0210 41700340
        DC    AL2(17408)      4400                              DSK0210 41700341
        DC    AL2(17664)      4500                              DSK0210 41700342
        DC    AL2(17920)      4600                              DSK0210 41700343
        DC    AL2(18176)      4700                              DSK0210 41700344
        DC    AL2(18432)      4800                              DSK0210 41700345
        DC    AL2(18708)      4914                              DSK0210 41700346
        DC    AL2(0)          0000                              DSK0210 41700347
        DC    AL2(268)        010C                              DSK0210 41700348
        DC    AL2(3840)       0F00                              DSK0210 41700349
        DC    AL2(0)          0000                              DSK0210 41700350
        DC    AL2(256)        0100                              DSK0210 41700351
        DC    AL2(53248)      D000                              DSK0210 41700352
        DC    AL2(0)          0000                              DSK0210 41700353
        DC    AL2(0)          0000                              DSK0210 41700354
        DC    AL2(0)          0000                              DSK0210 41700355
        DC    AL2(8)          0008                              DSK0210 41700356
        DC    AL2(0)          0000                              DSK0210 41700357
        DC    AL2(16384)      4000                              DSK0210 41700358
        DC    AL2(256)        0100                              DSK0210 41700359
        DC    AL2(5120)       1400                              DSK0210 41700360
        DC    AL2(61441)      F001                              DSK0210 41700361
        DC    AL1(5)          05                                DSK0210 41700362
        DC    C'OWNER'                                          DSK0210 41700363
        DC    AL2(0)          0000                              DSK0210 41700364
        DC    AL2(24)         0018                              DSK0210 41700365
        DC    AL2(0)          0000                              DSK0210 41700366
        DC    AL2(262)        0106                              DSK0210 41700367
        DC    AL2(2319)       090F                              DSK0210 41700368
        DC    AL2(0)          0000                              DSK0210 41700369
        DC    AL2(256)        0100                              DSK0210 41700370
        DC    AL2(16384)      4000                              DSK0210 41700371
        DC    AL2(256)        0100                              DSK0210 41700372
        DC    AL2(5376)       1500                              DSK0210 41700373
        DC    AL2(14338)      3802                              DSK0210 41700374
        DC    AL1(5)          05                                DSK0210 41700375
        DC    C'ERASE'                                          DSK0210 41700376
        DC    AL1(4)          04                                DSK0210 41700377
        DC    C'ERAS'                                           DSK0210 41700378
        DC    AL2(7)          0007                              DSK0210 41700379
        DC    AL2(18)         0012                              DSK0210 41700380
        DC    AL2(19)         0013                              DSK0210 41700381
        DC    AL2(44)         002C                              DSK0210 41700382
        DC    AL2(64)         0040                              DSK0210 41700383
        DC    AL2(65)         0041                              DSK0210 41700384
        DC    AL2(66)         0042                              DSK0210 41700385
        DC    AL2(67)         0043                              DSK0210 41700386
        DC    AL2(0)          0000                              DSK0210 41700387
        DC    AL2(6656)       1A00                              DSK0210 41700388
        DC    AL2(1)          0001                              DSK0210 41700389
        DC    AL2(1545)       0609                              DSK0210 41700390
        DC    AL2(4352)       1100                              DSK0210 41700391
        DC    AL2(2)          0002                              DSK0210 41700392
        DC    AL2(64)         0040                              DSK0210 41700393
        DC    AL2(1)          0001                              DSK0210 41700394
        DC    AL2(22)         0016                              DSK0210 41700395
        DC    AL2(56)         0038                              DSK0210 41700396
        DC    AL2(519)        0207                              DSK0210 41700397
        DC    C'NOERASE'                                        DSK0210 41700398
        DC    AL1(5)          05                                DSK0210 41700399
        DC    C'NERAS'                                          DSK0210 41700400
        DC    AL2(0)          0000                              DSK0210 41700401
        DC    AL2(1792)       0700                              DSK0210 41700402
        DC    AL2(4608)       1200                              DSK0210 41700403
        DC    AL2(4864)       1300                              DSK0210 41700404
        DC    AL2(11264)      2C00                              DSK0210 41700405
        DC    AL2(16384)      4000                              DSK0210 41700406
        DC    AL2(16640)      4100                              DSK0210 41700407
        DC    AL2(16896)      4200                              DSK0210 41700408
        DC    AL2(17152)      4300                              DSK0210 41700409
        DC    AL2(40)         0028                              DSK0210 41700410
        DC    AL2(0)          0000                              DSK0210 41700411
        DC    AL2(264)        0108                              DSK0210 41700412
        DC    AL2(2842)       0B1A                              DSK0210 41700413
        DC    AL2(0)          0000                              DSK0210 41700414
        DC    AL2(256)        0100                              DSK0210 41700415
        DC    AL2(16896)      4200                              DSK0210 41700416
        DC    AL2(34)         0022                              DSK0210 41700417
        DC    AL2(0)          0000                              DSK0210 41700418
        DC    AL2(256)        0100                              DSK0210 41700419
        DC    AL2(5888)       1700                              DSK0210 41700420
        DC    AL2(14851)      3A03                              DSK0210 41700421
        DC    AL1(12)         0C                                DSK0210 41700422
        DC    C'SHAREOPTIONS'                                   DSK0210 41700423
        DC    AL1(11)         0B                                DSK0210 41700424
        DC    C'SHAREOPTION'                                    DSK0210 41700425
        DC    AL1(3)          03                                DSK0210 41700426
        DC    C'SHR'                                            DSK0210 41700427
        DC    AL2(7)          0007                              DSK0210 41700428
        DC    AL2(18)         0012                              DSK0210 41700429
        DC    AL2(19)         0013                              DSK0210 41700430
        DC    AL2(44)         002C                              DSK0210 41700431
        DC    AL2(64)         0040                              DSK0210 41700432
        DC    AL2(65)         0041                              DSK0210 41700433
        DC    AL2(66)         0042                              DSK0210 41700434
        DC    AL2(67)         0043                              DSK0210 41700435
        DC    AL2(2)          0002                              DSK0210 41700436
        DC    AL2(55104)      D740                              DSK0210 41700437
        DC    AL2(48)         0030                              DSK0210 41700438
        DC    AL2(55104)      D740                              DSK0210 41700439
        DC    AL2(49)         0031                              DSK0210 41700440
        DC    AL2(0)          0000                              DSK0210 41700441
        DC    AL2(4096)       1000                              DSK0210 41700442
        DC    AL2(1)          0001                              DSK0210 41700443
        DC    AL2(3072)       0C00                              DSK0210 41700444
        DC    AL2(0)          0000                              DSK0210 41700445
        DC    AL2(0)          0000                              DSK0210 41700446
        DC    AL2(144)        0090                              DSK0210 41700447
        DC    AL2(0)          0000                              DSK0210 41700448
        DC    AL2(4)          0004                              DSK0210 41700449
        DC    AL2(0)          0000                              DSK0210 41700450
        DC    AL2(1)          0001                              DSK0210 41700451
        DC    AL2(1024)       0400                              DSK0210 41700452
        DC    AL2(128)        0080                              DSK0210 41700453
        DC    AL2(1)          0001                              DSK0210 41700454
        DC    AL2(48)         0030                              DSK0210 41700455
        DC    AL2(248)        00F8                              DSK0210 41700456
        DC    AL2(0)          0000                              DSK0210 41700457
        DC    AL2(4096)       1000                              DSK0210 41700458
        DC    AL2(1)          0001                              DSK0210 41700459
        DC    AL2(3072)       0C00                              DSK0210 41700460
        DC    AL2(0)          0000                              DSK0210 41700461
        DC    AL2(0)          0000                              DSK0210 41700462
        DC    AL2(144)        0090                              DSK0210 41700463
        DC    AL2(0)          0000                              DSK0210 41700464
        DC    AL2(4)          0004                              DSK0210 41700465
        DC    AL2(0)          0000                              DSK0210 41700466
        DC    AL2(3)          0003                              DSK0210 41700467
        DC    AL2(1024)       0400                              DSK0210 41700468
        DC    AL2(128)        0080                              DSK0210 41700469
        DC    AL2(1)          0001                              DSK0210 41700470
        DC    AL2(49)         0031                              DSK0210 41700471
        DC    AL2(256)        0100                              DSK0210 41700472
        DC    AL2(0)          0000                              DSK0210 41700473
        DC    AL2(9728)       2600                              DSK0210 41700474
        DC    AL2(1)          0001                              DSK0210 41700475
        DC    AL2(2059)       080B                              DSK0210 41700476
        DC    AL2(0)          0000                              DSK0210 41700477
        DC    AL2(1)          0001                              DSK0210 41700478
        DC    AL2(66)         0042                              DSK0210 41700479
        DC    AL2(0)          0000                              DSK0210 41700480
        DC    AL2(4608)       1200                              DSK0210 41700481
        DC    AL2(1)          0001                              DSK0210 41700482
        DC    AL2(25)         0019                              DSK0210 41700483
        DC    AL2(60)         003C                              DSK0210 41700484
        DC    AL2(519)        0207                              DSK0210 41700485
        DC    C'NULLIFY'                                        DSK0210 41700486
        DC    AL1(4)          04                                DSK0210 41700487
        DC    C'NULL'                                           DSK0210 41700488
        DC    AL2(9)          0009                              DSK0210 41700489
        DC    AL2(53824)      D240                              DSK0210 41700490
        DC    AL2(26)         001A                              DSK0210 41700491
        DC    AL2(53824)      D240                              DSK0210 41700492
        DC    AL2(27)         001B                              DSK0210 41700493
        DC    AL2(53824)      D240                              DSK0210 41700494
        DC    AL2(28)         001C                              DSK0210 41700495
        DC    AL2(53824)      D240                              DSK0210 41700496
        DC    AL2(29)         001D                              DSK0210 41700497
        DC    AL2(53824)      D240                              DSK0210 41700498
        DC    AL2(42)         002A                              DSK0210 41700499
        DC    AL2(53824)      D240                              DSK0210 41700500
        DC    AL2(43)         002B                              DSK0210 41700501
        DC    AL2(53824)      D240                              DSK0210 41700502
        DC    AL2(44)         002C                              DSK0210 41700503
        DC    AL2(53824)      D240                              DSK0210 41700504
        DC    AL2(45)         002D                              DSK0210 41700505
        DC    AL2(53824)      D240                              DSK0210 41700506
        DC    AL2(68)         0044                              DSK0210 41700507
        DC    AL2(0)          0000                              DSK0210 41700508
        DC    AL2(4608)       1200                              DSK0210 41700509
        DC    AL2(1)          0001                              DSK0210 41700510
        DC    AL2(1545)       0609                              DSK0210 41700511
        DC    AL2(0)          0000                              DSK0210 41700512
        DC    AL2(1)          0001                              DSK0210 41700513
        DC    AL2(0)          0000                              DSK0210 41700514
        DC    AL2(1)          0001                              DSK0210 41700515
        DC    AL2(26)         001A                              DSK0210 41700516
        DC    AL2(264)        0108                              DSK0210 41700517
        DC    AL2(520)        0208                              DSK0210 41700518
        DC    C'MASTERPW'                                       DSK0210 41700519
        DC    AL1(4)          04                                DSK0210 41700520
        DC    C'MRPW'                                           DSK0210 41700521
        DC    AL2(0)          0000                              DSK0210 41700522
        DC    AL2(18)         0012                              DSK0210 41700523
        DC    AL2(0)          0000                              DSK0210 41700524
        DC    AL2(262)        0106                              DSK0210 41700525
        DC    AL2(2304)       0900                              DSK0210 41700526
        DC    AL2(0)          0000                              DSK0210 41700527
        DC    AL2(256)        0100                              DSK0210 41700528
        DC    AL2(0)          0000                              DSK0210 41700529
        DC    AL2(256)        0100                              DSK0210 41700530
        DC    AL2(6913)       1B01                              DSK0210 41700531
        DC    AL2(2562)       0A02                              DSK0210 41700532
        DC    AL1(9)          09                                DSK0210 41700533
        DC    C'CONTROLPW'                                      DSK0210 41700534
        DC    AL1(5)          05                                DSK0210 41700535
        DC    C'CTLPW'                                          DSK0210 41700536
        DC    AL2(18)         0012                              DSK0210 41700537
        DC    AL2(0)          0000                              DSK0210 41700538
        DC    AL2(262)        0106                              DSK0210 41700539
        DC    AL2(2304)       0900                              DSK0210 41700540
        DC    AL2(0)          0000                              DSK0210 41700541
        DC    AL2(256)        0100                              DSK0210 41700542
        DC    AL2(0)          0000                              DSK0210 41700543
        DC    AL2(256)        0100                              DSK0210 41700544
        DC    AL2(7169)       1C01                              DSK0210 41700545
        DC    AL2(3074)       0C02                              DSK0210 41700546
        DC    AL1(8)          08                                DSK0210 41700547
        DC    C'UPDATEPW'                                       DSK0210 41700548
        DC    AL1(5)          05                                DSK0210 41700549
        DC    C'UPDPW'                                          DSK0210 41700550
        DC    AL2(0)          0000                              DSK0210 41700551
        DC    AL2(4096)       1000                              DSK0210 41700552
        DC    AL2(1)          0001                              DSK0210 41700553
        DC    AL2(1545)       0609                              DSK0210 41700554
        DC    AL2(0)          0000                              DSK0210 41700555
        DC    AL2(1)          0001                              DSK0210 41700556
        DC    AL2(0)          0000                              DSK0210 41700557
        DC    AL2(1)          0001                              DSK0210 41700558
        DC    AL2(29)         001D                              DSK0210 41700559
        DC    AL2(270)        010E                              DSK0210 41700560
        DC    AL2(518)        0206                              DSK0210 41700561
        DC    C'READPW'                                         DSK0210 41700562
        DC    AL1(4)          04                                DSK0210 41700563
        DC    C'RDPW'                                           DSK0210 41700564
        DC    AL2(14)         000E                              DSK0210 41700565
        DC    AL2(0)          0000                              DSK0210 41700566
        DC    AL2(262)        0106                              DSK0210 41700567
        DC    AL2(2304)       0900                              DSK0210 41700568
        DC    AL2(0)          0000                              DSK0210 41700569
        DC    AL2(256)        0100                              DSK0210 41700570
        DC    AL2(0)          0000                              DSK0210 41700571
        DC    AL2(256)        0100                              DSK0210 41700572
        DC    AL2(10753)      2A01                              DSK0210 41700573
        DC    AL2(4097)       1001                              DSK0210 41700574
        DC    AL1(5)          05                                DSK0210 41700575
        DC    C'OWNER'                                          DSK0210 41700576
        DC    AL2(0)          0000                              DSK0210 41700577
        DC    AL2(12)         000C                              DSK0210 41700578
        DC    AL2(0)          0000                              DSK0210 41700579
        DC    AL2(262)        0106                              DSK0210 41700580
        DC    AL2(2304)       0900                              DSK0210 41700581
        DC    AL2(0)          0000                              DSK0210 41700582
        DC    AL2(256)        0100                              DSK0210 41700583
        DC    AL2(0)          0000                              DSK0210 41700584
        DC    AL2(256)        0100                              DSK0210 41700585
        DC    AL2(11009)      2B01                              DSK0210 41700586
        DC    AL2(4609)       1201                              DSK0210 41700587
        DC    AL1(4)          04                                DSK0210 41700588
        DC    C'CODE'                                           DSK0210 41700589
        DC    AL2(10240)      2800                              DSK0210 41700590
        DC    AL2(1)          0001                              DSK0210 41700591
        DC    AL2(1545)       0609                              DSK0210 41700592
        DC    AL2(4352)       1100                              DSK0210 41700593
        DC    AL2(1)          0001                              DSK0210 41700594
        DC    AL2(0)          0000                              DSK0210 41700595
        DC    AL2(1)          0001                              DSK0210 41700596
        DC    AL2(44)         002C                              DSK0210 41700597
        DC    AL2(276)        0114                              DSK0210 41700598
        DC    AL2(521)        0209                              DSK0210 41700599
        DC    C'RETENTION'                                      DSK0210 41700600
        DC    AL1(4)          04                                DSK0210 41700601
        DC    C'RETN'                                           DSK0210 41700602
        DC    AL2(21)         0015                              DSK0210 41700603
        DC    AL2(21)         0015                              DSK0210 41700604
        DC    AL2(22)         0016                              DSK0210 41700605
        DC    AL2(23)         0017                              DSK0210 41700606
        DC    AL2(31)         001F                              DSK0210 41700607
        DC    AL2(34)         0022                              DSK0210 41700608
        DC    AL2(35)         0023                              DSK0210 41700609
        DC    AL2(37)         0025                              DSK0210 41700610
        DC    AL2(38)         0026                              DSK0210 41700611
        DC    AL2(40)         0028                              DSK0210 41700612
        DC    AL2(41)         0029                              DSK0210 41700613
        DC    AL2(55)         0037                              DSK0210 41700614
        DC    AL2(56)         0038                              DSK0210 41700615
        DC    AL2(59)         003B                              DSK0210 41700616
        DC    AL2(62)         003E                              DSK0210 41700617
        DC    AL2(63)         003F                              DSK0210 41700618
        DC    AL2(68)         0044                              DSK0210 41700619
        DC    AL2(69)         0045                              DSK0210 41700620
        DC    AL2(70)         0046                              DSK0210 41700621
        DC    AL2(71)         0047                              DSK0210 41700622
        DC    AL2(72)         0048                              DSK0210 41700623
        DC    AL2(73)         0049                              DSK0210 41700624
        DC    AL2(0)          0000                              DSK0210 41700625
        DC    AL2(6656)       1A00                              DSK0210 41700626
        DC    AL2(1)          0001                              DSK0210 41700627
        DC    AL2(2059)       080B                              DSK0210 41700628
        DC    AL2(0)          0000                              DSK0210 41700629
        DC    AL2(1)          0001                              DSK0210 41700630
        DC    AL2(2)          0002                              DSK0210 41700631
        DC    AL2(0)          0000                              DSK0210 41700632
        DC    AL2(5376)       1500                              DSK0210 41700633
        DC    AL2(1)          0001                              DSK0210 41700634
        DC    AL2(45)         002D                              DSK0210 41700635
        DC    AL2(278)        0116                              DSK0210 41700636
        DC    AL2(525)        020D                              DSK0210 41700637
        DC    C'AUTHORIZATION'                                  DSK0210 41700638
        DC    AL1(4)          04                                DSK0210 41700639
        DC    C'AUTH'                                           DSK0210 41700640
        DC    AL2(2)          0002                              DSK0210 41700641
        DC    AL2(53824)      D240                              DSK0210 41700642
        DC    AL2(46)         002E                              DSK0210 41700643
        DC    AL2(53824)      D240                              DSK0210 41700644
        DC    AL2(47)         002F                              DSK0210 41700645
        DC    AL2(4096)       1000                              DSK0210 41700646
        DC    AL2(1)          0001                              DSK0210 41700647
        DC    AL2(1545)       0609                              DSK0210 41700648
        DC    AL2(0)          0000                              DSK0210 41700649
        DC    AL2(1)          0001                              DSK0210 41700650
        DC    AL2(0)          0000                              DSK0210 41700651
        DC    AL2(1)          0001                              DSK0210 41700652
        DC    AL2(46)         002E                              DSK0210 41700653
        DC    AL2(372)        0174                              DSK0210 41700654
        DC    AL2(518)        0206                              DSK0210 41700655
        DC    C'MODULE'                                         DSK0210 41700656
        DC    AL1(4)          04                                DSK0210 41700657
        DC    C'MDLE'                                           DSK0210 41700658
        DC    AL2(16)         0010                              DSK0210 41700659
        DC    AL2(0)          0000                              DSK0210 41700660
        DC    AL2(262)        0106                              DSK0210 41700661
        DC    AL2(2304)       0900                              DSK0210 41700662
        DC    AL2(0)          0000                              DSK0210 41700663
        DC    AL2(512)        0200                              DSK0210 41700664
        DC    AL2(0)          0000                              DSK0210 41700665
        DC    AL2(256)        0100                              DSK0210 41700666
        DC    AL2(12033)      2F01                              DSK0210 41700667
        DC    AL2(29698)      7402                              DSK0210 41700668
        DC    AL1(6)          06                                DSK0210 41700669
        DC    C'STRING'                                         DSK0210 41700670
        DC    AL1(4)          04                                DSK0210 41700671
        DC    C'STRG'                                           DSK0210 41700672
        DC    AL2(28)         001C                              DSK0210 41700673
        DC    AL2(0)          0000                              DSK0210 41700674
        DC    AL2(262)        0106                              DSK0210 41700675
        DC    AL2(2323)       0913                              DSK0210 41700676
        DC    AL2(0)          0000                              DSK0210 41700677
        DC    AL2(256)        0100                              DSK0210 41700678
        DC    AL2(0)          0000                              DSK0210 41700679
        DC    AL2(256)        0100                              DSK0210 41700680
        DC    AL2(17409)      4401                              DSK0210 41700681
        DC    AL2(6146)       1802                              DSK0210 41700682
        DC    AL1(13)         0D                                DSK0210 41700683
        DC    C'EXCEPTIONEXIT'                                  DSK0210 41700684
        DC    AL1(4)          04                                DSK0210 41700685
        DC    C'EEXT'                                           DSK0210 41700686
        DC    AL2(7)          0007                              DSK0210 41700687
        DC    AL2(18)         0012                              DSK0210 41700688
        DC    AL2(19)         0013                              DSK0210 41700689
        DC    AL2(44)         002C                              DSK0210 41700690
        DC    AL2(64)         0040                              DSK0210 41700691
        DC    AL2(65)         0041                              DSK0210 41700692
        DC    AL2(66)         0042                              DSK0210 41700693
        DC    AL2(67)         0043                              DSK0210 41700694
        DC    AL2(0)          0000                              DSK0210 41700695
        DC    AL2(8192)       2000                              DSK0210 41700696
        DC    AL2(1)          0001                              DSK0210 41700697
        DC    AL2(2059)       080B                              DSK0210 41700698
        DC    AL2(4864)       1300                              DSK0210 41700699
        DC    AL2(1)          0001                              DSK0210 41700700
        DC    AL2(66)         0042                              DSK0210 41700701
        DC    AL2(0)          0000                              DSK0210 41700702
        DC    AL2(6912)       1B00                              DSK0210 41700703
        DC    AL2(1)          0001                              DSK0210 41700704
        DC    AL2(31)         001F                              DSK0210 41700705
        DC    AL2(62)         003E                              DSK0210 41700706
        DC    AL2(521)        0209                              DSK0210 41700707
        DC    C'FREESPACE'                                      DSK0210 41700708
        DC    AL1(4)          04                                DSK0210 41700709
        DC    C'FSPC'                                           DSK0210 41700710
        DC    AL2(7)          0007                              DSK0210 41700711
        DC    AL2(18)         0012                              DSK0210 41700712
        DC    AL2(19)         0013                              DSK0210 41700713
        DC    AL2(44)         002C                              DSK0210 41700714
        DC    AL2(64)         0040                              DSK0210 41700715
        DC    AL2(65)         0041                              DSK0210 41700716
        DC    AL2(66)         0042                              DSK0210 41700717
        DC    AL2(67)         0043                              DSK0210 41700718
        DC    AL2(2)          0002                              DSK0210 41700719
        DC    AL2(55104)      D740                              DSK0210 41700720
        DC    AL2(32)         0020                              DSK0210 41700721
        DC    AL2(55104)      D740                              DSK0210 41700722
        DC    AL2(33)         0021                              DSK0210 41700723
        DC    AL2(4096)       1000                              DSK0210 41700724
        DC    AL2(1)          0001                              DSK0210 41700725
        DC    AL2(3072)       0C00                              DSK0210 41700726
        DC    AL2(0)          0000                              DSK0210 41700727
        DC    AL2(0)          0000                              DSK0210 41700728
        DC    AL2(144)        0090                              DSK0210 41700729
        DC    AL2(0)          0000                              DSK0210 41700730
        DC    AL2(100)        0064                              DSK0210 41700731
        DC    AL2(0)          0000                              DSK0210 41700732
        DC    AL2(0)          0000                              DSK0210 41700733
        DC    AL2(1024)       0400                              DSK0210 41700734
        DC    AL2(128)        0080                              DSK0210 41700735
        DC    AL2(1)          0001                              DSK0210 41700736
        DC    AL2(32)         0020                              DSK0210 41700737
        DC    AL2(284)        011C                              DSK0210 41700738
        DC    AL2(0)          0000                              DSK0210 41700739
        DC    AL2(4096)       1000                              DSK0210 41700740
        DC    AL2(1)          0001                              DSK0210 41700741
        DC    AL2(3072)       0C00                              DSK0210 41700742
        DC    AL2(0)          0000                              DSK0210 41700743
        DC    AL2(0)          0000                              DSK0210 41700744
        DC    AL2(144)        0090                              DSK0210 41700745
        DC    AL2(0)          0000                              DSK0210 41700746
        DC    AL2(100)        0064                              DSK0210 41700747
        DC    AL2(0)          0000                              DSK0210 41700748
        DC    AL2(0)          0000                              DSK0210 41700749
        DC    AL2(1024)       0400                              DSK0210 41700750
        DC    AL2(128)        0080                              DSK0210 41700751
        DC    AL2(1)          0001                              DSK0210 41700752
        DC    AL2(33)         0021                              DSK0210 41700753
        DC    AL2(292)        0124                              DSK0210 41700754
        DC    AL2(0)          0000                              DSK0210 41700755
        DC    AL2(6656)       1A00                              DSK0210 41700756
        DC    AL2(1)          0001                              DSK0210 41700757
        DC    AL2(1545)       0609                              DSK0210 41700758
        DC    AL2(4352)       1100                              DSK0210 41700759
        DC    AL2(1)          0001                              DSK0210 41700760
        DC    AL2(64)         0040                              DSK0210 41700761
        DC    AL2(1)          0001                              DSK0210 41700762
        DC    AL2(34)         0022                              DSK0210 41700763
        DC    AL2(64)         0040                              DSK0210 41700764
        DC    AL2(522)        020A                              DSK0210 41700765
        DC    C'WRITECHECK'                                     DSK0210 41700766
        DC    AL1(3)          03                                DSK0210 41700767
        DC    C'WCK'                                            DSK0210 41700768
        DC    AL2(7)          0007                              DSK0210 41700769
        DC    AL2(18)         0012                              DSK0210 41700770
        DC    AL2(19)         0013                              DSK0210 41700771
        DC    AL2(44)         002C                              DSK0210 41700772
        DC    AL2(64)         0040                              DSK0210 41700773
        DC    AL2(65)         0041                              DSK0210 41700774
        DC    AL2(66)         0042                              DSK0210 41700775
        DC    AL2(67)         0043                              DSK0210 41700776
        DC    AL2(0)          0000                              DSK0210 41700777
        DC    AL2(7168)       1C00                              DSK0210 41700778
        DC    AL2(1)          0001                              DSK0210 41700779
        DC    AL2(1545)       0609                              DSK0210 41700780
        DC    AL2(4864)       1300                              DSK0210 41700781
        DC    AL2(2)          0002                              DSK0210 41700782
        DC    AL2(64)         0040                              DSK0210 41700783
        DC    AL2(1)          0001                              DSK0210 41700784
        DC    AL2(35)         0023                              DSK0210 41700785
        DC    AL2(64)         0040                              DSK0210 41700786
        DC    AL2(524)        020C                              DSK0210 41700787
        DC    C'NOWRITECHECK'                                   DSK0210 41700788
        DC    AL1(4)          04                                DSK0210 41700789
        DC    C'NWCK'                                           DSK0210 41700790
        DC    AL2(0)          0000                              DSK0210 41700791
        DC    AL2(1792)       0700                              DSK0210 41700792
        DC    AL2(4608)       1200                              DSK0210 41700793
        DC    AL2(4864)       1300                              DSK0210 41700794
        DC    AL2(11264)      2C00                              DSK0210 41700795
        DC    AL2(16384)      4000                              DSK0210 41700796
        DC    AL2(16640)      4100                              DSK0210 41700797
        DC    AL2(16896)      4200                              DSK0210 41700798
        DC    AL2(17152)      4300                              DSK0210 41700799
        DC    AL2(34)         0022                              DSK0210 41700800
        DC    AL2(0)          0000                              DSK0210 41700801
        DC    AL2(268)        010C                              DSK0210 41700802
        DC    AL2(3868)       0F1C                              DSK0210 41700803
        DC    AL2(0)          0000                              DSK0210 41700804
        DC    AL2(256)        0100                              DSK0210 41700805
        DC    AL2(53375)      D07F                              DSK0210 41700806
        DC    AL2(65535)      FFFF                              DSK0210 41700807
        DC    AL2(65280)      FF00                              DSK0210 41700808
        DC    AL2(0)          0000                              DSK0210 41700809
        DC    AL2(4)          0004                              DSK0210 41700810
        DC    AL2(0)          0000                              DSK0210 41700811
        DC    AL2(32768)      8000                              DSK0210 41700812
        DC    AL2(256)        0100                              DSK0210 41700813
        DC    AL2(9217)       2401                              DSK0210 41700814
        DC    AL2(11267)      2C03                              DSK0210 41700815
        DC    AL1(11)         0B                                DSK0210 41700816
        DC    C'BUFFERSPACE'                                    DSK0210 41700817
        DC    AL1(6)          06                                DSK0210 41700818
        DC    C'BUFSPC'                                         DSK0210 41700819
        DC    AL1(5)          05                                DSK0210 41700820
        DC    C'BUFSP'                                          DSK0210 41700821
        DC    AL2(4)          0004                              DSK0210 41700822
        DC    AL2(64)         0040                              DSK0210 41700823
        DC    AL2(65)         0041                              DSK0210 41700824
        DC    AL2(66)         0042                              DSK0210 41700825
        DC    AL2(67)         0043                              DSK0210 41700826
        DC    AL2(0)          0000                              DSK0210 41700827
        DC    AL2(9728)       2600                              DSK0210 41700828
        DC    AL2(1)          0001                              DSK0210 41700829
        DC    AL2(3087)       0C0F                              DSK0210 41700830
        DC    AL2(7424)       1D00                              DSK0210 41700831
        DC    AL2(1)          0001                              DSK0210 41700832
        DC    AL2(200)        00C8                              DSK0210 41700833
        DC    AL2(0)          0000                              DSK0210 41700834
        DC    AL2(0)          0000                              DSK0210 41700835
        DC    AL2(0)          0000                              DSK0210 41700836
        DC    AL2(0)          0000                              DSK0210 41700837
        DC    AL2(1791)       06FF                              DSK0210 41700838
        DC    AL2(64)         0040                              DSK0210 41700839
        DC    AL2(1)          0001                              DSK0210 41700840
        DC    AL2(37)         0025                              DSK0210 41700841
        DC    AL2(308)        0134                              DSK0210 41700842
        DC    AL2(778)        030A                              DSK0210 41700843
        DC    C'ADDVOLUMES'                                     DSK0210 41700844
        DC    AL1(9)          09                                DSK0210 41700845
        DC    C'ADDVOLUME'                                      DSK0210 41700846
        DC    AL1(4)          04                                DSK0210 41700847
        DC    C'AVOL'                                           DSK0210 41700848
        DC    AL2(0)          0000                              DSK0210 41700849
        DC    AL2(1792)       0700                              DSK0210 41700850
        DC    AL2(4608)       1200                              DSK0210 41700851
        DC    AL2(4864)       1300                              DSK0210 41700852
        DC    AL2(11264)      2C00                              DSK0210 41700853
        DC    AL2(16384)      4000                              DSK0210 41700854
        DC    AL2(16640)      4100                              DSK0210 41700855
        DC    AL2(16896)      4200                              DSK0210 41700856
        DC    AL2(17152)      4300                              DSK0210 41700857
        DC    AL2(40)         0028                              DSK0210 41700858
        DC    AL2(0)          0000                              DSK0210 41700859
        DC    AL2(268)        010C                              DSK0210 41700860
        DC    AL2(3872)       0F20                              DSK0210 41700861
        DC    AL2(0)          0000                              DSK0210 41700862
        DC    AL2(256)        0100                              DSK0210 41700863
        DC    AL2(51200)      C800                              DSK0210 41700864
        DC    AL2(0)          0000                              DSK0210 41700865
        DC    AL2(0)          0000                              DSK0210 41700866
        DC    AL2(0)          0000                              DSK0210 41700867
        DC    AL2(6)          0006                              DSK0210 41700868
        DC    AL2(65280)      FF00                              DSK0210 41700869
        DC    AL2(16384)      4000                              DSK0210 41700870
        DC    AL2(256)        0100                              DSK0210 41700871
        DC    AL2(9729)       2601                              DSK0210 41700872
        DC    AL2(16387)      4003                              DSK0210 41700873
        DC    AL1(13)         0D                                DSK0210 41700874
        DC    C'REMOVEVOLUMES'                                  DSK0210 41700875
        DC    AL1(12)         0C                                DSK0210 41700876
        DC    C'REMOVEVOLUME'                                   DSK0210 41700877
        DC    AL1(4)          04                                DSK0210 41700878
        DC    C'RVOL'                                           DSK0210 41700879
        DC    AL2(0)          0000                              DSK0210 41700880
        DC    AL2(1792)       0700                              DSK0210 41700881
        DC    AL2(4608)       1200                              DSK0210 41700882
        DC    AL2(4864)       1300                              DSK0210 41700883
        DC    AL2(11264)      2C00                              DSK0210 41700884
        DC    AL2(16384)      4000                              DSK0210 41700885
        DC    AL2(16640)      4100                              DSK0210 41700886
        DC    AL2(16896)      4200                              DSK0210 41700887
        DC    AL2(17176)      4318                              DSK0210 41700888
        DC    AL2(0)          0000                              DSK0210 41700889
        DC    AL2(262)        0106                              DSK0210 41700890
        DC    AL2(2320)       0910                              DSK0210 41700891
        DC    AL2(0)          0000                              DSK0210 41700892
        DC    AL2(256)        0100                              DSK0210 41700893
        DC    AL2(16384)      4000                              DSK0210 41700894
        DC    AL2(256)        0100                              DSK0210 41700895
        DC    AL2(10240)      2800                              DSK0210 41700896
        DC    AL2(18434)      4802                              DSK0210 41700897
        DC    AL1(7)          07                                DSK0210 41700898
        DC    C'INHIBIT'                                        DSK0210 41700899
        DC    AL1(3)          03                                DSK0210 41700900
        DC    C'INH'                                            DSK0210 41700901
        DC    AL2(0)          0000                              DSK0210 41700902
        DC    AL2(1792)       0700                              DSK0210 41700903
        DC    AL2(4608)       1200                              DSK0210 41700904
        DC    AL2(4864)       1300                              DSK0210 41700905
        DC    AL2(11264)      2C00                              DSK0210 41700906
        DC    AL2(16384)      4000                              DSK0210 41700907
        DC    AL2(16640)      4100                              DSK0210 41700908
        DC    AL2(16896)      4200                              DSK0210 41700909
        DC    AL2(17178)      431A                              DSK0210 41700910
        DC    AL2(0)          0000                              DSK0210 41700911
        DC    AL2(262)        0106                              DSK0210 41700912
        DC    AL2(2322)       0912                              DSK0210 41700913
        DC    AL2(0)          0000                              DSK0210 41700914
        DC    AL2(512)        0200                              DSK0210 41700915
        DC    AL2(16384)      4000                              DSK0210 41700916
        DC    AL2(256)        0100                              DSK0210 41700917
        DC    AL2(10496)      2900                              DSK0210 41700918
        DC    AL2(18434)      4802                              DSK0210 41700919
        DC    AL1(9)          09                                DSK0210 41700920
        DC    C'UNINHIBIT'                                      DSK0210 41700921
        DC    AL1(5)          05                                DSK0210 41700922
        DC    C'UNINH'                                          DSK0210 41700923
        DC    AL2(0)          0000                              DSK0210 41700924
        DC    AL2(1792)       0700                              DSK0210 41700925
        DC    AL2(4608)       1200                              DSK0210 41700926
        DC    AL2(4864)       1300                              DSK0210 41700927
        DC    AL2(11264)      2C00                              DSK0210 41700928
        DC    AL2(16384)      4000                              DSK0210 41700929
        DC    AL2(16640)      4100                              DSK0210 41700930
        DC    AL2(16896)      4200                              DSK0210 41700931
        DC    AL2(17168)      4310                              DSK0210 41700932
        DC    AL2(0)          0000                              DSK0210 41700933
        DC    AL2(262)        0106                              DSK0210 41700934
        DC    AL2(2304)       0900                              DSK0210 41700935
        DC    AL2(0)          0000                              DSK0210 41700936
        DC    AL2(256)        0100                              DSK0210 41700937
        DC    AL2(16384)      4000                              DSK0210 41700938
        DC    AL2(256)        0100                              DSK0210 41700939
        DC    AL2(12800)      3200                              DSK0210 41700940
        DC    AL2(18946)      4A02                              DSK0210 41700941
        DC    AL1(5)          05                                DSK0210 41700942
        DC    C'EMPTY'                                          DSK0210 41700943
        DC    AL1(3)          03                                DSK0210 41700944
        DC    C'EMP'                                            DSK0210 41700945
        DC    AL2(0)          0000                              DSK0210 41700946
        DC    AL2(16)         0010                              DSK0210 41700947
        DC    AL2(0)          0000                              DSK0210 41700948
        DC    AL2(262)        0106                              DSK0210 41700949
        DC    AL2(2304)       0900                              DSK0210 41700950
        DC    AL2(0)          0000                              DSK0210 41700951
        DC    AL2(512)        0200                              DSK0210 41700952
        DC    AL2(16384)      4000                              DSK0210 41700953
        DC    AL2(256)        0100                              DSK0210 41700954
        DC    AL2(13056)      3300                              DSK0210 41700955
        DC    AL2(18946)      4A02                              DSK0210 41700956
        DC    AL1(7)          07                                DSK0210 41700957
        DC    C'NOEMPTY'                                        DSK0210 41700958
        DC    AL1(4)          04                                DSK0210 41700959
        DC    C'NEMP'                                           DSK0210 41700960
        DC    AL2(4096)       1000                              DSK0210 41700961
        DC    AL2(1)          0001                              DSK0210 41700962
        DC    AL2(1545)       0609                              DSK0210 41700963
        DC    AL2(0)          0000                              DSK0210 41700964
        DC    AL2(1)          0001                              DSK0210 41700965
        DC    AL2(64)         0040                              DSK0210 41700966
        DC    AL2(1)          0001                              DSK0210 41700967
        DC    AL2(52)         0034                              DSK0210 41700968
        DC    AL2(76)         004C                              DSK0210 41700969
        DC    AL2(519)        0207                              DSK0210 41700970
        DC    C'SCRATCH'                                        DSK0210 41700971
        DC    AL1(3)          03                                DSK0210 41700972
        DC    C'SCR'                                            DSK0210 41700973
        DC    AL2(18)         0012                              DSK0210 41700974
        DC    AL2(0)          0000                              DSK0210 41700975
        DC    AL2(262)        0106                              DSK0210 41700976
        DC    AL2(2304)       0900                              DSK0210 41700977
        DC    AL2(0)          0000                              DSK0210 41700978
        DC    AL2(512)        0200                              DSK0210 41700979
        DC    AL2(16384)      4000                              DSK0210 41700980
        DC    AL2(256)        0100                              DSK0210 41700981
        DC    AL2(13568)      3500                              DSK0210 41700982
        DC    AL2(19458)      4C02                              DSK0210 41700983
        DC    AL1(9)          09                                DSK0210 41700984
        DC    C'NOSCRATCH'                                      DSK0210 41700985
        DC    AL1(4)          04                                DSK0210 41700986
        DC    C'NSCR'                                           DSK0210 41700987
        DC    AL2(0)          0000                              DSK0210 41700988
        DC    AL2(8704)       2200                              DSK0210 41700989
        DC    AL2(1)          0001                              DSK0210 41700990
        DC    AL2(3087)       0C0F                              DSK0210 41700991
        DC    AL2(6400)       1900                              DSK0210 41700992
        DC    AL2(1)          0001                              DSK0210 41700993
        DC    AL2(208)        00D0                              DSK0210 41700994
        DC    AL2(0)          0000                              DSK0210 41700995
        DC    AL2(0)          0000                              DSK0210 41700996
        DC    AL2(0)          0000                              DSK0210 41700997
        DC    AL2(0)          0000                              DSK0210 41700998
        DC    AL2(2048)       0800                              DSK0210 41700999
        DC    AL2(64)         0040                              DSK0210 41701000
        DC    AL2(1)          0001                              DSK0210 41701001
        DC    AL2(55)         0037                              DSK0210 41701002
        DC    AL2(332)        014C                              DSK0210 41701003
        DC    AL2(525)        020D                              DSK0210 41701004
        DC    C'EXCEPTIONEXIT'                                  DSK0210 41701005
        DC    AL1(4)          04                                DSK0210 41701006
        DC    C'EEXT'                                           DSK0210 41701007
        DC    AL2(7)          0007                              DSK0210 41701008
        DC    AL2(18)         0012                              DSK0210 41701009
        DC    AL2(19)         0013                              DSK0210 41701010
        DC    AL2(44)         002C                              DSK0210 41701011
        DC    AL2(64)         0040                              DSK0210 41701012
        DC    AL2(65)         0041                              DSK0210 41701013
        DC    AL2(66)         0042                              DSK0210 41701014
        DC    AL2(67)         0043                              DSK0210 41701015
        DC    AL2(0)          0000                              DSK0210 41701016
        DC    AL2(7680)       1E00                              DSK0210 41701017
        DC    AL2(1)          0001                              DSK0210 41701018
        DC    AL2(2059)       080B                              DSK0210 41701019
        DC    AL2(4096)       1000                              DSK0210 41701020
        DC    AL2(1)          0001                              DSK0210 41701021
        DC    AL2(66)         0042                              DSK0210 41701022
        DC    AL2(0)          0000                              DSK0210 41701023
        DC    AL2(6144)       1800                              DSK0210 41701024
        DC    AL2(1)          0001                              DSK0210 41701025
        DC    AL2(56)         0038                              DSK0210 41701026
        DC    AL2(80)         0050                              DSK0210 41701027
        DC    AL2(516)        0204                              DSK0210 41701028
        DC    C'KEYS'                                           DSK0210 41701029
        DC    AL1(3)          03                                DSK0210 41701030
        DC    C'KEY'                                            DSK0210 41701031
        DC    AL2(7)          0007                              DSK0210 41701032
        DC    AL2(18)         0012                              DSK0210 41701033
        DC    AL2(19)         0013                              DSK0210 41701034
        DC    AL2(44)         002C                              DSK0210 41701035
        DC    AL2(64)         0040                              DSK0210 41701036
        DC    AL2(65)         0041                              DSK0210 41701037
        DC    AL2(66)         0042                              DSK0210 41701038
        DC    AL2(67)         0043                              DSK0210 41701039
        DC    AL2(2)          0002                              DSK0210 41701040
        DC    AL2(55104)      D740                              DSK0210 41701041
        DC    AL2(57)         0039                              DSK0210 41701042
        DC    AL2(55104)      D740                              DSK0210 41701043
        DC    AL2(58)         003A                              DSK0210 41701044
        DC    AL2(0)          0000                              DSK0210 41701045
        DC    AL2(4608)       1200                              DSK0210 41701046
        DC    AL2(1)          0001                              DSK0210 41701047
        DC    AL2(3072)       0C00                              DSK0210 41701048
        DC    AL2(15)         000F                              DSK0210 41701049
        DC    AL2(0)          0000                              DSK0210 41701050
        DC    AL2(144)        0090                              DSK0210 41701051
        DC    AL2(0)          0000                              DSK0210 41701052
        DC    AL2(255)        00FF                              DSK0210 41701053
        DC    AL2(0)          0000                              DSK0210 41701054
        DC    AL2(1)          0001                              DSK0210 41701055
        DC    AL2(1024)       0400                              DSK0210 41701056
        DC    AL2(128)        0080                              DSK0210 41701057
        DC    AL2(1)          0001                              DSK0210 41701058
        DC    AL2(57)         0039                              DSK0210 41701059
        DC    AL2(340)        0154                              DSK0210 41701060
        DC    AL2(1)          0001                              DSK0210 41701061
        DC    AL2(1)          0001                              DSK0210 41701062
        DC    AL2(58)         003A                              DSK0210 41701063
        DC    AL2(4096)       1000                              DSK0210 41701064
        DC    AL2(1)          0001                              DSK0210 41701065
        DC    AL2(3072)       0C00                              DSK0210 41701066
        DC    AL2(0)          0000                              DSK0210 41701067
        DC    AL2(0)          0000                              DSK0210 41701068
        DC    AL2(144)        0090                              DSK0210 41701069
        DC    AL2(0)          0000                              DSK0210 41701070
        DC    AL2(32767)      7FFF                              DSK0210 41701071
        DC    AL2(0)          0000                              DSK0210 41701072
        DC    AL2(0)          0000                              DSK0210 41701073
        DC    AL2(1024)       0400                              DSK0210 41701074
        DC    AL2(128)        0080                              DSK0210 41701075
        DC    AL2(1)          0001                              DSK0210 41701076
        DC    AL2(58)         003A                              DSK0210 41701077
        DC    AL2(348)        015C                              DSK0210 41701078
        DC    AL2(0)          0000                              DSK0210 41701079
        DC    AL2(8704)       2200                              DSK0210 41701080
        DC    AL2(1)          0001                              DSK0210 41701081
        DC    AL2(2059)       080B                              DSK0210 41701082
        DC    AL2(5120)       1400                              DSK0210 41701083
        DC    AL2(1)          0001                              DSK0210 41701084
        DC    AL2(66)         0042                              DSK0210 41701085
        DC    AL2(0)          0000                              DSK0210 41701086
        DC    AL2(7168)       1C00                              DSK0210 41701087
        DC    AL2(1)          0001                              DSK0210 41701088
        DC    AL2(59)         003B                              DSK0210 41701089
        DC    AL2(82)         0052                              DSK0210 41701090
        DC    AL2(522)        020A                              DSK0210 41701091
        DC    C'RECORDSIZE'                                     DSK0210 41701092
        DC    AL1(5)          05                                DSK0210 41701093
        DC    C'RECSZ'                                          DSK0210 41701094
        DC    AL2(7)          0007                              DSK0210 41701095
        DC    AL2(18)         0012                              DSK0210 41701096
        DC    AL2(19)         0013                              DSK0210 41701097
        DC    AL2(44)         002C                              DSK0210 41701098
        DC    AL2(64)         0040                              DSK0210 41701099
        DC    AL2(65)         0041                              DSK0210 41701100
        DC    AL2(66)         0042                              DSK0210 41701101
        DC    AL2(67)         0043                              DSK0210 41701102
        DC    AL2(2)          0002                              DSK0210 41701103
        DC    AL2(55104)      D740                              DSK0210 41701104
        DC    AL2(60)         003C                              DSK0210 41701105
        DC    AL2(55104)      D740                              DSK0210 41701106
        DC    AL2(61)         003D                              DSK0210 41701107
        DC    AL2(0)          0000                              DSK0210 41701108
        DC    AL2(4608)       1200                              DSK0210 41701109
        DC    AL2(1)          0001                              DSK0210 41701110
        DC    AL2(3072)       0C00                              DSK0210 41701111
        DC    AL2(15)         000F                              DSK0210 41701112
        DC    AL2(0)          0000                              DSK0210 41701113
        DC    AL2(144)        0090                              DSK0210 41701114
        DC    AL2(32767)      7FFF                              DSK0210 41701115
        DC    AL2(65535)      FFFF                              DSK0210 41701116
        DC    AL2(0)          0000                              DSK0210 41701117
        DC    AL2(1)          0001                              DSK0210 41701118
        DC    AL2(1024)       0400                              DSK0210 41701119
        DC    AL2(128)        0080                              DSK0210 41701120
        DC    AL2(1)          0001                              DSK0210 41701121
        DC    AL2(60)         003C                              DSK0210 41701122
        DC    AL2(356)        0164                              DSK0210 41701123
        DC    AL2(1)          0001                              DSK0210 41701124
        DC    AL2(1)          0001                              DSK0210 41701125
        DC    AL2(61)         003D                              DSK0210 41701126
        DC    AL2(4096)       1000                              DSK0210 41701127
        DC    AL2(1)          0001                              DSK0210 41701128
        DC    AL2(3072)       0C00                              DSK0210 41701129
        DC    AL2(0)          0000                              DSK0210 41701130
        DC    AL2(0)          0000                              DSK0210 41701131
        DC    AL2(144)        0090                              DSK0210 41701132
        DC    AL2(32767)      7FFF                              DSK0210 41701133
        DC    AL2(65535)      FFFF                              DSK0210 41701134
        DC    AL2(0)          0000                              DSK0210 41701135
        DC    AL2(1)          0001                              DSK0210 41701136
        DC    AL2(1024)       0400                              DSK0210 41701137
        DC    AL2(128)        0080                              DSK0210 41701138
        DC    AL2(1)          0001                              DSK0210 41701139
        DC    AL2(61)         003D                              DSK0210 41701140
        DC    AL2(364)        016C                              DSK0210 41701141
        DC    AL2(0)          0000                              DSK0210 41701142
        DC    AL2(6656)       1A00                              DSK0210 41701143
        DC    AL2(1)          0001                              DSK0210 41701144
        DC    AL2(1545)       0609                              DSK0210 41701145
        DC    AL2(4352)       1100                              DSK0210 41701146
        DC    AL2(1)          0001                              DSK0210 41701147
        DC    AL2(64)         0040                              DSK0210 41701148
        DC    AL2(1)          0001                              DSK0210 41701149
        DC    AL2(62)         003E                              DSK0210 41701150
        DC    AL2(84)         0054                              DSK0210 41701151
        DC    AL2(521)        0209                              DSK0210 41701152
        DC    C'UNIQUEKEY'                                      DSK0210 41701153
        DC    AL1(4)          04                                DSK0210 41701154
        DC    C'UNQK'                                           DSK0210 41701155
        DC    AL2(7)          0007                              DSK0210 41701156
        DC    AL2(18)         0012                              DSK0210 41701157
        DC    AL2(19)         0013                              DSK0210 41701158
        DC    AL2(44)         002C                              DSK0210 41701159
        DC    AL2(64)         0040                              DSK0210 41701160
        DC    AL2(65)         0041                              DSK0210 41701161
        DC    AL2(66)         0042                              DSK0210 41701162
        DC    AL2(67)         0043                              DSK0210 41701163
        DC    AL2(0)          0000                              DSK0210 41701164
        DC    AL2(7168)       1C00                              DSK0210 41701165
        DC    AL2(1)          0001                              DSK0210 41701166
        DC    AL2(1545)       0609                              DSK0210 41701167
        DC    AL2(4864)       1300                              DSK0210 41701168
        DC    AL2(2)          0002                              DSK0210 41701169
        DC    AL2(64)         0040                              DSK0210 41701170
        DC    AL2(1)          0001                              DSK0210 41701171
        DC    AL2(63)         003F                              DSK0210 41701172
        DC    AL2(84)         0054                              DSK0210 41701173
        DC    AL2(524)        020C                              DSK0210 41701174
        DC    C'NONUNIQUEKEY'                                   DSK0210 41701175
        DC    AL1(5)          05                                DSK0210 41701176
        DC    C'NUNQK'                                          DSK0210 41701177
        DC    AL2(7)          0007                              DSK0210 41701178
        DC    AL2(18)         0012                              DSK0210 41701179
        DC    AL2(19)         0013                              DSK0210 41701180
        DC    AL2(44)         002C                              DSK0210 41701181
        DC    AL2(64)         0040                              DSK0210 41701182
        DC    AL2(65)         0041                              DSK0210 41701183
        DC    AL2(66)         0042                              DSK0210 41701184
        DC    AL2(67)         0043                              DSK0210 41701185
        DC    AL2(0)          0000                              DSK0210 41701186
        DC    AL2(10752)      2A00                              DSK0210 41701187
        DC    AL2(1)          0001                              DSK0210 41701188
        DC    AL2(1545)       0609                              DSK0210 41701189
        DC    AL2(4096)       1000                              DSK0210 41701190
        DC    AL2(1)          0001                              DSK0210 41701191
        DC    AL2(64)         0040                              DSK0210 41701192
        DC    AL2(1)          0001                              DSK0210 41701193
        DC    AL2(64)         0040                              DSK0210 41701194
        DC    AL2(86)         0056                              DSK0210 41701195
        DC    AL2(519)        0207                              DSK0210 41701196
        DC    C'UPGRADE'                                        DSK0210 41701197
        DC    AL1(3)          03                                DSK0210 41701198
        DC    C'UPG'                                            DSK0210 41701199
        DC    AL2(0)          0000                              DSK0210 41701200
        DC    AL2(6144)       1800                              DSK0210 41701201
        DC    AL2(5376)       1500                              DSK0210 41701202
        DC    AL2(5632)       1600                              DSK0210 41701203
        DC    AL2(5888)       1700                              DSK0210 41701204
        DC    AL2(7936)       1F00                              DSK0210 41701205
        DC    AL2(8704)       2200                              DSK0210 41701206
        DC    AL2(8960)       2300                              DSK0210 41701207
        DC    AL2(9216)       2400                              DSK0210 41701208
        DC    AL2(9472)       2500                              DSK0210 41701209
        DC    AL2(9728)       2600                              DSK0210 41701210
        DC    AL2(10240)      2800                              DSK0210 41701211
        DC    AL2(10496)      2900                              DSK0210 41701212
        DC    AL2(14080)      3700                              DSK0210 41701213
        DC    AL2(14336)      3800                              DSK0210 41701214
        DC    AL2(15104)      3B00                              DSK0210 41701215
        DC    AL2(15872)      3E00                              DSK0210 41701216
        DC    AL2(16128)      3F00                              DSK0210 41701217
        DC    AL2(16896)      4200                              DSK0210 41701218
        DC    AL2(17152)      4300                              DSK0210 41701219
        DC    AL2(17408)      4400                              DSK0210 41701220
        DC    AL2(17664)      4500                              DSK0210 41701221
        DC    AL2(17920)      4600                              DSK0210 41701222
        DC    AL2(18176)      4700                              DSK0210 41701223
        DC    AL2(18432)      4800                              DSK0210 41701224
        DC    AL2(18688)      4900                              DSK0210 41701225
        DC    AL2(42)         002A                              DSK0210 41701226
        DC    AL2(0)          0000                              DSK0210 41701227
        DC    AL2(262)        0106                              DSK0210 41701228
        DC    AL2(2321)       0911                              DSK0210 41701229
        DC    AL2(0)          0000                              DSK0210 41701230
        DC    AL2(512)        0200                              DSK0210 41701231
        DC    AL2(16384)      4000                              DSK0210 41701232
        DC    AL2(256)        0100                              DSK0210 41701233
        DC    AL2(16640)      4100                              DSK0210 41701234
        DC    AL2(22018)      5602                              DSK0210 41701235
        DC    AL1(9)          09                                DSK0210 41701236
        DC    C'NOUPGRADE'                                      DSK0210 41701237
        DC    AL1(4)          04                                DSK0210 41701238
        DC    C'NUPG'                                           DSK0210 41701239
        DC    AL2(24)         0018                              DSK0210 41701240
        DC    AL2(21)         0015                              DSK0210 41701241
        DC    AL2(22)         0016                              DSK0210 41701242
        DC    AL2(23)         0017                              DSK0210 41701243
        DC    AL2(31)         001F                              DSK0210 41701244
        DC    AL2(34)         0022                              DSK0210 41701245
        DC    AL2(35)         0023                              DSK0210 41701246
        DC    AL2(36)         0024                              DSK0210 41701247
        DC    AL2(37)         0025                              DSK0210 41701248
        DC    AL2(38)         0026                              DSK0210 41701249
        DC    AL2(40)         0028                              DSK0210 41701250
        DC    AL2(41)         0029                              DSK0210 41701251
        DC    AL2(55)         0037                              DSK0210 41701252
        DC    AL2(56)         0038                              DSK0210 41701253
        DC    AL2(59)         003B                              DSK0210 41701254
        DC    AL2(62)         003E                              DSK0210 41701255
        DC    AL2(63)         003F                              DSK0210 41701256
        DC    AL2(66)         0042                              DSK0210 41701257
        DC    AL2(67)         0043                              DSK0210 41701258
        DC    AL2(68)         0044                              DSK0210 41701259
        DC    AL2(69)         0045                              DSK0210 41701260
        DC    AL2(70)         0046                              DSK0210 41701261
        DC    AL2(71)         0047                              DSK0210 41701262
        DC    AL2(72)         0048                              DSK0210 41701263
        DC    AL2(73)         0049                              DSK0210 41701264
        DC    AL2(10240)      2800                              DSK0210 41701265
        DC    AL2(1)          0001                              DSK0210 41701266
        DC    AL2(1545)       0609                              DSK0210 41701267
        DC    AL2(3840)       0F00                              DSK0210 41701268
        DC    AL2(1)          0001                              DSK0210 41701269
        DC    AL2(64)         0040                              DSK0210 41701270
        DC    AL2(1)          0001                              DSK0210 41701271
        DC    AL2(66)         0042                              DSK0210 41701272
        DC    AL2(88)         0058                              DSK0210 41701273
        DC    AL2(518)        0206                              DSK0210 41701274
        DC    C'UPDATE'                                         DSK0210 41701275
        DC    AL1(3)          03                                DSK0210 41701276
        DC    C'UPD'                                            DSK0210 41701277
        DC    AL2(24)         0018                              DSK0210 41701278
        DC    AL2(21)         0015                              DSK0210 41701279
        DC    AL2(22)         0016                              DSK0210 41701280
        DC    AL2(23)         0017                              DSK0210 41701281
        DC    AL2(31)         001F                              DSK0210 41701282
        DC    AL2(34)         0022                              DSK0210 41701283
        DC    AL2(35)         0023                              DSK0210 41701284
        DC    AL2(36)         0024                              DSK0210 41701285
        DC    AL2(37)         0025                              DSK0210 41701286
        DC    AL2(38)         0026                              DSK0210 41701287
        DC    AL2(40)         0028                              DSK0210 41701288
        DC    AL2(41)         0029                              DSK0210 41701289
        DC    AL2(55)         0037                              DSK0210 41701290
        DC    AL2(56)         0038                              DSK0210 41701291
        DC    AL2(59)         003B                              DSK0210 41701292
        DC    AL2(62)         003E                              DSK0210 41701293
        DC    AL2(63)         003F                              DSK0210 41701294
        DC    AL2(64)         0040                              DSK0210 41701295
        DC    AL2(65)         0041                              DSK0210 41701296
        DC    AL2(68)         0044                              DSK0210 41701297
        DC    AL2(69)         0045                              DSK0210 41701298
        DC    AL2(70)         0046                              DSK0210 41701299
        DC    AL2(71)         0047                              DSK0210 41701300
        DC    AL2(72)         0048                              DSK0210 41701301
        DC    AL2(73)         0049                              DSK0210 41701302
        DC    AL2(10752)      2A00                              DSK0210 41701303
        DC    AL2(1)          0001                              DSK0210 41701304
        DC    AL2(1545)       0609                              DSK0210 41701305
        DC    AL2(4352)       1100                              DSK0210 41701306
        DC    AL2(2)          0002                              DSK0210 41701307
        DC    AL2(64)         0040                              DSK0210 41701308
        DC    AL2(1)          0001                              DSK0210 41701309
        DC    AL2(67)         0043                              DSK0210 41701310
        DC    AL2(88)         0058                              DSK0210 41701311
        DC    AL2(520)        0208                              DSK0210 41701312
        DC    C'NOUPDATE'                                       DSK0210 41701313
        DC    AL1(4)          04                                DSK0210 41701314
        DC    C'NUPD'                                           DSK0210 41701315
        DC    AL2(0)          0000                              DSK0210 41701316
        DC    AL2(6144)       1800                              DSK0210 41701317
        DC    AL2(5376)       1500                              DSK0210 41701318
        DC    AL2(5632)       1600                              DSK0210 41701319
        DC    AL2(5888)       1700                              DSK0210 41701320
        DC    AL2(7936)       1F00                              DSK0210 41701321
        DC    AL2(8704)       2200                              DSK0210 41701322
        DC    AL2(8960)       2300                              DSK0210 41701323
        DC    AL2(9216)       2400                              DSK0210 41701324
        DC    AL2(9472)       2500                              DSK0210 41701325
        DC    AL2(9728)       2600                              DSK0210 41701326
        DC    AL2(10240)      2800                              DSK0210 41701327
        DC    AL2(10496)      2900                              DSK0210 41701328
        DC    AL2(14080)      3700                              DSK0210 41701329
        DC    AL2(14336)      3800                              DSK0210 41701330
        DC    AL2(15104)      3B00                              DSK0210 41701331
        DC    AL2(15872)      3E00                              DSK0210 41701332
        DC    AL2(16128)      3F00                              DSK0210 41701333
        DC    AL2(16384)      4000                              DSK0210 41701334
        DC    AL2(16640)      4100                              DSK0210 41701335
        DC    AL2(17408)      4400                              DSK0210 41701336
        DC    AL2(17664)      4500                              DSK0210 41701337
        DC    AL2(17920)      4600                              DSK0210 41701338
        DC    AL2(18176)      4700                              DSK0210 41701339
        DC    AL2(18432)      4800                              DSK0210 41701340
        DC    AL2(18706)      4912                              DSK0210 41701341
        DC    AL2(0)          0000                              DSK0210 41701342
        DC    AL2(262)        0106                              DSK0210 41701343
        DC    AL2(2317)       090D                              DSK0210 41701344
        DC    AL2(0)          0000                              DSK0210 41701345
        DC    AL2(256)        0100                              DSK0210 41701346
        DC    AL2(16384)      4000                              DSK0210 41701347
        DC    AL2(256)        0100                              DSK0210 41701348
        DC    AL2(17664)      4500                              DSK0210 41701349
        DC    AL2(23041)      5A01                              DSK0210 41701350
        DC    AL1(5)          05                                DSK0210 41701351
        DC    C'STAGE'                                          DSK0210 41701352
        DC    AL2(0)          0000                              DSK0210 41701353
        DC    AL2(768)        0300                              DSK0210 41701354
        DC    AL2(4608)       1200                              DSK0210 41701355
        DC    AL2(4864)       1300                              DSK0210 41701356
        DC    AL2(11264)      2C00                              DSK0210 41701357
        DC    AL2(16)         0010                              DSK0210 41701358
        DC    AL2(0)          0000                              DSK0210 41701359
        DC    AL2(262)        0106                              DSK0210 41701360
        DC    AL2(2316)       090C                              DSK0210 41701361
        DC    AL2(0)          0000                              DSK0210 41701362
        DC    AL2(512)        0200                              DSK0210 41701363
        DC    AL2(16384)      4000                              DSK0210 41701364
        DC    AL2(256)        0100                              DSK0210 41701365
        DC    AL2(17920)      4600                              DSK0210 41701366
        DC    AL2(23041)      5A01                              DSK0210 41701367
        DC    AL1(4)          04                                DSK0210 41701368
        DC    C'BIND'                                           DSK0210 41701369
        DC    AL2(3)          0003                              DSK0210 41701370
        DC    AL2(18)         0012                              DSK0210 41701371
        DC    AL2(19)         0013                              DSK0210 41701372
        DC    AL2(44)         002C                              DSK0210 41701373
        DC    AL2(6144)       1800                              DSK0210 41701374
        DC    AL2(1)          0001                              DSK0210 41701375
        DC    AL2(1545)       0609                              DSK0210 41701376
        DC    AL2(4864)       1300                              DSK0210 41701377
        DC    AL2(3)          0003                              DSK0210 41701378
        DC    AL2(64)         0040                              DSK0210 41701379
        DC    AL2(1)          0001                              DSK0210 41701380
        DC    AL2(71)         0047                              DSK0210 41701381
        DC    AL2(90)         005A                              DSK0210 41701382
        DC    AL2(525)        020D                              DSK0210 41701383
        DC    C'CYLINDERFAULT'                                  DSK0210 41701384
        DC    AL1(4)          04                                DSK0210 41701385
        DC    C'CYLF'                                           DSK0210 41701386
        DC    AL2(3)          0003                              DSK0210 41701387
        DC    AL2(18)         0012                              DSK0210 41701388
        DC    AL2(19)         0013                              DSK0210 41701389
        DC    AL2(44)         002C                              DSK0210 41701390
        DC    AL2(0)          0000                              DSK0210 41701391
        DC    AL2(6144)       1800                              DSK0210 41701392
        DC    AL2(1)          0001                              DSK0210 41701393
        DC    AL2(1545)       0609                              DSK0210 41701394
        DC    AL2(5120)       1400                              DSK0210 41701395
        DC    AL2(1)          0001                              DSK0210 41701396
        DC    AL2(64)         0040                              DSK0210 41701397
        DC    AL2(1)          0001                              DSK0210 41701398
        DC    AL2(72)         0048                              DSK0210 41701399
        DC    AL2(92)         005C                              DSK0210 41701400
        DC    AL2(525)        020D                              DSK0210 41701401
        DC    C'NODESTAGEWAIT'                                  DSK0210 41701402
        DC    AL1(6)          06                                DSK0210 41701403
        DC    C'NDSTGW'                                         DSK0210 41701404
        DC    AL2(3)          0003                              DSK0210 41701405
        DC    AL2(18)         0012                              DSK0210 41701406
        DC    AL2(19)         0013                              DSK0210 41701407
        DC    AL2(44)         002C                              DSK0210 41701408
        DC    AL2(6144)       1800                              DSK0210 41701409
        DC    AL2(1)          0001                              DSK0210 41701410
        DC    AL2(1545)       0609                              DSK0210 41701411
        DC    AL2(4864)       1300                              DSK0210 41701412
        DC    AL2(2)          0002                              DSK0210 41701413
        DC    AL2(64)         0040                              DSK0210 41701414
        DC    AL2(1)          0001                              DSK0210 41701415
        DC    AL2(73)         0049                              DSK0210 41701416
        DC    AL2(92)         005C                              DSK0210 41701417
        DC    AL2(523)        020B                              DSK0210 41701418
        DC    C'DESTAGEWAIT'                                    DSK0210 41701419
        DC    AL1(5)          05                                DSK0210 41701420
        DC    C'DSTGW'                                          DSK0210 41701421
        DC    AL2(0)          0000                              DSK0210 41701422
        DC    AL2(768)        0300                              DSK0210 41701423
        DC    AL2(4608)       1200                              DSK0210 41701424
        DC    AL2(4864)       1300                              DSK0210 41701425
        DC    AL2(11264)      2C00                              DSK0210 41701426
        DC    AL1(0)          00                                DSK0210 41701427
PAL00000 IKJPARM DSECT=DAL00000                                         42000003
NTRY00   IKJPOSIT DSTHING,USID,PROMPT='ENTRY NAME',                    *42300003
               HELP=('NAME OF ENTRY TO BE ALTERED')                     42600003
CAT00    IKJKEYWD                                                       42900003
         IKJNAME 'CATALOG',ALIAS=('CAT'),SUBFLD=@CAT01                  43200003
NEWNM00  IKJKEYWD                                                       43500003
         IKJNAME 'NEWNAME',ALIAS=('NEWNM'),SUBFLD=@NEWNM01              43800003
INDD00   IKJKEYWD                                                       44100003
         IKJNAME 'FILE',SUBFLD=@INDD01                                  44400003
MASTR00  IKJKEYWD                                                       44700003
         IKJNAME 'MASTERPW',ALIAS=('MRPW'),SUBFLD=@MASTR01              45000003
CNTVL00  IKJKEYWD                                                       45300003
         IKJNAME 'CONTROLPW',ALIAS=('CTLPW'),SUBFLD=@CNTVL01            45600003
UPDAT00  IKJKEYWD                                                       45900003
         IKJNAME 'UPDATEPW',ALIAS=('UPDPW'),SUBFLD=@UPDAT01             46200003
READ00   IKJKEYWD                                                       46500003
         IKJNAME 'READPW',ALIAS=('RDPW'),SUBFLD=@READ01                 46800003
CODNM00  IKJKEYWD                                                       47100003
         IKJNAME 'CODE',SUBFLD=@CODNM01                                 47400003
ATTP00   IKJKEYWD                                                       47700003
         IKJNAME 'ATTEMPTS',ALIAS=('ATTEMPT','ATT'),SUBFLD=@ATTP01      48000003
AUTH00   IKJKEYWD                                                       48300003
         IKJNAME 'AUTHORIZATION',ALIAS=('AUTH'),SUBFLD=@AUTH01          48600003
TO00     IKJKEYWD                                                       48900003
         IKJNAME 'TO',SUBFLD=@TO01                                      49200003
         IKJNAME 'FOR',SUBFLD=@FOR01                                    49500003
OWNER00  IKJKEYWD                                                       49800003
         IKJNAME 'OWNER',SUBFLD=@OWNER01                                50100003
ERASE00  IKJKEYWD                                                       50400003
         IKJNAME 'ERASE',ALIAS=('ERAS')                                 50700003
         IKJNAME 'NOERASE',ALIAS=('NERAS')                              51000003
SHARE00  IKJKEYWD                                                       51300003
         IKJNAME 'SHAREOPTIONS',ALIAS=('SHAREOPTION','SHR'),SUBFLD=@SHA*51600003
               RE01                                                     51900003
NULLF00  IKJKEYWD                                                       52200003
         IKJNAME 'NULLIFY',ALIAS=('NULL'),SUBFLD=@NULLF01               52500003
FSPAC00  IKJKEYWD                                                       52800003
         IKJNAME 'FREESPACE',ALIAS=('FSPC'),SUBFLD=@FSPAC01             53100003
WRTCK00  IKJKEYWD                                                       53400003
         IKJNAME 'WRITECHECK',ALIAS=('WCK')                             53700003
         IKJNAME 'NOWRITECHECK',ALIAS=('NWCK')                          54000003
BUFSZ00  IKJKEYWD                                                       54300003
         IKJNAME 'BUFFERSPACE',ALIAS=('BUFSPC','BUFSP'),SUBFLD=@BUFSZ01 54600003
ADDVL00  IKJKEYWD                                                       54900003
         IKJNAME 'ADDVOLUMES',ALIAS=('ADDVOLUME','AVOL'),SUBFLD=@ADDVL0*55200003
               1                                                        55500003
REMVL00  IKJKEYWD                                                       55800003
         IKJNAME 'REMOVEVOLUMES',ALIAS=('REMOVEVOLUME','RVOL'),SUBFLD=@*56100003
               REMVL01                                                  56400003
INHIB00  IKJKEYWD                                                       56700003
         IKJNAME 'INHIBIT',ALIAS=('INH')                                57000003
         IKJNAME 'UNINHIBIT',ALIAS=('UNINH')                            57300003
GDGEM00  IKJKEYWD                                                       57600003
         IKJNAME 'EMPTY',ALIAS=('EMP')                                  57900003
         IKJNAME 'NOEMPTY',ALIAS=('NEMP')                               58200003
GDGSC00  IKJKEYWD                                                       58500003
         IKJNAME 'SCRATCH',ALIAS=('SCR')                                58800003
         IKJNAME 'NOSCRATCH',ALIAS=('NSCR')                             59100003
EEXT00   IKJKEYWD                                                       59400003
         IKJNAME 'EXCEPTIONEXIT',ALIAS=('EEXT'),SUBFLD=@EEXT01          59700003
KEY00    IKJKEYWD                                                       60000003
         IKJNAME 'KEYS',ALIAS=('KEY'),SUBFLD=@KEY01                     60300003
RECSZ00  IKJKEYWD                                                       60600003
         IKJNAME 'RECORDSIZE',ALIAS=('RECSZ'),SUBFLD=@RECSZ01           60900003
UNQK00   IKJKEYWD                                                       61200003
         IKJNAME 'UNIQUEKEY',ALIAS=('UNQK')                             61500003
         IKJNAME 'NONUNIQUEKEY',ALIAS=('NUNQK')                         61800003
UPG00    IKJKEYWD                                                       62100003
         IKJNAME 'UPGRADE',ALIAS=('UPG')                                62400003
         IKJNAME 'NOUPGRADE',ALIAS=('NUPG')                             62700003
UPD00    IKJKEYWD                                                       63000003
         IKJNAME 'UPDATE',ALIAS=('UPD')                                 63300003
         IKJNAME 'NOUPDATE',ALIAS=('NUPD')                              63600003
STAGE00  IKJKEYWD                                                       63900003
         IKJNAME 'STAGE'                                                64200003
         IKJNAME 'BIND'                                                 64500003
         IKJNAME 'CYLINDERFAULT',ALIAS=('CYLF')                         64800003
NSTGW00  IKJKEYWD                                                       65100003
         IKJNAME 'NODESTAGEWAIT',ALIAS=('NDSTGW')                       65400003
         IKJNAME 'DESTAGEWAIT',ALIAS=('DSTGW')                          65700003
@CAT01   IKJSUBF                                                        66000003
CATLG01  IKJPOSIT DSNAME,USID,PROMPT='''CATALOG'' CATNAME/PASSWORD VALU*66300003
               E',                                                     *66600003
               HELP=('NAME OF CATALOG CONTAINING THE ENTRY')            66900003
CATDN01  IKJIDENT '''CATALOG'' DNAME VALUE',HEX                         67200003
@NEWNM01 IKJSUBF                                                        67500003
NEWNM01  IKJPOSIT DSTHING,USID,PROMPT='NEW ENTRY NAME',                *67800003
               HELP=('NEW NAME FOR THIS ENTRY')                         68100003
@INDD01  IKJSUBF                                                        68400003
INDD01   IKJIDENT '''FILE'' DNAME',HEX,PROMPT='''FILE'' DNAME',        *68700003
               HELP=('DNAME OF JCL STATEMENT FOR NECESSARY VOLUME(S)')  69000003
@MASTR01 IKJSUBF                                                        69300003
MASTR01  IKJIDENT 'MASTER PASSWORD',HEX,PROMPT='MASTER PASSWORD',      *69600003
               HELP=('NEW MASTER LEVEL PASSWORD')                       69900003
@CNTVL01 IKJSUBF                                                        70200003
CNTVL01  IKJIDENT 'CONTROL PASSWORD',HEX,PROMPT='CONTROL PASSWORD',    *70500003
               HELP=('NEW CONTROL LEVEL PASSWORD')                      70800003
@UPDAT01 IKJSUBF                                                        71100003
UPDAT01  IKJIDENT 'UPDATE PASSWORD',HEX,PROMPT='UPDATE PASSWORD',      *71400003
               HELP=('NEW UPDATE LEVEL PASSWORD')                       71700003
@READ01  IKJSUBF                                                        72000003
READ01   IKJIDENT 'READ PASSWORD',HEX,PROMPT='READ PASSWORD',          *72300003
               HELP=('NEW READ LEVEL PASSWORD')                         72600003
@CODNM01 IKJSUBF                                                        72900003
CODNM01  IKJIDENT 'PROMPTING CODE',HEX,PROMPT='PROMPTING CODE',        *73200003
               HELP=('NEW CODE NAME')                                   73500003
@ATTP01  IKJSUBF                                                        73800003
ATTP01   IKJIDENT 'PASSWORD ATTEMPTS VALUE',INTEG,PROMPT='PASSWORD ATTE*74100003
               MPTS VALUE',                                            *74400003
               HELP=('NEW ACCESS ATTEMPTS COUNT')                       74700003
@AUTH01  IKJSUBF                                                        75000003
USVR01   IKJIDENT '''AUTHORIZATION'' MODULE NAME',HEX,PROMPT='''AUTHORI*75300003
               ZATION'' MODULE NAME',                                  *75600003
               HELP=('NEW AUTHORIZATION MODULE NAME')                   75900003
USAR01   IKJIDENT '''AUTHORIZATION'' USER RECORD',HEX                   76200003
@TO01    IKJSUBF                                                        76500003
TO01     IKJIDENT '''TO'' (EXPIRATION DATE) PARAMETER',INTEG,PROMPT='''*76800003
               TO'' (EXPIRATION DATE) PARAMETER',                      *77100003
               HELP=('NEW EXPIRATION DATE')                             77400003
@FOR01   IKJSUBF                                                        77700003
FOR01    IKJIDENT '''FOR'' (EXPIRATION DATE) PARAMETER',INTEG,PROMPT=''*78000003
               'FOR'' (EXPIRATION DATE) PARAMETER',                    *78300003
               HELP=('NEW DAY COUNT FOR EXPIRATION DATE')               78600003
@OWNER01 IKJSUBF                                                        78900003
OWNER01  IKJIDENT 'OWNER ID',HEX,PROMPT='OWNER ID',                    *79200003
               HELP=('NEW OWNER IDENTIFICATION')                        79500003
@SHARE01 IKJSUBF                                                        79800003
SHAR101  IKJIDENT 'FIRST ''SHAREOPTIONS'' VALUE',INTEG,PROMPT='FIRST ''*80100003
               SHAREOPTIONS'' VALUE',                                  *80400003
               HELP=('FIRST SHARE OPTIONS VALUE (1 | 2 | 3 | 4)')       80700003
SHAR201  IKJIDENT 'SECOND ''SHAREOPTIONS'' VALUE',INTEG                 81000003
@NULLF01 IKJSUBF                                                        81300003
NMSTR01  IKJKEYWD                                                       81600003
         IKJNAME 'MASTERPW',ALIAS=('MRPW')                              81900003
NCNTV01  IKJKEYWD                                                       82200003
         IKJNAME 'CONTROLPW',ALIAS=('CTLPW')                            82500003
NUPDT01  IKJKEYWD                                                       82800003
         IKJNAME 'UPDATEPW',ALIAS=('UPDPW')                             83100003
NREAD01  IKJKEYWD                                                       83400003
         IKJNAME 'READPW',ALIAS=('RDPW')                                83700003
NOWNR01  IKJKEYWD                                                       84000003
         IKJNAME 'OWNER'                                                84300003
NCDNM01  IKJKEYWD                                                       84600003
         IKJNAME 'CODE'                                                 84900003
NRETN01  IKJKEYWD                                                       85200003
         IKJNAME 'RETENTION',ALIAS=('RETN')                             85500003
NAUTH01  IKJKEYWD                                                       85800003
         IKJNAME 'AUTHORIZATION',ALIAS=('AUTH'),SUBFLD=@NAUTH02         86100003
NEEXT01  IKJKEYWD                                                       86400003
         IKJNAME 'EXCEPTIONEXIT',ALIAS=('EEXT')                         86700003
@FSPAC01 IKJSUBF                                                        87000003
FSPCI01  IKJIDENT '''FREESPACE'' CONTROL INTERVAL PERCENTAGE',INTEG,PRO*87300003
               MPT='''FREESPACE'' CONTROL INTERVAL PERCENTAGE',        *87600003
               HELP=('NEW FREE SPACE CONTROL INTERVAL PERCENTAGE')      87900003
FSPCA01  IKJIDENT '''FREESPACE'' CONTROL AREA PERCENTAGE',INTEG         88200003
@BUFSZ01 IKJSUBF                                                        88500003
BUFSZ01  IKJIDENT 'BUFFER SPACE VALUE',INTEG,PROMPT='BUFFER SPACE VALUE*88800003
               ',                                                      *89100003
               HELP=('NEW BUFFER SIZE')                                 89400003
@ADDVL01 IKJSUBF                                                        89700003
ADDVL01  IKJIDENT 'VOLUME TO BE ADDED',HEX,LIST,PROMPT='VOLUME TO BE AD*90000003
               DED',                                                   *90300003
               HELP=('CANDIDATE VOLUME TO BE ADDED')                    90600003
@REMVL01 IKJSUBF                                                        90900003
REMVL01  IKJIDENT 'VOLUME TO BE REMOVED',HEX,LIST,PROMPT='VOLUME TO BE *91200003
               REMOVED',                                               *91500003
               HELP=('CANDIDATE VOLUME TO BE REMOVED')                  91800003
@EEXT01  IKJSUBF                                                        92100003
EEXT01   IKJIDENT 'EXCEPTION EXIT',HEX,PROMPT='EXCEPTION EXIT',        *92400003
               HELP=('NEW EXCEPTION EXIT MODULE NAME')                  92700003
@KEY01   IKJSUBF                                                        93000003
KEYLN01  IKJIDENT '''KEYS'' KEYLENGTH',INTEG,PROMPT='''KEYS'' KEYLENGTH*93300003
               ',                                                      *93600003
               HELP=('NEW KEY LENGTH')                                  93900003
KEYPS01  IKJIDENT '''KEYS'' KEY POSITION',INTEG,PROMPT='''KEYS'' KEY PO*94200003
               SITION',                                                *94500003
               HELP=('NEW KEY POSITION')                                94800003
@RECSZ01 IKJSUBF                                                        95100003
AREC01   IKJIDENT '''RECORDSIZE'' AVERAGE',INTEG,PROMPT='''RECORDSIZE''*95400003
                AVERAGE',                                              *95700003
               HELP=('NEW AVERAGE RECORDSIZE')                          96000003
MREC01   IKJIDENT '''RECORDSIZE'' MAXIMUM',INTEG,PROMPT='''RECORDSIZE''*96300003
                MAXIMUM',                                              *96600003
               HELP=('NEW MAXIMUM RECORDSIZE')                          96900003
@NAUTH02 IKJSUBF                                                        97200003
NMDNM02  IKJKEYWD                                                       97500003
         IKJNAME 'MODULE',ALIAS=('MDLE')                                97800003
         IKJNAME 'STRING',ALIAS=('STRG')                                98100003
         IKJENDP                                                        98400003
        END   ,                                                 DSK0210 98700003
