//CATSRC   JOB (1),'CATALOG SRC LIBS',CLASS=A,MSGCLASS=H,
//             NOTIFY=IBMUSER
//*
//* Catalog the MVS 3.8j distributed source libraries that live on the
//* TK3/TK4- source volumes SRC000/SRC001/SRC002/SRCCAT.
//*
//* Each entry lands in whatever catalog MVSSRC already resolves to --
//* the same place as the 213 existing MVSSRC.BLD.* entries, whichever
//* catalog that is.  Do NOT import the user catalog that lives on
//* SRCCAT and do NOT define an MVSSRC alias: an alias would route
//* every MVSSRC.* request to that user catalog and hide those 213.
//*
//* Volumes must be online (V 350-353,ONLINE) before the datasets are
//* read; DEFINE NONVSAM itself does not need them mounted.
//*
//CATLG   EXEC PGM=IDCAMS,REGION=2048K
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 /* 236 datasets referenced by SYS1.PROCLIB(BLDSMP) */
  DEFINE NONVSAM ( -
         NAME(MVSSRC.EREPSY.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.EREPSY.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.EREPSY.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ES1102.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ET1102.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ET1102.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ET2402.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ET2402.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F14) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F15) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F16) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F17) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F18) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F19) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM101.F20) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F14) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F15) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F16) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F17) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F18) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM102.F19) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.TIOCOP.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.TIOCOP.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.TIOCOP.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.TIOCOP.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.TIOCOP.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F14) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F15) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F16) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F17) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F18) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F19) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM103.F20) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM104.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F14) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F15) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F16) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F17) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F18) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F19) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F20) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F21) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F22) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F23) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F24) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F25) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F26) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F27) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F28) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F29) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F30) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F31) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F32) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM201.F33) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F14) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F15) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F16) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F18) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F19) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F20) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F21) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F22) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F23) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F24) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F25) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F26) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F27) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F28) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F29) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F30) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F31) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F32) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F33) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F34) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM301.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM301.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM301.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM401.F14) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM402.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM403.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F14) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F15) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM601.F16) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM602.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRCCAT) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F07) -
         DEVICETYPES(3350) -
         VOLUMES(SRCCAT) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F08) -
         DEVICETYPES(3350) -
         VOLUMES(SRCCAT) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F09) -
         DEVICETYPES(3350) -
         VOLUMES(SRCCAT) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F10) -
         DEVICETYPES(3350) -
         VOLUMES(SRCCAT) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F11) -
         DEVICETYPES(3350) -
         VOLUMES(SRCCAT) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F12) -
         DEVICETYPES(3350) -
         VOLUMES(SRCCAT) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM701.F13) -
         DEVICETYPES(3350) -
         VOLUMES(SRCCAT) )
 /* 18 further tape files, not referenced by BLDSMP */
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ES1102.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ES1102.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ES1102.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ET1102.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ET1102.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ET1102.F05) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.ET1102.F06) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.EV1202.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.EV1202.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.EV1202.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SOURCE.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SOURCE.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SOURCE.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC000) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM202.F17) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM301.F01) -
         DEVICETYPES(3350) -
         VOLUMES(SRC001) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F02) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F03) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
  DEFINE NONVSAM ( -
         NAME(MVSSRC.SYM501.F04) -
         DEVICETYPES(3350) -
         VOLUMES(SRC002) )
/*
//
