*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IGCT010E CSECT                                                          00000060
         B     30(,R15)                                                 00000070
         DC    XL1'19'                                                  00000080
         DC    CL25'IGCT010E ZA46580 05/15/80'                          00000090
         BALR  R9,0                                                     00000100
         USING *,R8                                                     00000110
A000020  EQU *                                                          00000120
         LR    R5,R1                                                    00000130
         L     R15,0(,R5)                                               00000140
         ST    R14,104(,R15)                                            00000150
         ICM   R15,15,808(R9)                                           00000160
         N     R15,4(R5)                                                00000170
         ICM   R14,15,804(R9)                                           00000180
         CLR   R15,R14                                                  00000190
         BE    136(,R9)                                                 00000200
         TM    234(R5),8                                                00000210
         BO    136(,R9)                                                 00000220
         TM    235(R5),128                                              00000230
         BO    136(,R9)                                                 00000240
         LA    R15,4095                                                 00000250
         N     R15,4(R5)                                                00000260
         LTR   R15,R15                                                  00000270
         BNE   136(,R9)                                                 00000280
         TM    234(R5),128                                              00000290
         BO    78(,R9)                                                  00000300
         TM    232(R5),131                                              00000310
         BNE   136(,R9)                                                 00000320
         B     166(,R9)                                                 00000330
         MVC   428(27,R5),769(R9)                                       00000340
         L     R12,540                                                  00000350
         L     R12,12(,R12)                                             00000360
         MVC   438(8,R5),0(R12)                                         00000370
         MVC   447(8,R5),8(R12)                                         00000380
         MVC   404(24,R5),980(R9)                                       00000390
         LA    R1,404(,R5)                                              00000400
         LA    R1,0(R1)                                                 00000410
         OI    0(R1),16                                                 00000420
         LA    R0,428(R5)                                               00000430
         ST    R0,12(R1)                                                00000440
         SVC   51                                                       00000450
         OI    234(R5),8                                                00000460
         L     R12,0(,R5)                                               00000470
         MVC   404(4,R5),36(R12)                                        00000480
         MVI   403(R5),4                                                00000490
         LR    R1,R5                                                    00000500
         MVI   252(R1),0                                                00000510
         OI    253(R1),128                                              00000520
         L     R14,104(,R12)                                            00000530
         BR    R14                                                      00000540
         L     R12,0(,R5)                                               00000550
         L     R12,36(,R12)                                             00000560
         LTR   R12,R12                                                  00000570
         BE    350(,R9)                                                 00000580
         L     R13,764                                                  00000590
         LM    R11,R13,576(R13)                                         00000600
         BALR  R14,R13                                                  00000610
         LA    R6,1                                                     00000620
         L     R12,0(,R5)                                               00000630
         L     R1,36(,R12)                                              00000640
         LA    R2,103                                                   00000650
         ALR   R2,R1                                                    00000660
         L     R4,28(,R12)                                              00000670
         LA    R4,17(,R4)                                               00000680
         SL    R4,756(,R9)                                              00000690
         L     R12,16                                                   00000700
         L     R15,24(,R12)                                             00000710
         BALR  R14,R15                                                  00000720
         BNE   500(,R9)                                                 00000730
         L     R12,0(,R5)                                               00000740
         L     R12,36(,R12)                                             00000750
         L     R10,44(,R12)                                             00000760
         LA    R10,0(,R10)                                              00000770
         LA    R12,2                                                    00000780
         LR    R6,R12                                                   00000790
         LR    R1,R10                                                   00000800
         SLR   R1,R12                                                   00000810
         LA    R2,1                                                     00000820
         ALR   R2,R1                                                    00000830
         LA    R4,768(,R9)                                              00000840
         SL    R4,756(,R9)                                              00000850
         L     R12,16                                                   00000860
         L     R15,24(,R12)                                             00000870
         BALR  R14,R15                                                  00000880
         BNE   642(,R9)                                                 00000890
         LR    R1,R10                                                   00000900
         L     R10,540                                                  00000910
         L     R12,16                                                   00000920
         L     R12,328(,R12)                                            00000930
         L     R15,8(,R12)                                              00000940
         BALR  R14,R15                                                  00000950
         NOP   0                                                        00000960
         LR    R10,R1                                                   00000970
         LTR   R15,R15                                                  00000980
         BNE   642(,R9)                                                 00000990
         L     R12,0(,R5)                                               00001000
         L     R11,24(,R10)                                             00001010
         LA    R11,0(,R11)                                              00001020
         C     R11,36(,R12)                                             00001030
         BNE   642(,R9)                                                 00001040
         L     R13,764                                                  00001050
         LM    R11,R13,588(R13)                                         00001060
         BALR  R14,R13                                                  00001070
         ICM   R15,15,808(R9)                                           00001080
         N     R15,4(R5)                                                00001090
         ICM   R14,15,804(R9)                                           00001100
         CLR   R15,R14                                                  00001110
         BE    136(,R9)                                                 00001120
         MVC   428(27,R5),769(R9)                                       00001130
         L     R12,540                                                  00001140
         L     R12,12(,R12)                                             00001150
         MVC   438(8,R5),0(R12)                                         00001160
         MVC   447(8,R5),8(R12)                                         00001170
         MVC   404(24,R5),980(R9)                                       00001180
         LA    R1,404(,R5)                                              00001190
         LA    R1,0(R1)                                                 00001200
         OI    0(R1),16                                                 00001210
         LA    R0,428(R5)                                               00001220
         ST    R0,12(R1)                                                00001230
         SVC   51                                                       00001240
         OI    234(R5),8                                                00001250
         MVC   404(40,R5),852(R9)                                       00001260
         LR    R0,R15                                                   00001270
         SRDA  R0,32                                                    00001280
         D     R0,752(,R9)                                              00001290
         ALR   R1,R1                                                    00001300
         LA    R14,945(R1,R9)                                           00001310
         MVC   420(2,R5),0(R14)                                         00001320
         L     R12,540                                                  00001330
         L     R12,12(,R12)                                             00001340
         MVC   423(8,R5),0(R12)                                         00001350
         MVC   432(8,R5),8(R12)                                         00001360
         LA    R1,404(,R5)                                              00001370
         SVC   35                                                       00001380
         LR    R1,R5                                                    00001390
         MVI   252(R1),0                                                00001400
         SLR   R14,R14                                                  00001410
         ICM   R14,7,892(R9)                                            00001420
         STCM  R14,7,5(R1)                                              00001430
         B     136(,R9)                                                 00001440
         L     R13,764                                                  00001450
         LM    R11,R13,588(R13)                                         00001460
         BALR  R14,R13                                                  00001470
         MVC   404(40,R5),812(R9)                                       00001480
         LR    R12,R6                                                   00001490
         ALR   R12,R12                                                  00001500
         LA    R11,943(R12,R9)                                          00001510
         MVC   420(2,R5),0(R11)                                         00001520
         L     R12,540                                                  00001530
         L     R12,12(,R12)                                             00001540
         MVC   423(8,R5),0(R12)                                         00001550
         MVC   432(8,R5),8(R12)                                         00001560
         LA    R1,404(,R5)                                              00001570
         SVC   35                                                       00001580
         ST    R6,160(,R5)                                              00001590
         L     R12,0(,R5)                                               00001600
         ST    R12,156(,R5)                                             00001610
         LR    R1,R5                                                    00001620
         MVI   252(R1),4                                                00001630
         LA    R11,606(,R9)                                             00001640
         ST    R11,240(,R1)                                             00001650
         OI    253(R1),4                                                00001660
         NI    253(R1),127                                              00001670
         NI    4(R1),127                                                00001680
         OI    253(R1),8                                                00001690
         L     R14,104(,R12)                                            00001700
         B     164(,R9)                                                 00001710
         LA    R0,132                                                   00001720
         SVC   60                                                       00001730
         LR    R15,R6                                                   00001740
         LM    R2,R13,40(R5)                                            00001750
         LA    R1,361                                                   00001760
         SLL   R1,12                                                    00001770
         LA    R0,160                                                   00001780
         SLL   R0,24                                                    00001790
         OR    R1,R0                                                    00001800
         LA    R0,0(,R14)                                               00001810
         SVC   13                                                       00001820
         LA    R4,404(,R5)                                              00001830
         L     R12,0(,R5)                                               00001840
         L     R12,36(,R12)                                             00001850
         MVC   15(80,R4),0(R12)                                         00001860
         L     R13,764                                                  00001870
         LM    R11,R13,588(R13)                                         00001880
         BALR  R14,R13                                                  00001890
         LA    R12,9                                                    00001900
         ALR   R12,R4                                                   00001910
         L     R11,0(,R5)                                               00001920
         MVC   2(4,R12),36(R11)                                         00001930
         MVI   1(R12),130                                               00001940
         MVI   0(R12),86                                                00001950
         MVC   0(8,R4),796(R9)                                          00001960
         MVI   8(R4),3                                                  00001970
         MVC   96(8,R11),1020(R9)                                       00001980
         LA    R1,96(,R11)                                              00001990
         NOPR  0                                                        00002000
         LA    R15,0                                                    00002010
         STH   R15,2(R1)                                                00002020
         ST    R4,4(R1)                                                 00002030
         LA    R15,4                                                    00002040
         MC    4094,14                                                  00002050
         LTR   R15,R15                                                  00002060
         BNE   510(,R9)                                                 00002070
         LA    R6,3                                                     00002080
         B     510(,R9)                                                 00002090
         DC    CL1'<'                                                   00002100
         DC    XL1'E0'                                                  00002110
         DC    F'00004'                                                 00002120
         DC    F'00028'                                                 00002130
         DC    F'00004'                                                 00002140
         DC    CL1'P'                                                   00002150
         DC    XL1'03'                                                  00002160
         DC    XL2'D014'                                                00002170
         DC    CL1'&&'                                                  00002180
         DC    XL1'1A'                                                  00002190
         DC    CL32'IGCT010E,        ,        IMAGEL'                   00002200
         DC    CL2'IB'                                                  00002210
         DC    XL4'009FB000'                                            00002220
         DC    H'0255'                                                  00002230
         DC    CL1'0'                                                   00002240
         DC    XL1'00'                                                  00002250
         DC    XL4'00248000'                                            00002260
         DC    CL32'IEC919I 169-  ,        ,        '                   00002270
         DC    XL4'04000020'                                            00002280
         DC    XL4'00248000'                                            00002290
         DC    CL32'IEC920I 269-  ,        ,        '                   00002300
         DC    XL4'04000020'                                            00002310
         DC    XL3'269000'                                              00002320
         DC    CL32'**IGCT010E**                    '                   00002330
         DC    CL29'                  010203OR   '                      00002340
         DC    XL4'00700000'                                            00002350
         DC    XL4'08000000'                                            00002360
         DC    F'0'                                                     00002370
         DC    F'0'                                                     00002380
         DC    F'0'                                                     00002390
         DC    F'0'                                                     00002400
         DC    XL4'02A07400'                                            00002410
         DC    F'0'                                                     00002420
         DC    F'0'                                                     00002430
         DC    F'0'                                                     00002440
         DC    F'0'                                                     00002450
         DC    F'0'                                                     00002460
         DC    F'0'                                                     00002470
         DC    F'0'                                                     00002480
         DC    F'0'                                                     00002490
         DC    F'0'                                                     00002500
         DC    XL1'00'                                                  00002510
         DC    CL1'¬'                                                   00002520
         DC    H'0254'                                                  00002530
         DC    F'0'                                                     00002540
R0       EQU   0                                                        00002550
R1       EQU   1                                                        00002560
R2       EQU   2                                                        00002570
R3       EQU   3                                                        00002580
R4       EQU   4                                                        00002590
R5       EQU   5                                                        00002600
R6       EQU   6                                                        00002610
R7       EQU   7                                                        00002620
R8       EQU   8                                                        00002630
R9       EQU   9                                                        00002640
R10      EQU   10                                                       00002650
R11      EQU   11                                                       00002660
R12      EQU   12                                                       00002670
R13      EQU   13                                                       00002680
R14      EQU   14                                                       00002690
R15      EQU   15                                                       00002700
         END                                                            00002710
