*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IGG08116 CSECT                                                          00000060
         ENTRY BLDMSG                                                   00000070
BLDMSG   B     34(,R15)                                                 00000080
         DC    XL3'002E1A'                                              00000090
         DC    CL26'IGG08116 @ZA45504 03/07/80'                         00000100
         DC    XL1'00'                                                  00000110
         STM   R14,R12,12(R13)                                          00000120
         BALR  R3,0                                                     00000130
         USING *,R3                                                     00000140
A000028  EQU *                                                          00000150
         AH    R15,4(,R15)                                              00000160
         BR    R15                                                      00000170
         CLI   217(R8),12                                               00000180
         BE    A00005E                                                  00000190
         CLI   218(R8),12                                               00000200
         BE    A00005E                                                  00000210
         CLI   219(R8),56                                               00000220
         BE    A00005E                                                  00000230
         CLI   219(R8),76                                               00000240
         BE    A00005E                                                  00000250
         CLI   218(R8),16                                               00000260
         BE    A00005E                                                  00000270
         CLI   219(R8),64                                               00000280
         BNE   A00009C                                                  00000290
A00005E  SLR   R12,R12                                                  00000300
         IC    R12,12(,R6)                                              00000310
         SPKA  0(R12)                                                   00000320
         L     R12,220(,R8)                                             00000330
         L     R12,8(,R12)                                              00000340
         LA    R12,0(,R12)                                              00000350
         LTR   R12,R12                                                  00000360
         BE    A000094                                                  00000370
         AL    R12,A00068C                                              00000380
         SLR   R0,R0                                                    00000390
         IC    R0,0(,R12)                                               00000400
         LA    R1,80                                                    00000410
         SPKA  0(R1)                                                    00000420
         STC   R0,212(,R8)                                              00000430
         B     A00009C                                                  00000440
A000094  LA    R12,80                                                   00000450
         SPKA  0(R12)                                                   00000460
A00009C  SLR   R12,R12                                                  00000470
         IC    R12,12(,R6)                                              00000480
         SPKA  0(R12)                                                   00000490
         L     R12,280(,R8)                                             00000500
         TM    44(R12),2                                                00000510
         BNE   A000268                                                  00000520
         LA    R12,80                                                   00000530
         SPKA  0(R12)                                                   00000540
         BAL   R14,A000410                                              00000550
         LA    R12,456                                                  00000560
         ALR   R12,R8                                                   00000570
         TM    16(R12),16                                               00000580
         BNE   A000268                                                  00000590
         TM    16(R12),2                                                00000600
         BE    A0000DC                                                  00000610
         CLI   219(R8),48                                               00000620
         BE    A000268                                                  00000630
A0000DC  TM    13(R6),16                                                00000640
         BNE   A000232                                                  00000650
         CLI   219(R8),28                                               00000660
         BE    A000232                                                  00000670
         SLR   R12,R12                                                  00000680
         IC    R12,12(,R6)                                              00000690
         SPKA  0(R12)                                                   00000700
         CLI   219(R8),60                                               00000710
         BNE   A00014C                                                  00000720
         MVI   160(R4),67                                               00000730
         LA    R12,A000788                                              00000740
         STCM  R12,7,161(R4)                                            00000750
         SLR   R12,R12                                                  00000760
         STH   R12,164(,R4)                                             00000770
         OI    164(R4),96                                               00000780
         MVC   166(2,R4),A00066C+2                                      00000790
         MVI   168(R4),71                                               00000800
         STCM  R12,7,169(R4)                                            00000810
         STH   R12,172(,R4)                                             00000820
         OI    172(R4),96                                               00000830
         MVC   174(2,R4),A000668+2                                      00000840
         MVI   176(R4),9                                                00000850
         LA    R9,76(,R8)                                               00000860
         STCM  R9,7,177(R4)                                             00000870
         STH   R12,180(,R4)                                             00000880
         OI    180(R4),32                                               00000890
         STH   R5,182(,R4)                                              00000900
         B     A000208                                                  00000910
A00014C  SLR   R12,R12                                                  00000920
         SPKA  0(R12)                                                   00000930
         L     R12,292(,R8)                                             00000940
         L     R12,24(,R12)                                             00000950
         MVC   8(4,R12),A0006A0                                         00000960
         MVC   12(4,R12),A0006A0                                        00000970
         MVC   16(4,R12),A0006A0                                        00000980
         MVC   20(4,R12),A0006A0                                        00000990
         MVC   24(4,R12),A0006A0                                        00001000
         MVC   28(4,R12),A0006A0                                        00001010
         MVI   4(R12),130                                               00001020
         LA    R12,2                                                    00001030
         STC   R12,236(,R8)                                             00001040
A00018A  SLR   R12,R12                                                  00001050
         IC    R12,236(,R8)                                             00001060
         L     R9,292(,R8)                                              00001070
         L     R9,24(,R9)                                               00001080
         SLR   R7,R7                                                    00001090
         STC   R7,3(R12,R9)                                             00001100
         LA    R12,1                                                    00001110
         SLR   R9,R9                                                    00001120
         IC    R9,236(,R8)                                              00001130
         ALR   R12,R9                                                   00001140
         STC   R12,236(,R8)                                             00001150
         C     R12,A000674                                              00001160
         BNH   A00018A                                                  00001170
         L     R12,292(,R8)                                             00001180
         L     R12,24(,R12)                                             00001190
         NI    2(R12),240                                               00001200
         SLR   R12,R12                                                  00001210
         IC    R12,12(,R6)                                              00001220
         SPKA  0(R12)                                                   00001230
         MVC   160(8,R4),A0006A4                                        00001240
         MVI   168(R4),55                                               00001250
         SLR   R12,R12                                                  00001260
         STH   R12,172(,R4)                                             00001270
         OI    172(R4),96                                               00001280
         MVC   174(2,R4),A000668+2                                      00001290
         MVI   176(R4),9                                                00001300
         LA    R9,76(,R8)                                               00001310
         STCM  R9,7,177(R4)                                             00001320
         STH   R12,180(,R4)                                             00001330
         OI    180(R4),96                                               00001340
         STH   R5,182(,R4)                                              00001350
         MVC   184(8,R4),A0006A4                                        00001360
         NI    188(R4),191                                              00001370
A000208  L     R1,220(,R8)                                              00001380
         LR    R1,R1                                                    00001390
         SVC   0                                                        00001400
         L     R12,220(,R8)                                             00001410
         L     R1,4(,R12)                                               00001420
         LA    R1,0(,R1)                                                00001430
         LA    R1,0(,R1)                                                00001440
         LA    R0,1                                                     00001450
         SVC   1                                                        00001460
         LA    R12,80                                                   00001470
         SPKA  0(R12)                                                   00001480
         B     A000268                                                  00001490
A000232  LA    R12,4                                                    00001500
         LA    R9,76(,R8)                                               00001510
         LR    R7,R9                                                    00001520
         SLR   R7,R12                                                   00001530
         ALR   R12,R5                                                   00001540
         STH   R12,0(,R7)                                               00001550
         LA    R12,2                                                    00001560
         SLR   R9,R12                                                   00001570
         MVC   0(2,R9),A0006AC                                          00001580
         LA    R9,76(R5,R8)                                             00001590
         SLR   R2,R2                                                    00001600
         STCM  R2,3,0(R9)                                               00001610
         ALR   R9,R12                                                   00001620
         MVC   0(2,R9),A0006AE                                          00001630
         LR    R1,R7                                                    00001640
         LR    R1,R1                                                    00001650
         SVC   35                                                       00001660
A000268  SLR   R12,R12                                                  00001670
         IC    R12,12(,R6)                                              00001680
         SPKA  0(R12)                                                   00001690
         L     R9,280(,R8)                                              00001700
         TM    44(R9),2                                                 00001710
         BNO   A000316                                                  00001720
         LA    R9,80                                                    00001730
         SPKA  0(R9)                                                    00001740
         MVI   68(R8),22                                                00001750
         MVI   69(R8),1                                                 00001760
         MVI   70(R8),48                                                00001770
         MVI   71(R8),4                                                 00001780
         MVI   72(R8),53                                                00001790
         SLR   R7,R7                                                    00001800
         ST    R7,216(,R8)                                              00001810
         MVI   219(R8),72                                               00001820
         ST    R7,212(,R8)                                              00001830
         SPKA  0(R12)                                                   00001840
         L     R12,220(,R8)                                             00001850
         L     R12,8(,R12)                                              00001860
         LA    R12,0(,R12)                                              00001870
         LTR   R12,R12                                                  00001880
         BE    A0002D0                                                  00001890
         AL    R12,A00068C                                              00001900
         SLR   R0,R0                                                    00001910
         IC    R0,0(,R12)                                               00001920
         SPKA  0(R9)                                                    00001930
         STC   R0,212(,R8)                                              00001940
A0002D0  SLR   R12,R12                                                  00001950
         IC    R12,12(,R6)                                              00001960
         SPKA  0(R12)                                                   00001970
         L     R12,220(,R8)                                             00001980
         TM    3(R12),16                                                00001990
         BNO   A0002FA                                                  00002000
         LA    R12,80                                                   00002010
         SPKA  0(R12)                                                   00002020
         MVI   215(R8),8                                                00002030
         MVI   73(R8),29                                                00002040
         B     A00030A                                                  00002050
A0002FA  LA    R12,80                                                   00002060
         SPKA  0(R12)                                                   00002070
         MVI   215(R8),4                                                00002080
         MVI   73(R8),55                                                00002090
A00030A  MVI   74(R8),0                                                 00002100
         BAL   R14,A000410                                              00002110
         B     A00031E                                                  00002120
A000316  LA    R12,80                                                   00002130
         SPKA  0(R12)                                                   00002140
A00031E  LA    R12,456                                                  00002150
         ALR   R12,R8                                                   00002160
         TM    10(R12),1                                                00002170
         BNO   A00040A                                                  00002180
         LA    R9,48(,R12)                                              00002190
         AL    R9,A000674                                               00002200
         SLR   R9,R12                                                   00002210
         CH    R9,20(,R12)                                              00002220
         BH    A00040A                                                  00002230
         SLR   R9,R9                                                    00002240
         C     R9,48(,R12)                                              00002250
         BE    A00040A                                                  00002260
         STM   R11,R14,316(R8)                                          00002270
         SPKA  0(R9)                                                    00002280
         L     R13,764                                                  00002290
         LM    R11,R13,576(R13)                                         00002300
         BALR  R14,R13                                                  00002310
         SLR   R15,R15                                                  00002320
         IC    R15,12(,R6)                                              00002330
         SPKA  0(R15)                                                   00002340
         L     R15,504(,R8)                                             00002350
         LH    R10,0(,R15)                                              00002360
         N     R10,A000690                                              00002370
         STH   R10,0(,R15)                                              00002380
         LA    R9,0(R10,R15)                                            00002390
         BCTR  R9,0                                                     00002400
         SLR   R11,R11                                                  00002410
         IC    R11,0(,R9)                                               00002420
         BCTR  R10,0                                                    00002430
         STC   R11,0(R10,R15)                                           00002440
         LA    R10,4(,R15)                                              00002450
         AL    R10,A00066C                                              00002460
         SLR   R10,R15                                                  00002470
         LH    R9,0(,R15)                                               00002480
         N     R9,A000690                                               00002490
         CR    R10,R9                                                   00002500
         BH    A0003A4                                                  00002510
         SLR   R10,R10                                                  00002520
         STH   R10,4(,R15)                                              00002530
A0003A4  L     R15,504(,R8)                                             00002540
         LH    R10,0(,R15)                                              00002550
         N     R10,A000690                                              00002560
         LA    R9,6(,R15)                                               00002570
         AL    R9,A00066C                                               00002580
         SLR   R9,R15                                                   00002590
         CR    R10,R9                                                   00002600
         BL    A0003D4                                                  00002610
         LA    R9,10(,R15)                                              00002620
         SLR   R10,R9                                                   00002630
         ALR   R10,R15                                                  00002640
         CLR   R10,R5                                                   00002650
         BNH   A0003D0                                                  00002660
         LR    R10,R5                                                   00002670
A0003D0  STH   R10,6(,R15)                                              00002680
A0003D4  SLR   R15,R15                                                  00002690
         L     R10,504(,R8)                                             00002700
         LH    R9,6(,R10)                                               00002710
         CR    R9,R15                                                   00002720
         BNH   A0003EE                                                  00002730
         STH   R15,8(,R10)                                              00002740
         BCTR  R9,0                                                     00002750
         EX    R9,X000658                                               00002760
A0003EE  SLR   R15,R15                                                  00002770
         SPKA  0(R15)                                                   00002780
         L     R13,764                                                  00002790
         LM    R11,R13,588(R13)                                         00002800
         BALR  R14,R13                                                  00002810
         LA    R15,80                                                   00002820
         SPKA  0(R15)                                                   00002830
         LM    R11,R14,316(R8)                                          00002840
A00040A  LM    R14,R12,12(R13)                                          00002850
         BR    R14                                                      00002860
A000410  MVI   76(R8),64                                                00002870
         MVC   77(99,R8),76(R8)                                         00002880
         LA    R15,1                                                    00002890
         LR    R5,R15                                                   00002900
         LR    R7,R15                                                   00002910
A000422  SLR   R15,R15                                                  00002920
         IC    R15,67(R7,R8)                                            00002930
         C     R15,A000664                                              00002940
         BE    A00064C                                                  00002950
         LA    R15,A0006F2                                              00002960
         LA    R12,67(R7,R8)                                            00002970
         SLR   R9,R9                                                    00002980
         IC    R9,0(,R12)                                               00002990
         BCTR  R9,0                                                     00003000
         ALR   R9,R9                                                    00003010
         ALR   R15,R9                                                   00003020
         TM    0(R15),128                                               00003030
         BNO   A000462                                                  00003040
         LR    R15,R8                                                   00003050
         ALR   R15,R5                                                   00003060
         L     R12,292(,R8)                                             00003070
         MVC   75(3,R15),13(R12)                                        00003080
         AL    R5,A000674                                               00003090
         B     A000640                                                  00003100
A000462  LA    R15,A0006F2                                              00003110
         LA    R12,67(R7,R8)                                            00003120
         SLR   R9,R9                                                    00003130
         IC    R9,0(,R12)                                               00003140
         BCTR  R9,0                                                     00003150
         ALR   R9,R9                                                    00003160
         ALR   R15,R9                                                   00003170
         TM    0(R15),64                                                00003180
         BNO   A000490                                                  00003190
         LR    R15,R8                                                   00003200
         ALR   R15,R5                                                   00003210
         MVC   75(4,R15),8(R8)                                          00003220
         AL    R5,A000678                                               00003230
         B     A000640                                                  00003240
A000490  LA    R15,A0006F2                                              00003250
         LA    R12,67(R7,R8)                                            00003260
         SLR   R9,R9                                                    00003270
         IC    R9,0(,R12)                                               00003280
         BCTR  R9,0                                                     00003290
         ALR   R9,R9                                                    00003300
         ALR   R15,R9                                                   00003310
         TM    0(R15),32                                                00003320
         BNO   A00051A                                                  00003330
         LA    R15,1                                                    00003340
         B     A000506                                                  00003350
A0004B4  LR    R15,R8                                                   00003360
         ALR   R15,R5                                                   00003370
         SLR   R12,R12                                                  00003380
         IC    R12,234(,R8)                                             00003390
         ALR   R12,R8                                                   00003400
         UNPK  75(3,R15),247(2,R12)                                     00003410
         LR    R15,R8                                                   00003420
         ALR   R15,R5                                                   00003430
         LA    R12,A0006E2                                              00003440
         AL    R12,A000688                                              00003450
         TR    75(2,R15),0(R12)                                         00003460
         CLC   234(1,R8),242(R8)                                        00003470
         BNE   A0004EE                                                  00003480
         LR    R15,R8                                                   00003490
         ALR   R15,R5                                                   00003500
         MVI   77(R15),64                                               00003510
         B     A0004F6                                                  00003520
A0004EE  LR    R15,R8                                                   00003530
         ALR   R15,R5                                                   00003540
         MVI   77(R15),96                                               00003550
A0004F6  AL    R5,A000670                                               00003560
         LA    R15,1                                                    00003570
         SLR   R12,R12                                                  00003580
         IC    R12,234(,R8)                                             00003590
         ALR   R15,R12                                                  00003600
A000506  STC   R15,234(,R8)                                             00003610
         SLR   R12,R12                                                  00003620
         IC    R12,242(,R8)                                             00003630
         CR    R15,R12                                                  00003640
         BNH   A0004B4                                                  00003650
         B     A000640                                                  00003660
A00051A  LA    R15,A0006F2                                              00003670
         LA    R12,67(R7,R8)                                            00003680
         SLR   R9,R9                                                    00003690
         IC    R9,0(,R12)                                               00003700
         BCTR  R9,0                                                     00003710
         ALR   R9,R9                                                    00003720
         ALR   R15,R9                                                   00003730
         TM    0(R15),16                                                00003740
         BNO   A00057E                                                  00003750
         BCTR  R5,0                                                     00003760
         L     R15,292(,R8)                                             00003770
         L     R15,24(,R15)                                             00003780
         LH    R15,32(,R15)                                             00003790
         N     R15,A000690                                              00003800
         CVD   R15,520(,R8)                                             00003810
         LR    R15,R8                                                   00003820
         ALR   R15,R5                                                   00003830
         MVC   75(3,R15),525(R8)                                        00003840
         LR    R15,R8                                                   00003850
         ALR   R15,R5                                                   00003860
         LR    R12,R8                                                   00003870
         ALR   R12,R5                                                   00003880
         UNPK  75(7,R15),75(4,R12)                                      00003890
         LR    R15,R8                                                   00003900
         ALR   R15,R5                                                   00003910
         MVI   75(R15),64                                               00003920
         LR    R15,R8                                                   00003930
         ALR   R15,R5                                                   00003940
         MVC   80(2,R15),A0006A0                                        00003950
         AL    R5,A00067C                                               00003960
         B     A000640                                                  00003970
A00057E  LA    R15,A0006F2                                              00003980
         LA    R12,67(R7,R8)                                            00003990
         SLR   R9,R9                                                    00004000
         IC    R9,0(,R12)                                               00004010
         BCTR  R9,0                                                     00004020
         ALR   R9,R9                                                    00004030
         ALR   R15,R9                                                   00004040
         TM    0(R15),8                                                 00004050
         BNO   A0005AC                                                  00004060
         LR    R15,R8                                                   00004070
         ALR   R15,R5                                                   00004080
         MVC   75(8,R15),4(R8)                                          00004090
         AL    R5,A000680                                               00004100
         B     A000640                                                  00004110
A0005AC  LA    R15,A0006F2                                              00004120
         LA    R12,67(R7,R8)                                            00004130
         SLR   R9,R9                                                    00004140
         IC    R9,0(,R12)                                               00004150
         BCTR  R9,0                                                     00004160
         ALR   R9,R9                                                    00004170
         ALR   R15,R9                                                   00004180
         TM    0(R15),4                                                 00004190
         BNO   A0005F4                                                  00004200
         LR    R15,R8                                                   00004210
         ALR   R15,R5                                                   00004220
         UNPK  75(9,R15),212(5,R8)                                      00004230
         LR    R15,R8                                                   00004240
         ALR   R15,R5                                                   00004250
         LA    R12,A0006E2                                              00004260
         AL    R12,A000688                                              00004270
         TR    75(8,R15),0(R12)                                         00004280
         LR    R15,R8                                                   00004290
         ALR   R15,R5                                                   00004300
         MVI   83(R15),64                                               00004310
         AL    R5,A000684                                               00004320
         B     A000640                                                  00004330
A0005F4  LA    R15,A0006F2                                              00004340
         LA    R12,67(R7,R8)                                            00004350
         SLR   R9,R9                                                    00004360
         IC    R9,0(,R12)                                               00004370
         BCTR  R9,0                                                     00004380
         ALR   R9,R9                                                    00004390
         ALR   R15,R9                                                   00004400
         TM    0(R15),1                                                 00004410
         BNO   A000640                                                  00004420
         LR    R12,R8                                                   00004430
         ALR   R12,R5                                                   00004440
         L     R9,0(,R6)                                                00004450
         SLR   R2,R2                                                    00004460
         IC    R2,1(,R15)                                               00004470
         ALR   R2,R2                                                    00004480
         LH    R15,2(R2,R9)                                             00004490
         ALR   R15,R9                                                   00004500
         SLR   R2,R2                                                    00004510
         IC    R2,1(,R15)                                               00004520
         SLR   R11,R11                                                  00004530
         IC    R11,0(,R15)                                              00004540
         ALR   R11,R15                                                  00004550
         EX    R2,X00065E                                               00004560
         ALR   R2,R5                                                    00004570
         AL    R2,A00066C                                               00004580
         LR    R5,R2                                                    00004590
A000640  AL    R7,A000668                                               00004600
         CL    R7,A000680                                               00004610
         BNH   A000422                                                  00004620
A00064C  BCTR  R5,0                                                     00004630
         LR    R15,R8                                                   00004640
         ALR   R15,R5                                                   00004650
         MVI   75(R15),75                                               00004660
         BR    R14                                                      00004670
X000658  MVC   10(1,R10),76(R8)                                         00004680
X00065E  MVC   75(1,R12),0(R11)                                         00004690
A000664  DC    F'0'                                                     00004700
A000668  EQU *,4                                                        00004710
         DC    H'0'                                                     00004720
A00066A  DC    H'0001'                                                  00004730
A00066C  EQU *,4                                                        00004740
         DC    H'0'                                                     00004750
A00066E  DC    H'0002'                                                  00004760
A000670  DC    F'00003'                                                 00004770
A000674  DC    F'00004'                                                 00004780
A000678  DC    F'00005'                                                 00004790
A00067C  DC    F'00006'                                                 00004800
A000680  DC    F'00008'                                                 00004810
A000684  DC    F'00009'                                                 00004820
A000688  DC    XL4'FFFFFF10'                                            00004830
A00068C  DC    XL4'FFFFFFF8'                                            00004840
A000690  DC    F'65535'                                                 00004850
         DC    H'1792'                                                  00004860
         DC    CL2'CE'                                                  00004870
         DC    F'00008'                                                 00004880
         DC    H'0518'                                                  00004890
         DC    CL2'IE'                                                  00004900
A0006A0  DC    CL4'    '                                                00004910
A0006A4  EQU *,8                                                        00004920
         DC    CL1'g'                                                   00004930
         DC    XL1'00'                                                  00004940
         DC    H'0'                                                     00004950
         DC    CL1'-'                                                   00004960
         DC    XL1'00'                                                  00004970
         DC    H'0001'                                                  00004980
A0006AC  DC    XL2'8000'                                                00004990
A0006AE  DC    H'0032'                                                  00005000
         DC    CL32'PATCHPATCHPATCHPATCHPATCHPATCHPA'                   00005010
         DC    CL18'TCHPATCHPATCHPATCH'                                 00005020
A0006E2  DC    CL4'0123'                                                00005030
         DC    CL12'456789ABCDEF'                                       00005040
A0006F2  EQU *,4                                                        00005050
         DC    XL2'8000'                                                00005060
         DC    CL1' '                                                   00005070
         DC    XL1'00'                                                  00005080
         DC    H'8192'                                                  00005090
         DC    XL4'10000800'                                            00005100
         DC    XL4'04000120'                                            00005110
         DC    XL4'01210122'                                            00005120
         DC    XL4'01230124'                                            00005130
         DC    XL4'01250126'                                            00005140
         DC    XL4'01270128'                                            00005150
         DC    XL4'0129012A'                                            00005160
         DC    XL4'012B012C'                                            00005170
         DC    XL4'012D012E'                                            00005180
         DC    XL4'012F0130'                                            00005190
         DC    XL4'01310132'                                            00005200
         DC    XL4'01330134'                                            00005210
         DC    XL4'01350136'                                            00005220
         DC    XL4'01370138'                                            00005230
         DC    XL4'0139013A'                                            00005240
         DC    XL4'013B013C'                                            00005250
         DC    XL4'013D013E'                                            00005260
         DC    XL3'013F01'                                              00005270
         DC    CL1' '                                                   00005280
         DC    XL4'01410142'                                            00005290
         DC    XL4'01430144'                                            00005300
         DC    XL4'01450146'                                            00005310
         DC    XL4'01470148'                                            00005320
         DC    XL4'0149014A'                                            00005330
         DC    XL1'01'                                                  00005340
         DC    CL1'.'                                                   00005350
         DC    XL1'01'                                                  00005360
         DC    CL1'<'                                                   00005370
         DC    XL1'01'                                                  00005380
         DC    CL1'('                                                   00005390
         DC    XL1'01'                                                  00005400
         DC    CL1'+'                                                   00005410
         DC    XL3'014F01'                                              00005420
         DC    CL1'&&'                                                  00005430
         DC    XL4'01510152'                                            00005440
         DC    XL4'01530154'                                            00005450
         DC    XL4'01550156'                                            00005460
         DC    XL4'01570158'                                            00005470
         DC    XL3'015901'                                              00005480
         DC    CL1'!'                                                   00005490
         DC    XL1'01'                                                  00005500
         DC    CL1'$'                                                   00005510
         DC    XL1'01'                                                  00005520
         DC    CL1'*'                                                   00005530
         DC    XL1'01'                                                  00005540
         DC    CL1')'                                                   00005550
         DC    XL1'01'                                                  00005560
         DC    CL1';'                                                   00005570
         DC    XL1'01'                                                  00005580
         DC    CL1'¬'                                                   00005590
         DC    XL1'01'                                                  00005600
         DC    CL1'-'                                                   00005610
         DC    XL1'01'                                                  00005620
         DC    CL1'/'                                                   00005630
         DC    H'0354'                                                  00005640
         DC    XL4'01630164'                                            00005650
A000788  EQU *,4                                                        00005660
         DC    H'0256'                                                  00005670
R0       EQU   0                                                        00005680
R1       EQU   1                                                        00005690
R2       EQU   2                                                        00005700
R3       EQU   3                                                        00005710
R4       EQU   4                                                        00005720
R5       EQU   5                                                        00005730
R6       EQU   6                                                        00005740
R7       EQU   7                                                        00005750
R8       EQU   8                                                        00005760
R9       EQU   9                                                        00005770
R10      EQU   10                                                       00005780
R11      EQU   11                                                       00005790
R12      EQU   12                                                       00005800
R13      EQU   13                                                       00005810
R14      EQU   14                                                       00005820
R15      EQU   15                                                       00005830
         END                                                            00005840
