*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IGGDPN   CSECT                                                          00000060
         DC    XL4'80043C3C'                                            00000070
         DC    XL2'3C3C'                                                00000080
         DC    CL18'1234567890XY/STUVW'                                 00000090
         DC    XL1'4F'                                                  00000100
         DC    CL32':_",=JKLMNOPQR-Z(ABCDEFGHI+.)%$*'                   00000110
         DC    CL27'#&&@<;¬''?>1234567890XY/STUVW'                      00000120
         DC    XL1'4F'                                                  00000130
         DC    CL32':_",=JKLMNOPQR-Z(ABCDEFGHI+.)%$*'                   00000140
         DC    CL27'#&&@<;¬''?>1234567890XY/STUVW'                      00000150
         DC    XL1'4F'                                                  00000160
         DC    CL32':_",=JKLMNOPQR-Z(ABCDEFGHI+.)%$*'                   00000170
         DC    CL27'#&&@<;¬''?>1234567890XY/STUVW'                      00000180
         DC    XL1'4F'                                                  00000190
         DC    CL32':_",=JKLMNOPQR-Z(ABCDEFGHI+.)%$*'                   00000200
         DC    CL9'#&&@<;¬''?>'                                         00000210
         DC    XL2'C010'                                                00000220
         DC    XL4'10101010'                                            00000230
         DC    XL4'10101010'                                            00000240
         DC    XL1'00'                                                  00000250
         DC    CL6'      '                                              00000260
         DC    XL1'10'                                                  00000270
         DC    XL4'10101010'                                            00000280
         DC    XL4'10101010'                                            00000290
         DC    XL1'00'                                                  00000300
         DC    CL7'       '                                             00000310
         DC    XL4'10101010'                                            00000320
         DC    XL4'10101010'                                            00000330
         DC    XL1'00'                                                  00000340
         DC    CL5'     '                                               00000350
         DC    H'4112'                                                  00000360
         DC    XL4'10101010'                                            00000370
         DC    XL4'10101010'                                            00000380
         DC    CL6'      '                                              00000390
IGGNPN   CSECT                                                          00000400
         DC    XL4'00043C3C'                                            00000410
         DC    XL2'3C3C'                                                00000420
         DC    CL18'1234567890XY/STUVW'                                 00000430
         DC    XL1'4F'                                                  00000440
         DC    CL32':_",=JKLMNOPQR-Z(ABCDEFGHI+.)%$*'                   00000450
         DC    CL27'#&&@<;¬''?>1234567890XY/STUVW'                      00000460
         DC    XL1'4F'                                                  00000470
         DC    CL32':_",=JKLMNOPQR-Z(ABCDEFGHI+.)%$*'                   00000480
         DC    CL27'#&&@<;¬''?>1234567890XY/STUVW'                      00000490
         DC    XL1'4F'                                                  00000500
         DC    CL32':_",=JKLMNOPQR-Z(ABCDEFGHI+.)%$*'                   00000510
         DC    CL27'#&&@<;¬''?>1234567890XY/STUVW'                      00000520
         DC    XL1'4F'                                                  00000530
         DC    CL32':_",=JKLMNOPQR-Z(ABCDEFGHI+.)%$*'                   00000540
         DC    CL9'#&&@<;¬''?>'                                         00000550
         DC    XL2'C010'                                                00000560
         DC    XL4'10101010'                                            00000570
         DC    XL4'10101010'                                            00000580
         DC    XL1'00'                                                  00000590
         DC    CL6'      '                                              00000600
         DC    XL1'10'                                                  00000610
         DC    XL4'10101010'                                            00000620
         DC    XL4'10101010'                                            00000630
         DC    XL1'00'                                                  00000640
         DC    CL7'       '                                             00000650
         DC    XL4'10101010'                                            00000660
         DC    XL4'10101010'                                            00000670
         DC    XL1'00'                                                  00000680
         DC    CL5'     '                                               00000690
         DC    H'4112'                                                  00000700
         DC    XL4'10101010'                                            00000710
         DC    XL4'10101010'                                            00000720
         DC    CL6'      '                                              00000730
         END                                                            00000740
