*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IGGDTN   CSECT                                                          00000060
         DC    XL4'80043C3C'                                            00000070
         DC    XL2'3C3C'                                                00000080
         DC    CL32'1234567890=./STUVWXYZ,#&&JKLMNOPQ'                  00000090
         DC    CL32'R-":ABCDEFGHI+abcdefghijklmnopqr'                   00000100
         DC    CL12'stuvwxyz@''?;'                                      00000110
         DC    XL1'9E'                                                  00000120
         DC    CL4'!$*%'                                                00000130
         DC    XL1'9C'                                                  00000140
         DC    XL4'B1B2B3B4'                                            00000150
         DC    XL4'B5B6B7B8'                                            00000160
         DC    XL4'B9B0A08E'                                            00000170
         DC    XL3'8D9DA1'                                              00000180
         DC    CL3'¬()'                                                 00000190
         DC    XL2'BE8F'                                                00000200
         DC    CL2'><'                                                  00000210
         DC    XL2'8CAE'                                                00000220
         DC    XL4'4A9FADBD'                                            00000230
         DC    XL4'9B8BABBB'                                            00000240
         DC    XL3'ACBCAF'                                              00000250
         DC    CL1'_'                                                   00000260
         DC    XL2'BF4F'                                                00000270
         DC    CL32'1234567890=./STUVWXYZ,#&&JKLMNOPQ'                  00000280
         DC    CL32'R-":ABCDEFGHI+abcdefghijklmnopqr'                   00000290
         DC    CL12'stuvwxyz@''?;'                                      00000300
         DC    XL1'9E'                                                  00000310
         DC    CL4'!$*%'                                                00000320
         DC    XL1'9C'                                                  00000330
         DC    XL4'B1B2B3B4'                                            00000340
         DC    XL4'B5B6B7B8'                                            00000350
         DC    XL4'B9B0A08E'                                            00000360
         DC    XL3'8D9DA1'                                              00000370
         DC    CL3'¬()'                                                 00000380
         DC    XL2'BE8F'                                                00000390
         DC    CL2'><'                                                  00000400
         DC    XL2'8CAE'                                                00000410
         DC    XL4'4A9FADBD'                                            00000420
         DC    XL4'9B8BABBB'                                            00000430
         DC    XL3'ACBCAF'                                              00000440
         DC    CL1'_'                                                   00000450
         DC    XL4'BF4FC030'                                            00000460
         DC    XL4'30303030'                                            00000470
         DC    XL4'30303030'                                            00000480
         DC    CL7' ----- '                                             00000490
         DC    XL1'30'                                                  00000500
         DC    XL4'30303030'                                            00000510
         DC    XL4'30303030'                                            00000520
         DC    CL8' -------'                                            00000530
         DC    XL4'30303030'                                            00000540
         DC    XL4'30303030'                                            00000550
         DC    XL1'00'                                                  00000560
         DC    CL5'-----'                                               00000570
         DC    XL2'3030'                                                00000580
         DC    XL4'30303030'                                            00000590
         DC    XL4'30303030'                                            00000600
         DC    CL6' -----'                                              00000610
IGGNTN   CSECT                                                          00000620
         DC    XL4'00043C3C'                                            00000630
         DC    XL2'3C3C'                                                00000640
         DC    CL32'1234567890=./STUVWXYZ,#&&JKLMNOPQ'                  00000650
         DC    CL32'R-":ABCDEFGHI+abcdefghijklmnopqr'                   00000660
         DC    CL12'stuvwxyz@''?;'                                      00000670
         DC    XL1'9E'                                                  00000680
         DC    CL4'!$*%'                                                00000690
         DC    XL1'9C'                                                  00000700
         DC    XL4'B1B2B3B4'                                            00000710
         DC    XL4'B5B6B7B8'                                            00000720
         DC    XL4'B9B0A08E'                                            00000730
         DC    XL3'8D9DA1'                                              00000740
         DC    CL3'¬()'                                                 00000750
         DC    XL2'BE8F'                                                00000760
         DC    CL2'><'                                                  00000770
         DC    XL2'8CAE'                                                00000780
         DC    XL4'4A9FADBD'                                            00000790
         DC    XL4'9B8BABBB'                                            00000800
         DC    XL3'ACBCAF'                                              00000810
         DC    CL1'_'                                                   00000820
         DC    XL2'BF4F'                                                00000830
         DC    CL32'1234567890=./STUVWXYZ,#&&JKLMNOPQ'                  00000840
         DC    CL32'R-":ABCDEFGHI+abcdefghijklmnopqr'                   00000850
         DC    CL12'stuvwxyz@''?;'                                      00000860
         DC    XL1'9E'                                                  00000870
         DC    CL4'!$*%'                                                00000880
         DC    XL1'9C'                                                  00000890
         DC    XL4'B1B2B3B4'                                            00000900
         DC    XL4'B5B6B7B8'                                            00000910
         DC    XL4'B9B0A08E'                                            00000920
         DC    XL3'8D9DA1'                                              00000930
         DC    CL3'¬()'                                                 00000940
         DC    XL2'BE8F'                                                00000950
         DC    CL2'><'                                                  00000960
         DC    XL2'8CAE'                                                00000970
         DC    XL4'4A9FADBD'                                            00000980
         DC    XL4'9B8BABBB'                                            00000990
         DC    XL3'ACBCAF'                                              00001000
         DC    CL1'_'                                                   00001010
         DC    XL4'BF4FC030'                                            00001020
         DC    XL4'30303030'                                            00001030
         DC    XL4'30303030'                                            00001040
         DC    CL7' ----- '                                             00001050
         DC    XL1'30'                                                  00001060
         DC    XL4'30303030'                                            00001070
         DC    XL4'30303030'                                            00001080
         DC    CL8' -------'                                            00001090
         DC    XL4'30303030'                                            00001100
         DC    XL4'30303030'                                            00001110
         DC    XL1'00'                                                  00001120
         DC    CL5'-----'                                               00001130
         DC    XL2'3030'                                                00001140
         DC    XL4'30303030'                                            00001150
         DC    XL4'30303030'                                            00001160
         DC    CL6' -----'                                              00001170
         END                                                            00001180
