*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IGGDQN   CSECT                                                          00000060
         DC    XL4'80053030'                                            00000070
         DC    XL3'303030'                                              00000080
         DC    CL32'1234567890XY/STUVW_"$*,=JKLMNOPQ'                   00000090
         DC    CL32'R-Z(ABCDEFGHI+.)1234567890XY/STU'                   00000100
         DC    CL32'VW<;#*,=JKLMNOPQR-Z(ABCDEFGHI+.)'                   00000110
         DC    CL32'1234567890XY/STUVW?>@*,=JKLMNOPQ'                   00000120
         DC    CL32'R-Z(ABCDEFGHI+.)1234567890XY/STU'                   00000130
         DC    CL32'VW¬''&&*,=JKLMNOPQR-Z(ABCDEFGHI+.)'                 00000140
         DC    CL18'1234567890XY/STUVW'                                 00000150
         DC    XL1'4F'                                                  00000160
         DC    CL29':%*,=JKLMNOPQR-Z(ABCDEFGHI+.)'                      00000170
         DC    XL1'C0'                                                  00000180
         DC    XL4'10101010'                                            00000190
         DC    XL4'10101010'                                            00000200
         DC    H'4096'                                                  00000210
         DC    CL6'      '                                              00000220
         DC    XL4'10101010'                                            00000230
         DC    XL4'10101010'                                            00000240
         DC    H'4096'                                                  00000250
         DC    CL7'       '                                             00000260
         DC    XL1'10'                                                  00000270
         DC    H'4112'                                                  00000280
         DC    XL4'10101010'                                            00000290
         DC    H'4096'                                                  00000300
         DC    CL5'     '                                               00000310
         DC    XL1'10'                                                  00000320
         DC    XL4'10101010'                                            00000330
         DC    XL4'10101010'                                            00000340
         DC    XL1'10'                                                  00000350
         DC    CL6'      '                                              00000360
IGGNQN   CSECT                                                          00000370
         DC    XL4'00053030'                                            00000380
         DC    XL3'303030'                                              00000390
         DC    CL32'1234567890XY/STUVW_"$*,=JKLMNOPQ'                   00000400
         DC    CL32'R-Z(ABCDEFGHI+.)1234567890XY/STU'                   00000410
         DC    CL32'VW<;#*,=JKLMNOPQR-Z(ABCDEFGHI+.)'                   00000420
         DC    CL32'1234567890XY/STUVW?>@*,=JKLMNOPQ'                   00000430
         DC    CL32'R-Z(ABCDEFGHI+.)1234567890XY/STU'                   00000440
         DC    CL32'VW¬''&&*,=JKLMNOPQR-Z(ABCDEFGHI+.)'                 00000450
         DC    CL18'1234567890XY/STUVW'                                 00000460
         DC    XL1'4F'                                                  00000470
         DC    CL29':%*,=JKLMNOPQR-Z(ABCDEFGHI+.)'                      00000480
         DC    XL1'C0'                                                  00000490
         DC    XL4'10101010'                                            00000500
         DC    XL4'10101010'                                            00000510
         DC    H'4096'                                                  00000520
         DC    CL6'      '                                              00000530
         DC    XL4'10101010'                                            00000540
         DC    XL4'10101010'                                            00000550
         DC    H'4096'                                                  00000560
         DC    CL7'       '                                             00000570
         DC    XL1'10'                                                  00000580
         DC    H'4112'                                                  00000590
         DC    XL4'10101010'                                            00000600
         DC    H'4096'                                                  00000610
         DC    CL5'     '                                               00000620
         DC    XL1'10'                                                  00000630
         DC    XL4'10101010'                                            00000640
         DC    XL4'10101010'                                            00000650
         DC    XL1'10'                                                  00000660
         DC    CL6'      '                                              00000670
         END                                                            00000680
