*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IGGDQNC  CSECT                                                          00000060
         DC    XL4'80053030'                                            00000070
         DC    XL3'303030'                                              00000080
         DC    CL32'1234567890#@/STUVWXYZ&&.%JKLMNOPQ'                  00000090
         DC    CL32'R-$*ABCDEFGHI",=1234567890#@/STU'                   00000100
         DC    CL29'VWXYZ&&.%JKLMNOPQR-$*ABCDEFGHI'                     00000110
         DC    XL1'4F'                                                  00000120
         DC    CL32':_1234567890#@/STUVWXYZ&&.%JKLMNO'                  00000130
         DC    CL32'PQR-$*ABCDEFGHI<;¬1234567890#@/S'                   00000140
         DC    CL32'TUVWXYZ&&.%JKLMNOPQR-$*ABCDEFGHI'''                 00000150
         DC    CL32'?>1234567890#@/STUVWXYZ&&.%JKLMNO'                  00000160
         DC    CL18'PQR-$*ABCDEFGHI)+('                                 00000170
         DC    XL1'C0'                                                  00000180
         DC    XL4'10101010'                                            00000190
         DC    XL4'10101010'                                            00000200
         DC    H'4096'                                                  00000210
         DC    CL6'      '                                              00000220
         DC    XL4'10101010'                                            00000230
         DC    XL4'10101010'                                            00000240
         DC    H'4096'                                                  00000250
         DC    CL7'       '                                             00000260
         DC    XL1'10'                                                  00000270
         DC    H'4112'                                                  00000280
         DC    XL4'10101010'                                            00000290
         DC    H'4096'                                                  00000300
         DC    CL5'     '                                               00000310
         DC    XL1'10'                                                  00000320
         DC    XL4'10101010'                                            00000330
         DC    XL4'10101010'                                            00000340
         DC    XL1'10'                                                  00000350
         DC    CL6'      '                                              00000360
IGGNQNC  CSECT                                                          00000370
         DC    XL4'00053030'                                            00000380
         DC    XL3'303030'                                              00000390
         DC    CL32'1234567890#@/STUVWXYZ&&.%JKLMNOPQ'                  00000400
         DC    CL32'R-$*ABCDEFGHI",=1234567890#@/STU'                   00000410
         DC    CL29'VWXYZ&&.%JKLMNOPQR-$*ABCDEFGHI'                     00000420
         DC    XL1'4F'                                                  00000430
         DC    CL32':_1234567890#@/STUVWXYZ&&.%JKLMNO'                  00000440
         DC    CL32'PQR-$*ABCDEFGHI<;¬1234567890#@/S'                   00000450
         DC    CL32'TUVWXYZ&&.%JKLMNOPQR-$*ABCDEFGHI'''                 00000460
         DC    CL32'?>1234567890#@/STUVWXYZ&&.%JKLMNO'                  00000470
         DC    CL18'PQR-$*ABCDEFGHI)+('                                 00000480
         DC    XL1'C0'                                                  00000490
         DC    XL4'10101010'                                            00000500
         DC    XL4'10101010'                                            00000510
         DC    H'4096'                                                  00000520
         DC    CL6'      '                                              00000530
         DC    XL4'10101010'                                            00000540
         DC    XL4'10101010'                                            00000550
         DC    H'4096'                                                  00000560
         DC    CL7'       '                                             00000570
         DC    XL1'10'                                                  00000580
         DC    H'4112'                                                  00000590
         DC    XL4'10101010'                                            00000600
         DC    H'4096'                                                  00000610
         DC    CL5'     '                                               00000620
         DC    XL1'10'                                                  00000630
         DC    XL4'10101010'                                            00000640
         DC    XL4'10101010'                                            00000650
         DC    XL1'10'                                                  00000660
         DC    CL6'      '                                              00000670
         END                                                            00000680
