         MACRO
 IEFAJCTZ
.* 7/6/2003 THIS IS A COPY OF IEFAJCTB WITH 3 CHANGES.
.*          THIS MACRO IS FOR THE JES2 MAX CC MOD CHANGES TO HAPSSSSM
.* CHANGE = M2344,M0697,Y01029,Y02028,M0752,Y02670,Y02668,Y02641,
.*          Y01012,Z40RPTH,Z40RPSM,@ZA44001,@Z52459            @ZA52459
.*
***************************************************************
*                                                             *
* ADD LABEL IEFAACTB TO ASSEMBLER VERSION FOR ADDRESSABILITY  *@ZA44001
* TO THE ACT                                                  *@ZA44001
*  SMB DELETION OF FIELDS                            YOLD001 11/17/71
* ADD LABEL ACTACCNT TO ASSEMBLER VERSION                      @ZA52459
*                                                             *
***************************************************************
* MACMEAN JCT MEANS JOB CONTROL TABLE
* MACCOMP Y-2 SC1B9/PZD83                                      @ZA04561
* MACCOMP Y-2 SCIB9/PZD83                                      @Z40RPTH
* MACSTAT Y-2 75239/Z40RPSM                                    @Z40RPSM
***********************************************************************
**                                                                   **
**                       JOB CONTROL TABLE                           **
**                                                                   **
***********************************************************************
 DS 0D
INJMJCT  EQU   *
JCTDSKAD DS    CL3                      DISK ADDRESS OF THIS JCT
JCTIDENT DS    CL1                      JCT ID = 0
*JCTID EQU 0  (ORIGINAL)
ZJCTID EQU 0  (WAS JCTID IN ORIGINAL CHANGED FOR SYZYGY1)
JCTJSRNO DS    CL1                      INTERNAL JOB SERIAL NUMBER
JCTJBLBS DS    0C                       JOBLIB SWITCH  BITS 0-3
JCTJSTAT DS    1C                  JOB STATUS INDICATORS
JCTJSTPC EQU   32 BIT-2/JOB STEP CANCELLED BY CONDITION CODES
JCTABEND EQU   8                   BIT 4 - JCT ABEND BIT           HW16
INCMSTS  EQU   4                        BIT-5/JOB FAILED BIT
*                                        BIT 5 = 1 JOB FAILED
*                                        BIT 6 = 0 GO JOB
INDMCTLG EQU   2                         BIT 6 = 1 CATALOG JOB
INCMCAT  EQU   2                        BIT-6/CATALOG BIT
INCMNSET EQU   1                        BIT7/RESERVED          @ZA04561
JCTJMGPO DS    CL1                      MESSAGE CLASS
JCTJMGLV DS    0C 4 BITS FOR MESSAGE LEVEL -SET BY IEFVJA
INCMMGL1 EQU   16                  JCL  MESSAGE LEVEL=1 BIT         I68
INCMMGL2 EQU   32                  JCL  MESSAGE LEVEL=2 BIT         I68
INCMALL  EQU   128           ALLOCATION MESSAGE LEVEL=1 BIT         I68
JCTJPRTY DS    1C                       4 BITS FOR JOB PRIORITY
*JCTJNAME DS    CL8 (ORIGINAL)          JOBNAME
ZJCTJNME DS    CL8 (WAS JCTJNAME IN ORIGINAL FOR SYZYGY1)
JCTJTPTN DS    CL8                      T/P TERMINAL NAME
JCTPDIP  DS    CL4                      PDI CORE POINTER         Y02670
JCTGDGNT DS    CL3                      GDG NAME TABLE           Y02670
JCTJCSMF DS    CL1                      JOB CLASS SPECS FOR SMF  Y02668
*                                       TERMINATION ROUTINES     Y02668
JCTSDKAD DS    CL4                      DISK ADDRESS OF FIRST SCT
JCTJCTX  DS    CL4                      ADDRESS OF JCTX        @Z40RPSM
JCTACTAD DS    CL4                      DISK ADDRESS OF FIRST ACT
JCTSMRBA DS    CL8                      RBA SYSTEM MSG D.S.      Y02641
JCTSCT   DS    CL1                      STEP NO. OF FAILING STEP Y02641
         DS    CL1                      RESERVED
JCTJDPCD DS    CL2                      DEPENDENCY CODE
JCTJDPOP DS    CL2                      DEPENDENCY OPERATOR
         DS    CL28                     ROOM FOR 7 MORE DEPS
JCTRSW1  DS    C CHECKPOINT/RESTART SWITCHES
JCTWARMS EQU   128 BIT0 - WARM START
JCTSTERM EQU   64  STEP TERMINATION HAS BEGUN (PCP WARM START ONLY)AACA
JCTCONTR EQU   32 BIT 2 - JOB IS ELIGIBLE FOR CONTINUE RESTART   Y02641
*                         PROCESSING
JCTCKFT  EQU   16 BIT  3 - CHECKPOINT TAKEN FOR THIS STEP
JCTCKPTR EQU   8 BIT   4 - CHECKPOINT RESTART (INTRA-STEP) TO BE DONE
JCTSTEPR EQU   4 BIT   5 - STEP RESTART TO BE DONE
* BITS 6AND 7 MUST BE ZERO
JCTRSW2  DS    C CHECKPOINT/RESTART SWITCHES
JCTSYSCK EQU   128 BIT 0 - SYSCHK DD STATEMENT PRESENT
JCTNARST EQU   64 BIT 1 - JOB INELIGIBLE FOR AUTOMATIC RESTART   Y02641
JCTNORST EQU   32 BIT 2 - NO RESTART TO BE DONE
JCTNOCKP EQU   16 BIT 3 - NO CHECKPOINTS TO BE TAKEN
JCTRESTT EQU   8 BIT  4 - DO RESART IF NECESSARY
JCTDSOCR EQU   4 BIT  5-  RESERVED                                M2344
JCTDSOJB EQU   2 BIT  6-  RESERVED                                M2344
***********************************************************************
*                                                                    **
*        IN ORDER TO IMPLEMENT MVT IT HAS BEEN NECESSARY TO          **
*        ADD THE FOLLOWING FIELDS TO THE JCT.  TO AVOID CAUSING      **
*        ERRORS IN THE CASE OF THE REASSEMBLING OF ALREADY EXIST-    **
*        ING MODULES WHICH REFERENCE THESE FIELDS, THEY ARE GEN-     **
*        ERATED HERE ONLY AS COMMENTS CARDS.  NOTE THAT DUE TO THE   **
*        FACT THAT THIS MACRO GENERATES THE ACT IMMEDIATELY AFTER    **
*        THE JCT, IT IS NOT POSSIBLE TO REFERENCE THESE FIELDS BY    **
*        CODING THEM AFTER THE MACRO.  FOR NOW THEY MUST BE REF-     **
*        ERENCED BY DISPLACEMENT (WHICH IS GIVEN BELOW), PREFER-     **
*        ABLY THROUGH THE USE OF EQUATES AND THE SYMBOLS BELOW.      **
*        NOTE ALSO THAT THIS MACRO IS NOT VALID FOR REFERENCING      **
*        THE ACT UNTIL THESE NEW FIELDS HAVE ACTUALLY BEEN           **
*        INCORPORATED.                                               **
*                                                                    **
***********************************************************************
*                                                                     *
*JCTDETDA DS    CL4                     TTR OF DISENQ TABLE           *
*                                       (DISPLACEMENT = 88 (DECIMAL)  *
*JCTEQREG DS    CL2                     REGION PARAMETER (BINARY)     *
*                                       (DISPLACEMENT = 92 (DECIMAL)  *
*                                                                     *
***********************************************************************
         DS    6C ROOM FOR THE ABOVE
JCTQIDNT DS    C IDENTITY OF Q FOR  JOB (MVT ONLY)
JCTSNUMB DS    C NUMBER OF STEPS RUN (MVT ONLY)
JCTSTIOT DS    F TTR OF COMPRESSED TIOT (MVT ONLY)
*                IN PCP-C/R SAVE OF SCATALLY BY IEFRAPCP           AACA
JCTDEVT  DS    F DEVICE TYPE OF CHECKPOINT DATA SET
JCTCKTTR DS    3C TTR OF JFCB FOR CHECKPOINT DATA SET
JCTNTRK  DS    C  NUMBER OF TRACKS ON SYS1.JOBQE USED BY         PTM258
*                   THE JOB -SET AND USED BY THE INIT./TERM.     PTM258
JCTNRCKP DS    H NUMBER OF CHECKPOINTS TAKEN
JCTVOLSQ DS    C VOLUME SEQUENCE NUMBER FOR CHECKPOINT DATA SET
JCTJSB   DS    C JOB STATUS SWITCHES                             Y02641
JCTJSBIN EQU 8   JOB ENTERED INTERPRETATION                      Y02641
JCTJSBAL EQU 4   JOB ENTERED ALLOCATION                          Y02641
JCTJSBEX EQU 2   JOB ENTERED EXECUTION                           Y02641
JCTJSBTM EQU 1   JOB ENTERED TERMINATION                         Y02641
JCTSSTR  DS    F TTR OF SCT FOR FIRST STEP TO BE RUN
JCTSTAT2 DS    1C                  ADDITIONAL STATUS INDICATORS    O102
JCTSPSYS EQU   128  BIT 0 - =1 INDICATES SPOOLED SYSIN FOR JOB     O102
*                             SET BY IEFVDA                        O102
*                             TESTED BY IEESD575(QUEUE ALTER)-     O102
*                             MVT AND MFT ONLY                     O102
JCTADSPC EQU   64   BIT 1 - =1 INDICATES ADDRSPC=REAL            Y01029
*                             SET BY VEA AND VJA                 Y01029
JCTENDIT EQU   32                 SET BY IEFSD41Q,IEFWEXTA       A25134
*                                 TESTED BY IEFDSOWR,IEFYNIMP    A25134
*                                 JOB TERMINATION INDICATOR      A25134
JCTSWSM  EQU   16   BIT 3 - =1 INDICATES WARM START MESSAGE       M3144
*                             'INIT=JOBNAME' IS TO BE SUPPRESSED  M3144
*                             FOR THIS JOB                        M3144
*                             SET BY IEFVHH                       M3144
*                             TESTED BY IEFSD305                  M3144
JCTPERFM EQU   8              PERFORM SPEC'D ON THE JOB CARD
JCTBLP   EQU   4              0-BLP WILL BE TREATED AS NL        Y02668
*                             1-BLP WILL BE TREATED AS BYPASS    Y02668
*                             LABEL PROCESSING                   Y02668
JCTCKIDL DS    C LENGTH OF CHECKPOINT ID
JCTCKIDT DS    CL16 CHECKPOINT IDENT                               AACA
*******************************************************************AACA
*        THE FOLLOWING SYSTEMS MGMT FACILITIES SUBFIELDS MUST      AACA
*        BEGIN ON A HALF WORD BOUNDARY                             AACA
*******************************************************************AACA
*JCTJMR  DS    CL3  (ORIGINAL)                 *** SYSTEMS ***     AACA
ZJCTJMR  DS    CL3  (WAS JCTJMR IN ORIGINAL FOR SYZYGY1)           AACA
JCTJMRD  DS    CL1  DATE DIFFERENCE STEP START-JOB START *         AACA
JCTJMROP DS    CL1  SMF OPTION SWITCHES        * MANAGEMENT        AACA
JCTJMRCL DS    CL1  SMF CANCELLATION CONTROL STATUS      *         AACA
JCTJMRTL DS    CL3  JOB TIME LIMIT             *  FACILITIES       AACA
JCTJMRSS DS    CL3  STEP START TIME OF DAY               *         AACA
JCTJMRJT DS    CL3  JOB START TIME OF DAY      *  SUBFIELDS        AACA
JCTJMRJD DS    CL3  JOB START DATE             *****************   AACA
JCTSRBT  DS    CL4  ACCUMULATED SRB TIME FOR JOB                 Y02652
         DS    CL1  RESERVED
JCTSSD   DS    CL3      STEP START DATE                          Y02668
JCTUSER  DS    CL7    USER ID FIELD. SET BY C/I MODULE IEFVJA  @Z40RPTH
*                     AS A RESULT OF A USER KEYWORD ON THE JOB @Z40RPTH
*                     STATEMENT.                               @Z40RPTH
JCTPRFMF DS    CL1     PERFORMANCE GROUP NUMBER                  Y02668
JCTACODE DS    CL4     ABEND CODE FIELD                          Y02641
JCTVULDP DS    CL4     POINTER TO VOLUME UNLOAD TABLE            Y02670
JCTLNGTH EQU   *-INJMJCT   JCT LENGTH                             20001
***************************************************************** 20001
**                                                                   **
**                       ACCOUNT CONTROL TABLE                       **
**                                                                   **
***********************************************************************
IEFAACTB DS    0D                                              @ZA44001
ACTDSKAD DS    CL3                 DISK ADDRESS OF THIS ACT
ACTIDENT DS    CL1                 TABLE ID  ACT = 16
ACTID EQU 1
ACTNEXT  DS    CL4                 DISK ADDRESS OF NEXT ACT
ACTPRGNM DS    CL20                PROGRAMMERS NAME
ACTJTIME DS    CL3                 JOB RUNNING TIME
ACTJNFLD DS    1C                  NBR OF JOB ACCOUNTING FIELDS
ACTACCNT DS    CL144          THE REST OF THE FIELDS HAVE THE  @ZA52459
*                                  FOLLOWING FORMAT FOR JOB ACCOUNTING-
*                                  1 BYTE- LENGTH OF FIELD
*                                  VARIABLE BYTES- CONTENTS OF FIELD
*                                    (REPEATED FOR N FIELDS)
*                                  STEP ACCOUNTING HAS THE FOLLOWING
*                                  FORMAT FOR EACH STEP-
*                                  3 BYTES- MAXIMUM STEP RUNNING TIME
*                                  1 BYTE- NBR OF FIELDS IN STEP
*                                  1 BYTE- LENGTH OF FIELD
*                                  VARIABLE BYTES- CONTENTS OF FIELD
*                                    (LAST 2 REPEATED N TIMES)
* THIS SECTION FORMERLY HELD THE SMB MADE OBSOLETE BY AOS/II RELEASE 2
 MEND
