         MACRO
         IKJTSCVT
TSCVT    DSECT
TSCVTTJB DS    A .      POINTER TO TJB TABLE
TSCVTRCB DS    A .      POINTER TO RCB TABLE
TSCVTRPT DS    A .      PTR TO REFERENCE POINTER TABLE
TSCVTFLG DS    X .      FLAGS TO INDICATE FUNCT REQUESTED OF TSC
         DS    X
TSCSWPND EQU   X'80' .  SWAP ENDED
TSCSWPBG EQU   X'40' .  SWAP SHOULD BE STARTED
TSCLOGON EQU   X'20' .  A LOGON IS TO BE PROCESSED
TSCDISC  EQU   X'10' .  A DISCONNECT IS TO BE PROCESSED
*        BITS  4-15     RESERVED
TSCVTFL1 DS    X .      FLAGS TO INDICATE FUNCT REQUESTED OF TSC
         DS    X
TSCSSTOP EQU   X'80' .  SYSTEM STOP REQUESTED AND TSC IS STOPPING
TSCRSTOP EQU   X'40' .  REGION STOP REQUESTED
TSCASTOP EQU   X'20' .  ABEND-STOP TS FLG. SET BY TSO/RMS IF TCAM MCH'S
*                       SET BY TCAM STAE EXIT IF TCAM ABENDS
TSCLOGPR EQU   X'10' .  SET BY S02 WHEN NOT ENOUGH SWAP SPACE IS
*                       ALLOCATED WHEN LOGON IMAGE BEING PROCESSED
*        BITS  4-15     RESERVED
TSCVTSDC DS    A .      PTR TO 1ST DCB FOR SWAP DS
TSCVTCUS DS    1H .     CURR NO. OF USERS LOGGED ON TSO
TSCVTLUS DS    H .      CURRENT LIMIT NO. OF USERS LOGGED ON TO TSO
*                       SET BY TSC
TSCVTNTJ DS    1H .     NO.TJB-TSB'S ALLOC BY TSO INITIALLY
TSCVTSZU DS    1H .     SIZE OF TJB
TSCVTCTR DS    1H .     NO. OF RCB'S ALLOC BY TSO INITIALLY
TSCVTMUS DS    H .      MAX NUMBER OF USERS LOGGED ON TO TSO
*                       SET BY START AND MODIFY COMMANDS (TSC)
TSCVTSAV DS    A .      PTR TO SAV AREA FOR TSC,TSIP&TS DISP
TSCVTECB DS    A .      PTR TO TSECBTAB CTL BLK OF ECB'S
TSCVTSIA DS    A .      PTR TO TSIA
TSCVTICB DS    A .      PTR TO TSICB
TSCVTI01 DS    A .      ADDRESS OF ENTRY POINT IKJEAI01 TSIP BR ENTRY
TSCVTTQE DS    A .      PTR TO TQE FOR TSO'S TIME SLICING
TSCVTI02 DS    A .      ADDRESS OF ENTRY POINT IKJEAI02 IN TS DISPATCH
TSCVTI03 DS    A .      ADDRESS OF ENTRY POINT IKJEAI03 IN TS DISPATCH
TSCVTD02 DS    A .      ADDRESS OF ENTRY POINT IKJEAD02 IN TS DRIVER
TSCVTLCQ DS    A .      ADDR OF TOP ELEM ON LOGON COMM. QUE
TSCVTTRB DS    A .      ADDR OF TRACE CTL BLK CHAIN
TSCVTLPA DS    A .      ADDR OF 1ST CDE IN TS LINK PACK AREA
TSCVTSLF DS    1F .     SYSTEM INIATED LOGOFF
TSCVTTSC DS    A .      ADDR OF THE  TSC TASK'S TCB. (TSC)
TSCVTSPL DS    A .      ADDRESS OF START PARAMETER LIST
TSCVTRSZ DS    H .      MIN REGION SIZE FOR LOGON
         DS    CL2 .    RESERVED
TSCVTSVT DS    CL4 .    SVCTBL ENTRY FOR TSIP PRIOR TO START TS
TSCVTSVQ DS    CL4 .    SVCTBL ENTRY FOR QTIP PRIOR TO START TS
TSCVTABN DS    A .      ADDR OF OUT-OF-CORE ABEND RTN(IKJEAT07)
TSCVTD03 DS    A .      ADDR OF EP IKJEAD03 IN TS DRIVER
TSCVTFLM DS    A .      ADDRESS OF ENTRY POINT - IKJEFLM
TSCVTQTP DS    A .      ADDRESS OF ENTRY FOR QTIP SVC - IKJGGQT1
TSCVTT08 DS    A .      ENTRY POINT ADDRESS OF IKJEAT08
TSCVTDMP DS    A .      ADDRESS OF TSO DUMP CONTROL BLOCK-IKJTSDMP
TSCVTT06 DS    A .      ADDRESS OF TCB FOR IKJEAT06
TSCVTLS3 DS    A .      ADDRSS OF LOGON OUT OF CORE ABEND RTN
         MEND
