         MACRO
         ILRAIA
AIA      DSECT
AIAFQPA  DS    A     FORWARD QUEUE POINTER OF VIO PROCESS QUEUE
AIABQPA  DS    A     BACK QUEUE POINTER OF VIO PROCESS QUEUE
AIAOP    DS    X     OPERATION CODE FIELD, USED ONLY FOR VIO OFERATIONS
*                    (SET TO X'1O' CORRESPONDS TO ACEOP IN ACE)
AIAFLG1  DS    X     I/O CONTROL FLAGS
AIAWRITE EQU   X'80' READ/WRITE FLAG
*                    1 = WRITE OPERATION
*                    0 = READ OPERATION
AIAPRIV  EQU   X'40' PAGE TYPE FLAG
*                    1 = PRIVATE AREA FLAG
*                    0 = COMMON AREA FLAG
AIAVIO   EQU   X'20' VIO PAGE FLAG
*                    1 = PAGE I/O OPERATION FOR VIO PAGE
*                    0 = NORMAL VIRTUAL PAGE
AIADUPLX EQU   X'10' DUPLEXING FLAG
*                    1 = DUPLEX WRITE OPERATION
*                    0 = SIMPLEX READ OR WRITE OPERATION
*
* THE FOLLOWING FLAGS ARE USED TO CONTROL A SWAP-OUT OR SWAP-IN
* OPERATION
*
AIALSQA  EQU   X'08' SWAP LSQA FLAG
*                    1 = PAGE IS AH LSQA PAGE
*                    0 = PAGE IS NOT AN LSQA PAGE
AIAPAGDS EQU   X'04' LSQA PAGE LOCATION FLAG.  SET ONLY IF LSQA
*                    FLAG IS SET
*                    1 = LSQA PAGE ON A PAGE DATA SET
*                    0 = LSQA PAGE ON A SWAP DATA SET
AIASWPFX EQU   X'02' PRIVATE AREA FIXED PAGE FLAG
*                    1 = PAGE IS A PRIVATE AREA FIXED PAGE
*                    INVOLVED IN SWAP OPERATION
*                    0 = PAGE IS NOT A PRIVATE AREA SWAP FIXED PAGE
AIARSV1  EQU   X'01' RESERVED
AIAFLG2  DS    X     I/O DISPOSITION FLAG. THE FIRST SEVERAL
*                    FLAGS DIRECT ASM ACTICN ON I/O COMPLETION
*                    EVENTS
AIAFRAUX EQU   X'80' FREE AUXILIARY STORAGE SLOT FLAG
*                    1 = AUX SLOT TO BE FREED WHEN I/O COMPLETES
*                    0 = DO NORMAL PROCESSING ON I/O COMPLETION
AIATERMR EQU   X'40' ADDRESS SPACE TERMKATIOM FLAG.
*                    1 = ADDRESS SPACE THIS AIA IS ASSOCIATED
*                    HAS BEEN TERMINATED
*                    0 = ADDRESS SPACE STILL ACTIVE
AIAIORTY EQU   X'20' I/O RETRY FLAG
*                    1 = I/O OPERATION MUST BE RETRIED
*                    0 = DO NOT RETRY I/O OPERATION
AIARSV4  EQU   X'10' RESERVED
*
*  THE FOLLOWING FLAGS ARE I/O ERROR FLAGS.  NORMAL I/O COMPLETION
*  IS SIGNALED IF ALL FLAGS ARE OFF, ONLY ONE FLAG MILL BE SET AT
*  A TIME TO INDICATE THE ERROR ENCOUNTERED BY ASM TO RSM
*
AIAPRIER EQU   X'08' PERMANENT I/O ERROR HAS OCCUREO FOR THE
*                    REQUESTED OPERATION, THIS FLAG WILL BE ON
*                    ONLY FOR READ OPERATIONS AT THE TIME THE AIA
*                    IS RETURNED TO RSM, ASM USES THE FLAG
*                    INTERNALLY FOR BOTH READ AND WRITE
*                    OPERATIONS IF DUPLEXED WRITE OPERATION,
*                    ERROR OCCURED FOR PRIMARY WRITE OPERATION
AIASECER EQU   X'04' SECONDARY WRITE ERROR, USED ONLY FOR
*                    DUPLEXED WRITE OFERATIONS
*                    1 = SECONDARY WRITE OF DUPLEXED PAGE
*                    SUFFERED PERMMANENT I/O ERROR, MUST BE ON
*                    IN CONJUNCTION WITH I/O ERROR FLAG
*                    0 = SECONDARY WRITE OPERATION SUCCESSFUL
AIAERROR EQU   X'02' LOGICAL AIA ERROR FLAG
*                    1 = AIA CONTAINS DATA INCONSISTANT WITH PREVIOUS
*                    AIA'S IN INPUT CHAIN
AIABADID EQU   X'01' INVALID AUX STG LOCATION FLAG
*                    1 = THE LSID OR LPIO IN THE XPTE IS INVALID
*                    OR THE SSID IN THE AIA IS INCORRECT
AIAFLG3  DS    X     VIO CONTROLLER FLAGS. USED ONLY FOR VIO
*                    CONTROLLER PROCESSING.  AIAVIO NUST BE SET
*                    ON, FLAGS IN THIS BYTE CORRESPOND TO FLAGS
*                    IN ACEFLG3
AIARSV5  EQU   X'80' RESERVED, USED IN ACE
AIAPRINO EQU   X'40' PROCESS IN OPERATION FLAG
*                    1 = PAGE I/O OPERATION STARTED BUT NOT
*                    COMPLETE
*                    0 = PAGE I/O OPERATION HAS NOT BEEN STARTED
AIATRPSP EQU   X'20' TRANSFER PAGE FLAG
*                    1 = AIACEPTR CONTAINS ADDRESS OF TRANSFER
*                    PAGE ACE
*                    0 = NON-SPECIAL AIA
AIARSV6  EQU   X'10' RESERVED
AIALPMEC EQU   X'08' AUX LOCATOR STATUS FLAG
*                    1 = LPID CONVERTED O LPME ADDRESS, ADDRESS
*                    OF FIXED LPME IN AIA
*                    0 = LPID IN AIA
AIARSV7  EQU   X'04' RESERVED
AIARSV8  EQU   X'02' RESERVED
AIARSV9  EQU   X'01' RESERVED
*
* THE FOLLOWING WORD HAS TWO USES. IT IS USED AS
* AIANXAIA BY ALL ASM MODULES EXCEPT SLOT SORT. SLOT
* SORT USES THIS WORD AS AIACYL AND AIARCSN WHILE TREE
* SORTING READ IOES.
*
AIANXAIA DS    0A    CHAIN POINTER FOR SINGLE THREAD CHAINS
*                    USED TO PASS AIA BETWEEN RSM AND ASM AND
*                    BETWEEN DIFFERENT ASM MODULES
AIACYL   DS    XL2   RELATIVE CYLINDER NUMBER
AIARCSN  DS    XL2   RELATIVE SLOT NUMBER
AIAID    DS    0D    CONTENTS OF THIS DOUBLENORD DEPEND ON
*                    THE TYPE OF PAGE BEING MOVED TO OR FROM
*                    AUX STG,  THIS HAHE USED TO REFERENCE
*                    BOTH LSIDS FOR A DUPLEXED PAGE
AIALPID  DS    0D    FIELD CONTAINS AN LPID IF AIAVIO = 1,
*                    AND AIALPMEC = AIAPLPMC = 0
AIALGID  DS    0D    THE LOGICAL GROUP ID OR LGH MAKES UP THE
*                    FIRST WORD OF THE LPID
AIALSID  DS    0D    THE LOGICAL SLOT IDENTIFIER (LSID) FOR
*                    THE AUX STG LOCATION OF A VIRTUAL
*                    PAGE (IF AIAVIO = 0, OR AIAVIO = 1 AND
*                    AIALPMEC = AIAPRINO = 1)
         DS    X     RESERVED
AIASSID  DS    0XL3  DIRECT REFERENCE TO SNAP OR VIO LSIO
         DS    X     RESERVED
AIASLOT  DS    XL2   RELATIVE SLOT NUMBER OF LSID
AIARPN   DS    0F    THE RELATIVE PAGE NUMBER (RPN) PORTION
*                    OF AN LPID
AIALSID2 DS    0F    THE LSID FOR THE SECONDARY COPY OF A
*                    DUPLEXED PAGE IF THE AIA IS FOR A WRITE
*                    OPERATION
AIALPMEP DS    0F    THE ADDRESS OF THE LPME IN THE ASPCT FOR
*                    A VIO PAGE, THIS FIELD CONTAINS THE
*                    ADDRESS OF A FIXED (IN LSQA) LPME IF
*                    AIAPAGBL = 0 OR IF AIAPAGBL = 1 AND
*                    AIALPMEC = 1,  IT CONTAINS A PAGEABLE
*                    LPME ADDRESS IF AIAPAGBL = 1 AND
*                    AIAPLPMC = 1
AIACEPTR DS    F     ADDRESS OF TRANSFER PAGE ACE RECUIRING
*                    LSID FROM WRITE OPERA TION IN PROGRESS
AIAGRPSZ DS    0F    SIZE OF SWAP GROUP, NUMBER OF AIAS FOR
*                    LSQA PAGES IN THE SWAP GROUP, THIS COUNT
*                    VALID ONLY FOR FIRST AIA OF AN LSQA SWAP
*                    GROUP
AIALGE   DS    0F    THE ADDRESS OF THE LGE FOR THE LOGICAL
*                    GROUP OWNING THE VIO PAGE BEING
*                    PROCESSED
AIADPXCT DS    F     THE COUNT OF OUTSTANDING WRITE
*                    OPERATIONS FOR A DUPLEXED WRITE
*                    OPERATION
         MEND
