         MACRO
&LABEL   IOSEOS     &OP1,&INTRCPT
         GBLB       &IECECOM,&IECEEWA
.****************************************************************
.*                                                              *
.*       THE IOSEOS MACRO IS USED FOR ENTRY AND EXIT IN THE     *
.*       END OF SENSE EXIT.  THE ENTRY OPERAND IS USED WITH     *
.*       NO OTHER OPERANDS.  THE EXIT OPERAND MAY BE USED AS    *
.*       AS THE ONLY OPERAND OR WITH 'INTERCEPT'.               *
.*                                                              *
.*       NOTES:   1. A DSECT FOR THE UCB (WITH PREFIX=YES)      *
.*                   MUST BE INCLUDED IN ANY ASSEMBLY WITH      *
.*                   THE IOSEOS MACRO IF INTERCEPT IS USED.     *
.*                                                              *
.*                2. THE INTERCEPT OPTION WITH THE OPERAND      *
.*                   EXIT SHOULD BE USED ONLY FOR UNSOLICITED   *
.*                   UNIT CHECKS.  BASIC IOS WILL 'INTERCEPT'   *
.*                   THE NEXT REQUEST AND GIVE THE UNIT CHECK   *
.*                   INFORMATION TO THE ERP.                    *
.*                                                              *
.*       &IECECOM AND                                           *
.*       &IECEEWA ARE SET IN ANY 'ENTRY' MACRO WHEN THE COMMON  *
.*                REGISTERS OR EWAR ARE EQUATED. THEY ARE TESTED*
.*                TO AVOID GENERATING DUPLICATE NAMES (IF MORE  *
.*                THAN ONE 'ENTRY' MACRO IS USED IN ONE         *
.*                ASSEMBLY).                                    *
.*                                                              *
.*                                                              *
.****************************************************************
         AIF      ('&LABEL' EQ '').S0
&LABEL   DS    0H
.S0      ANOP
         AIF        ('&OP1' EQ  'ENTRY').S1  FIRST OPERAND ENTRY?
         AIF        ('&OP1' EQ  'EXIT').S10  FIRST OPERAND EXIT?
         IHBERMAC   1014,FIRST               INVALID FIRST PARM
         MEXIT                               SPECIFIED
.S1      ANOP                                FIRST OPERAND IS ENTRY
         AIF        (N'&SYSLIST GT 1).S4    ENTRY ALONE?
         AIF        (&IECECOM EQ 1).S6       COMMON EQUATES DONE?
*****************************************************************
*                                                               *
*        THE IOSEOS MACRO IS USED FOR ENTRY AND EXIT IN THE     *
*        END OF SENSE EXIT.  REGISTERS 0, 1, 14, AND 15 ARE     *
*        AVAILABLE AS WORK REGISTERS.                           *
*                                                               *
*****************************************************************
IOSBR    EQU   2                   ADDRESS OF IOSB OR ZERO
*                                  IF THERE IS NO IOSB
RETR     EQU   4                   RETURN ADDRESS
IOCOMR   EQU   5                   ADDRESS OF I/O COMMUNICATIONS AREA
UCBR     EQU   7                   ADDRESS OF UNIT CONTROL BLOCK PREFIX
BASER    EQU   10                  ADDRESS OF EXIT FOR ADDRESSABILITY
CPAR     EQU   12                  ADDRESS OF CHANNEL PROGRAM AREA-
*                                  NOT INITIALIZED FOR THE EOS EXIT
SAVER    EQU   13                  ADDRESS OF 16 WORD SAVE AREA
&IECECOM SETB  1                             MARK COMMON EQUATES DONE
.S2      AIF        (&IECEEWA EQ 1).S7       EWAR EQUATED?
EWAR     EQU   11                  ADDRESS OF ERP WORK AREA
&IECEEWA SETB  1                             MARK EWAR EQUATE DONE
         MEXIT
.S4      IHBERMAC   1007,ENTRY                *INVALID OPERAND FOR
.*                                            *ENTRY OPTION
         MEXIT
.S6      ANOP
*****************************************************************
*                                                               *
*        THE IOSEOS MACRO IS USED FOR ENTRY AND EXIT IN THE     *
*        END OF SENSE EXIT.  REGISTERS 0, 1, 14, AND 15 ARE     *
*        AVAILABLE AS WORK REGISTERS.  REGISTER EQUATES FOR     *
*        IOSBR, RETR, IOCOMR, UCBR, BASER, AND SAVER HAVE BEEN  *
*        GENERATED IN ANOTHER 'ENTRY' MACRO IN THIS ASSEMBLY.   *
*        CPAR IS NOT INITIALIZED IN THE EOS EXIT AND  IF        *
*        THERE IS NO IOSB, IOSBR IS ZERO.                       *
*                                                               *
*****************************************************************
         AGO    .S2
.S7      ANOP
*****************************************************************
*                                                               *
*        EWAR IS EQUATED IN ANOTHER SENSE OR EOS 'ENTRY'        *
*        MACRO IN THIS ASSEMBLY.                                *
*                                                               *
*****************************************************************
         MEXIT
.S10     ANOP                                 FIRST OPERAND IS EXIT
         AIF        ('&INTRCPT' NE 'INTERCEPT').S11 INTERCEPT?
         AIF        (N'&SYSLIST GT 2).S12    INTERCEPT ALONE?
         OI    UCBFLC-UCB(UCBR),UCBITF  INTERCEPT NEXT REQUEST
         BR    RETR                RETURN TO CALLER
         MEXIT
.S11     AIF        (N'&SYSLIST GT 1).S12   EXIT ALONE?
         BR    RETR                RETURN TO CALLER
         MEXIT
.S12     IHBERMAC  1007,EXIT                  *INVALID OPERAND
.*                                            *WITH EXIT OPTION
         MEND
