         MACRO
&LABEL   IOSSIO     &OP1,&VAR1,&VAR2
         GBLB       &IECECOM,&IECEDEV
.****************************************************************
.*                                                              *
.*       THE IOSSIO MACRO IS USED FOR ENTRY AND EXIT IN THE SIO *
.*       EXIT.  NO OTHER OPERANDS ARE SPECIFIED WITH 'ENTRY'.   *
.*       TO USE 'EXIT' ONE OF THE FOLLOWING MUST BE CODED:      *
.*         1. EXIT                                              *
.*         2. EXIT,DEFER                                        *
.*         3. EXIT,DEFER,PREOP                                  *
.*         4. EXIT,POST                                         *
.*                                                              *
.*         NOTE:  1. A DSECT FOR THE IOCOM MUST BE INCLUDED IN  *
.*                   THE ASSEMBLY IF #1, #3, OR #4 ABOVE IS     *
.*                   CODED.                                     *
.*                                                              *
.*                                                              *
.*       &IECECOM AND                                           *
.*       &IECEDEV ARE SET IN ANY 'ENTRY' MACRO WHEN THE COMMON  *
.*                REGISTERS OR DEVR ARE EQUATED.  THEY ARE      *
.*                TESTED TO AVOID GENERATING DUPLICATE NAMES    *
.*                (IF MORE THAN ONE 'ENTRY' MACRO IS USED IN    *
.*                ONE ASSEMBLY).                                *
.*                                                              *
.****************************************************************
         AIF       ('&LABEL' EQ '').S0
&LABEL   DS    0H
.S0      AIF        ('&OP1' EQ 'ENTRY').S1  FIRST OPERAND ENTRY?
         AIF        ('&OP1' EQ 'EXIT').S10  FIRST OPERAND EXIT?
         IHBERMAC   1014,FIRST               * INVALID FIRST PARM
.*                                           * SPECIFIED
         MEXIT
.S1      ANOP                                FIRST OPERAND IS ENTRY
         AIF        (N'&SYSLIST NE 1).S4     SECOND SHOULD BE NULL
         AIF        (&IECECOM EQ 1).S6       COMMON EQUATES DONE?
*****************************************************************
*                                                               *
*        THE IOSSIO MACRO IS USED FOR ENTRY AND EXIT IN THE     *
*        SIO EXIT.  REGISTERS 0, 1, 14, AND 15 MAY BE USED      *
*        AS WORK REGISTERS BY THE SIO EXIT.                     *
*                                                               *
*****************************************************************
IOSBR    EQU   2                   ADDRESS OF IOSB
RETR     EQU   4                   RETURN ADDRESS
IOCOMR   EQU   5                   ADDRESS OF I/O COMMUNICATIONS AREA
UCBR     EQU   7                   ADDRESS OF UNIT CONTROL BLOCK PREFIX
BASER    EQU   10                  ADDRESS OF EXIT FOR ADDRESSABILITY
CPAR     EQU   12                  ADDRESS OF CHANNEL PROGRAM AREA
SAVER    EQU   13                  ADDRESS OF 16 WORD SAVE AREA
&IECECOM SETB  1                             MARK COMMON EQUATES DONE
.S2      AIF        (&IECEDEV EQ 1).S7       DEVR EQUATED?
DEVR     EQU   6                   DEVICE ADDRESS
&IECEDEV SETB  1                             MARK DEVR EQUATED
         MEXIT
.S4      IHBERMAC   1007,ENTRY               * INVALID OPERAND FOR
.*                                           * ENTRY OPTION
         MEXIT
.S6      ANOP
*****************************************************************
*                                                               *
*        REGISTER EQUATES FOR IOSBR, RETR, IOCOMR, BASER,       *
*        CPAR, UCBR AND SAVER HAVE BEEN GENERATED BY ANOTHER    *
*        'ENTRY' MACRO THIS ASSEMBLY.                           *
*                                                               *
*****************************************************************
         AGO    .S2
.S7      ANOP
*****************************************************************
*                                                               *
*        DEVR HAS BEEN EQUATED BY ANOTHER IOSSIO MACRO WITH     *
*        'ENTRY' IN THIS ASSEMBLY.                              *
*                                                               *
*****************************************************************
         MEXIT
.S10     ANOP                                FIRST OPERAND IN EXIT
         AIF        (N'&SYSLIST GT 1).S12    MORE THAN EXIT?
         L     15,IOCPSIO-IOCOM(,IOCOMR) * GO TO ROUTINE WHICH
         BR    15                        * EXAMINES SIO CC
         MEXIT
.S12     AIF        ('&VAR1' NE 'DEFER').S14   NOT DEFER-CHECK FOR POST
         AIF        ('&VAR2' EQ 'PREOP').S13   DEFER WITH PREOP?
         AIF        (N'&SYSLIST GT 2).S15      MORE THAN EXIT,DEFER?
         B     4(,RETR)            QUEUE REQUEST ON RETURN
         MEXIT
.S13     AIF   (N'&SYSLIST GT 3).S15       MORE THAN EXIT,DEFER,PREOP?
         L     15,IOCDEFP-IOCOM(,IOCOMR)   * GO TO THE EXIT,DEFER,
         BR    15                          * PREOP ROUTINE
         MEXIT
.S14     AIF        ('&VAR1' NE 'POST').S15  &VAR1 POST?
         AIF        (N'&SYSLIST GT 2).S15    MORE THAN EXIT,POST?
         L     15,IOCEXPST-IOCOM(,IOCOMR) * GET ADDRESS OF EXIT,
         BR    15                         * POST RTN, GO THERE
         MEXIT
.S15     IHBERMAC   1007,EXIT                INVALID OPERAND FOR
.*                                           EXIT OPTION
         MEND
