         MACRO
&LABEL   IOSUNSOL   &OP1,&NOATTN
         GBLB       &IECECOM
.****************************************************************
.*                                                              *
.*      THE IOSUNSOL MACRO IS USED FOR ENTRY AND EXIT IN THE    *
.*      UNSOLICITED INTERRUPTION EXIT.  'ENTRY' IS USED AS THE  *
.*      ONLY OPERAND.  'EXIT' MAY BE USED AS THE ONLY OPERAND   *
.*      OR WITH 'NOATTN'.                                       *
.*                                                              *
.*      NOTE:    1. A DSECT FOR THE UCB (WITH PREFIX=YES)       *
.*                  MUST BE INCLUDED IN THE ASSEMBLY WHEN       *
.*                  'NOATTN' IS SPECIFIED WITH EXIT.            *
.*                                                              *
.*       &IECECOM IS SET IN ANY 'ENTRY' MACRO WHEN THE COMMON   *
.*                REGISTERS ARE EQUATED.  IT IS TESTED TO AVOID *
.*                GENERATING DUPLICATE NAMES (IF MORE THAN ONE  *
.*                'ENTRY' MACRO IS USED IN AN ASSEMBLY).        *
.*                                                              *
.****************************************************************
         AIF        ('&LABEL' EQ '').S0
&LABEL   DS    0H
.S0      AIF        ('&OP1' EQ 'ENTRY').S1  FIRST OPERAND ENTRY?
         AIF        ('&OP1' EQ 'EXIT').S10  FIRST OPERAND EXIT?
         IHBERMAC   1014,FIRST               * INVALID FIRST PARM
.*                                           * SPECIFIED
         MEXIT
.S1      ANOP                                FIRST OPERAND IS ENTRY
         AIF        (N'&SYSLIST GT 1).S3     SECOND SHOULD BE NULL
         AIF        (&IECECOM EQ 1).S6       COMMON EQUATES DONE?
****************************************************************
*                                                              *
*        IOSUNSOL IS USED FOR ENTRY AND EXIT IN THE            *
*        UNSOLICITED INTERRUPTION EXIT.  REGISTERS 0, 1,       *
*        14, AND 15 ARE AVAILABLE AS WORK REGISTERS.           *
*                                                              *
****************************************************************
IOSBR    EQU   2                   ADDRESS OF IOSB OR ZERO
*                                  IF THERE IS NO IOSB
RETR     EQU   4                   RETURN ADDRESS
IOCOMR   EQU   5                   ADDRESS OF I/O COMMUNICATIONS AREA
UCBR     EQU   7                   ADDRESS OF UNIT CONTROL BLOCK PREFIX
BASER    EQU   10                  ADDRESS OF EXIT FOR ADDRESSABILITY
CPAR     EQU   12                  ADDRESS OF CHANNEL PROGRAM AREA
*                                  NOT INITIALIZED IN THE UNSOL EXIT.
SAVER    EQU   13                  ADDRESS OF 16 WORD SAVE AREA
.*
&IECECOM SETB  1                             MARK COMMON EQUATES DONE
         MEXIT
.S3      IHBERMAC   1007,ENTRY                *INVALID OPERAND
         MEXIT
.S6      ANOP
****************************************************************
*                                                              *
*        IOSUNSOL IS USED FOR ENTRY AND EXIT IN THE            *
*        UNSOLICITED INTERRUPTION EXIT.  REGISTERS 0, 1,       *
*        14, AND 15 ARE AVAILABLE AS WORK REGISTERS.           *
*        REGISTER EQUATES FOR IOSBR, RETR, IOCOMR, UCBR,       *
*        BASER, CPAR AND SAVER ARE GENERATED IN ANOTHER        *
*        'ENTRY' MACRO IN THIS ASSEMBLY.  IN THE UNSOLICITED   *
*        INTERRUPTION EXIT CPAR IS NOT INITIALIZED AND, IF     *
*        THERE IS NO IOSB, IOSBR IS ZERO.                      *
*                                                              *
****************************************************************
         MEXIT
.S10     ANOP                                 FIRST OPERAND IS EXIT
         AIF        ('&NOATTN' EQ 'NOATTN').S11 NOATTN?
         AIF        (N'&SYSLIST GT 1).S12     VAR1 NULL?
         BR    RETR                RETURN TO CALLER
         MEXIT
.S11     AIF        (N'&SYSLIST GT 2).S12 MORE THAN EXIT,ATTN?
         NI    UCBFLC-UCB(UCBR),X'FF'-UCBATTP  MARK NO ATTENTION
         BR    RETR                 RETURN TO CALLER
         MEXIT
.S12     IHBERMAC   1007,EXIT                * INVALID OPERAND
.*                                           * FOR EXIT OPTION
         MEND
