*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
IKJTTRM0 CSECT                                                          00000060
         B     56(,R15)                                                 00000070
         DC    XL1'33'                                                  00000080
         DC    CL32'IKJTTRM0:TSO TASK TERMINATION MA'                   00000090
         DC    CL19'NAGER 86079 UZ81247'                                00000100
         STM   R14,R12,12(R13)                                          00000110
         BALR  R12,0                                                    00000120
         USING *,R12                                                    00000130
A00003E  EQU *                                                          00000140
         LR    R2,R1                                                    00000150
         L     R3,0(,R2)                                                00000160
         L     R11,16(,R3)                                              00000170
         L     R10,A0002A8                                              00000180
         ST    R10,24(,R11)                                             00000190
         SLR   R10,R10                                                  00000200
         L     R14,548                                                  00000210
         L     R15,108(,R14)                                            00000220
         C     R10,20(,R15)                                             00000230
         BE    A000176                                                  00000240
         TM    0(R3),4                                                  00000250
         BNO   A000094                                                  00000260
         L     R3,56(,R14)                                              00000270
         TM    7(R3),64                                                 00000280
         BNE   A00007E                                                  00000290
         ST    R10,20(,R15)                                             00000300
         B     A000176                                                  00000310
A00007E  L     R10,548                                                  00000320
         L     R3,108(,R10)                                             00000330
         L     R10,20(,R3)                                              00000340
         SLR   R3,R3                                                    00000350
         ST    R3,160(,R10)                                             00000360
         B     A000176                                                  00000370
A000094  L     R10,0(,R2)                                               00000380
         TM    0(R10),128                                               00000390
         BNE   A000176                                                  00000400
         SLR   R3,R3                                                    00000410
         L     R10,548                                                  00000420
         L     R10,108(,R10)                                            00000430
         L     R10,20(,R10)                                             00000440
         L     R10,160(,R10)                                            00000450
         CR    R10,R3                                                   00000460
         BE    A000176                                                  00000470
         C     R3,4(,R10)                                               00000480
         BNL   A000176                                                  00000490
         L     R3,A0002E8                                               00000500
         BCTR  R3,0                                                     00000510
         EX    R3,X00029C                                               00000520
         ST    R11,0(,R11)                                              00000530
         ST    R13,4(,R11)                                              00000540
         ST    R14,8(,R11)                                              00000550
         LA    R1,32(,R11)                                              00000560
         LA    R0,A00017C                                               00000570
         STCM  R0,7,1(R1)                                               00000580
         OI    0(R1),16                                                 00000590
         LA    R0,0(,R11)                                               00000600
         ST    R0,4(,R1)                                                00000610
         OI    12(R1),96                                                00000620
         SLR   R0,R0                                                    00000630
         SVC   60                                                       00000640
         LA    R4,12(,R11)                                              00000650
         XC    12(12,R11),12(R11)                                       00000660
         OI    0(R4),2                                                  00000670
         LA    R5,24(,R11)                                              00000680
         STCM  R5,7,9(R4)                                               00000690
         LR    R1,R4                                                    00000700
         LR    R1,R1                                                    00000710
         SVC   16                                                       00000720
         SLR   R10,R10                                                  00000730
         STH   R10,28(,R11)                                             00000740
         B     A00015E                                                  00000750
A00011C  LH    R5,28(,R11)                                              00000760
         LA    R5,1(,R5)                                                00000770
         STH   R5,28(,R11)                                              00000780
         SLR   R1,R1                                                    00000790
         ICM   R1,7,9(R4)                                               00000800
         LR    R1,R1                                                    00000810
         SVC   17                                                       00000820
         L     R3,A0002A8                                               00000830
         ST    R3,24(,R11)                                              00000840
         CLC   28(2,R11),A00029A                                        00000850
         BNE   A000158                                                  00000860
         LA    R1,A0002BC                                               00000870
         LA    R0,17                                                    00000880
         SLL   R0,24                                                    00000890
         SVC   47                                                       00000900
         SLR   R5,R5                                                    00000910
         STH   R5,28(,R11)                                              00000920
A000158  LR    R1,R4                                                    00000930
         LR    R1,R1                                                    00000940
         SVC   16                                                       00000950
A00015E  CLC   24(4,R11),A0002A8                                        00000960
         BE    A000170                                                  00000970
         CLI   4(R4),127                                                00000980
         BE    A00011C                                                  00000990
A000170  LA    R0,132                                                   00001000
         SVC   60                                                       00001010
A000176  LM    R14,R12,12(R13)                                          00001020
         BR    R14                                                      00001030
A00017C  EQU *,4                                                        00001040
         BALR  R12,0                                                    00001050
         LA    R10,320                                                  00001060
         SR    R12,R10                                                  00001070
         LR    R6,R0                                                    00001080
         LR    R7,R14                                                   00001090
         C     R6,A0002A4                                               00001100
         BE    A0001FE                                                  00001110
         LR    R9,R1                                                    00001120
         L     R2,0(,R9)                                                00001130
         LR    R11,R2                                                   00001140
         LR    R1,R9                                                    00001150
         MVI   252(R1),4                                                00001160
         LA    R3,A00022C                                               00001170
         ST    R3,240(,R1)                                              00001180
         OI    253(R1),132                                              00001190
         OI    4(R1),128                                                00001200
         MVC   292(8,R9),A0002C0                                        00001210
         MVC   300(8,R9),A0002C8                                        00001220
         MVC   308(8,R9),A0002C8                                        00001230
         LA    R8,404(,R9)                                              00001240
         LA    R10,8                                                    00001250
         STCM  R10,3,30(R11)                                            00001260
         MVC   0(8,R8),A0002D0                                          00001270
         LA    R15,2                                                    00001280
         LR    R0,R10                                                   00001290
         ALR   R0,R15                                                   00001300
         STC   R0,403(,R9)                                              00001310
         ALR   R10,R8                                                   00001320
         ALR   R10,R15                                                  00001330
         LR    R8,R10                                                   00001340
         LA    R3,4                                                     00001350
         STCM  R3,3,30(R11)                                             00001360
         MVC   0(4,R8),24(R11)                                          00001370
         ALR   R0,R3                                                    00001380
         ALR   R0,R15                                                   00001390
         STC   R0,403(,R9)                                              00001400
         B     A000200                                                  00001410
A0001FE  LR    R11,R2                                                   00001420
A000200  CLC   24(4,R11),A0002A8                                        00001430
         BE    A000218                                                  00001440
         LA    R4,12(,R11)                                              00001450
         SLR   R1,R1                                                    00001460
         ICM   R1,7,9(R4)                                               00001470
         LR    R1,R1                                                    00001480
         SVC   17                                                       00001490
A000218  C     R6,A0002A4                                               00001500
         BNE   A000228                                                  00001510
         LA    R15,4                                                    00001520
         LA    R0,A00022C                                               00001530
A000228  LR    R14,R7                                                   00001540
         BR    R14                                                      00001550
A00022C  EQU *,4                                                        00001560
         BALR  R12,0                                                    00001570
         LA    R10,496                                                  00001580
         SR    R12,R10                                                  00001590
         LR    R3,R1                                                    00001600
         LA    R0,132                                                   00001610
         SVC   60                                                       00001620
         L     R13,4(,R3)                                               00001630
         L     R14,8(,R3)                                               00001640
         B     A000176                                                  00001650
         B     A000176                                                  00001660
         DC    CL29'PATCH AREA - IKJTTRM0 86.079B'                      00001670
         DC    XL1'2A'                                                  00001680
         DC    CL1'B'                                                   00001690
         DC    XL1'2C'                                                  00001700
         DC    CL1'B'                                                   00001710
         DC    XL1'2E'                                                  00001720
         DC    CL1'B'                                                   00001730
         DC    XL1'30'                                                  00001740
         DC    CL1'B'                                                   00001750
         DC    XL1'32'                                                  00001760
         DC    CL1'B'                                                   00001770
         DC    XL1'34'                                                  00001780
         DC    CL1'B'                                                   00001790
         DC    XL1'36'                                                  00001800
         DC    CL1'B'                                                   00001810
         DC    XL1'38'                                                  00001820
         DC    CL1'B'                                                   00001830
         DC    XL1'3A'                                                  00001840
         DC    CL1'B'                                                   00001850
         DC    XL1'3C'                                                  00001860
         DC    CL1'B'                                                   00001870
         DC    XL1'3E'                                                  00001880
         DC    CL3'B B'                                                 00001890
         DC    XL1'42'                                                  00001900
         DC    CL1'B'                                                   00001910
         DC    XL1'44'                                                  00001920
         DC    CL1'B'                                                   00001930
         DC    XL1'46'                                                  00001940
         DC    CL1'B'                                                   00001950
         DC    XL1'48'                                                  00001960
         DC    CL1'B'                                                   00001970
         DC    XL1'4A'                                                  00001980
         DC    CL7'B<B+B&&B'                                            00001990
         DC    XL1'52'                                                  00002000
         DC    CL1'B'                                                   00002010
         DC    XL1'54'                                                  00002020
         DC    CL1'B'                                                   00002030
         DC    XL1'56'                                                  00002040
         DC    CL1'B'                                                   00002050
         DC    XL1'58'                                                  00002060
         DC    CL2'B!'                                                  00002070
A00029A  DC    H'0255'                                                  00002080
X00029C  EQU *,6                                                        00002090
         DC    CL1'K'                                                   00002100
         DC    XL1'00'                                                  00002110
         DC    XL2'B020'                                                00002120
         DC    CL1'B'                                                   00002130
         DC    XL1'9A'                                                  00002140
         DC    XL2'8930'                                                00002150
A0002A4  DC    F'00012'                                                 00002160
A0002A8  DC    XL4'00FFFFFF'                                            00002170
         DC    F'00048'                                                 00002180
         DC    F'0'                                                     00002190
         DC    CL8'SYSIKJUA'                                            00002200
A0002BC  DC    F'00100'                                                 00002210
A0002C0  DC    CL8'IKJTTRM0'                                            00002220
A0002C8  DC    CL8'IKJTTRM0'                                            00002230
A0002D0  DC    CL8'PIRLADDR'                                            00002240
         DC    XL3'160001'                                              00002250
         DC    CL1'@'                                                   00002260
         DC    F'00688'                                                 00002270
         DC    F'0'                                                     00002280
         DC    CL1'-'                                                   00002290
         DC    XL1'00'                                                  00002300
         DC    H'0'                                                     00002310
A0002E8  DC    F'00016'                                                 00002320
         DC    XL4'0A0A0A03'                                            00002330
R0       EQU   0                                                        00002340
R1       EQU   1                                                        00002350
R2       EQU   2                                                        00002360
R3       EQU   3                                                        00002370
R4       EQU   4                                                        00002380
R5       EQU   5                                                        00002390
R6       EQU   6                                                        00002400
R7       EQU   7                                                        00002410
R8       EQU   8                                                        00002420
R9       EQU   9                                                        00002430
R10      EQU   10                                                       00002440
R11      EQU   11                                                       00002450
R12      EQU   12                                                       00002460
R13      EQU   13                                                       00002470
R14      EQU   14                                                       00002480
R15      EQU   15                                                       00002490
         END                                                            00002500
