*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
HASPFMT0 CSECT                                                          00000060
         DC    XL2'E101'                                                00000070
         DC    CL8'JESCT   '                                            00000080
         DC    H'0'                                                     00000090
         DC    H'0296'                                                  00000100
         DC    CL1'-'                                                   00000110
         DC    XL1'28'                                                  00000120
         DC    CL32'JOB ENTRY SUBSYSTEM COMMUNICATIO'                   00000130
         DC    CL8'N TABLE '                                            00000140
         DC    H'4096'                                                  00000150
         DC    CL8'JESUNITS'                                            00000160
         DC    H'0004'                                                  00000170
         DC    XL4'00040000'                                            00000180
         DC    CL8'JESWAA  '                                            00000190
         DC    XL4'00080004'                                            00000200
         DC    H'0'                                                     00000210
         DC    CL8'JESQMGR '                                            00000220
         DC    H'0012'                                                  00000230
         DC    XL4'00040000'                                            00000240
         DC    CL8'JESRESQM'                                            00000250
         DC    XL4'00100004'                                            00000260
         DC    H'0'                                                     00000270
         DC    CL8'JESSSREQ'                                            00000280
         DC    H'0020'                                                  00000290
         DC    XL4'00040000'                                            00000300
         DC    CL8'JESSSCT '                                            00000310
         DC    XL4'00180004'                                            00000320
         DC    H'0256'                                                  00000330
         DC    CL8'JESPJESN'                                            00000340
         DC    H'0028'                                                  00000350
         DC    XL4'00040000'                                            00000360
         DC    CL8'JESALLOC'                                            00000370
         DC    XL4'00200004'                                            00000380
         DC    H'0'                                                     00000390
         DC    CL8'JESUNALC'                                            00000400
         DC    H'0036'                                                  00000410
         DC    XL4'00040000'                                            00000420
         DC    CL8'JESCATL '                                            00000430
         DC    XL4'00280004'                                            00000440
         DC    CL1'A'                                                   00000450
         DC    XL1'02'                                                  00000460
         DC    CL8'SSCT    '                                            00000470
         DC    H'0004'                                                  00000480
         DC    XL4'01280018'                                            00000490
         DC    CL1' '                                                   00000500
         DC    XL1'24'                                                  00000510
         DC    CL32'SUBSYSTEM COMMUNICATION VECTOR T'                   00000520
         DC    CL4'ABLE'                                                00000530
         DC    H'4352'                                                  00000540
         DC    CL8'SSCTID  '                                            00000550
         DC    F'00004'                                                 00000560
         DC    H'0'                                                     00000570
         DC    CL8'SSCTSCTA'                                            00000580
         DC    H'0004'                                                  00000590
         DC    XL4'00040100'                                            00000600
         DC    CL8'SSCTSNAM'                                            00000610
         DC    XL4'00080004'                                            00000620
         DC    H'0'                                                     00000630
         DC    CL8'SSCTFLG1'                                            00000640
         DC    H'0012'                                                  00000650
         DC    F'65536'                                                 00000660
         DC    CL8'SSCTSSVT'                                            00000670
         DC    XL4'00100004'                                            00000680
         DC    H'0'                                                     00000690
         DC    CL8'SSCTSUSE'                                            00000700
         DC    H'0020'                                                  00000710
         DC    XL4'0004FFFF'                                            00000720
         DC    XL4'FFFF0000'                                            00000730
         DC    F'0'                                                     00000740
R0       EQU   0                                                        00000750
R1       EQU   1                                                        00000760
R2       EQU   2                                                        00000770
R3       EQU   3                                                        00000780
R4       EQU   4                                                        00000790
R5       EQU   5                                                        00000800
R6       EQU   6                                                        00000810
R7       EQU   7                                                        00000820
R8       EQU   8                                                        00000830
R9       EQU   9                                                        00000840
R10      EQU   10                                                       00000850
R11      EQU   11                                                       00000860
R12      EQU   12                                                       00000870
R13      EQU   13                                                       00000880
R14      EQU   14                                                       00000890
R15      EQU   15                                                       00000900
         END                                                            00000910
