*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
HASPBLKS CSECT                                                          00000060
         USING *,R11                                                    00000070
A000000  EQU *                                                          00000080
         B     44(,R15)                                                 00000090
         DC    CL32'HASPBLKS  IBM CORP 1978  COPYRIG'                   00000100
         DC    CL7'HT=NONE'                                             00000110
         DC    XL1'00'                                                  00000120
         STM   R14,R12,12(R13)                                          00000130
         LR    R10,R1                                                   00000140
         LR    R11,R15                                                  00000150
         LA    R0,333                                                   00000160
         ICM   R0,8,6(R10)                                              00000170
         B     A000044                                                  00000180
A000040  DC    F'0'                                                     00000190
A000044  L     R15,A000040                                              00000200
         SR    R1,R1                                                    00000210
         SVC   120                                                      00000220
         LTR   R15,R15                                                  00000230
         BE    A000058                                                  00000240
         LM    R10,R11,60(R13)                                          00000250
         BR    R14                                                      00000260
A000058  LR    R2,R13                                                   00000270
         LR    R13,R1                                                   00000280
         ST    R13,8(,R2)                                               00000290
         ST    R2,4(,R13)                                               00000300
         ST    R10,92(,R13)                                             00000310
         MVC   288(8,R13),A000EE8                                       00000320
         MVC   296(37,R13),A000EF5                                      00000330
         MVC   84(4,R13),A000EF0                                        00000340
         L     R1,52(,R10)                                              00000350
         L     R1,0(,R1)                                                00000360
         LTR   R1,R1                                                    00000370
         BE    A0000CC                                                  00000380
         CLI   0(R1),107                                                00000390
         BE    A0000A2                                                  00000400
         MVC   84(4,R13),0(R1)                                          00000410
         LA    R1,4(,R1)                                                00000420
         CLI   0(R1),107                                                00000430
         BNE   A0000CC                                                  00000440
A0000A2  LA    R1,1(,R1)                                                00000450
         XC    72(8,R13),72(R13)                                        00000460
         PACK  78(2,R13),0(3,R1)                                        00000470
         CVB   R0,72(,R13)                                              00000480
         STH   R0,4(,R10)                                               00000490
         B     A0000CC                                                  00000500
A0000BE  LA    R0,288(,R13)                                             00000510
         SVC   9                                                        00000520
         CLI   296(R13),255                                             00000530
         BE    A000122                                                  00000540
A0000CC  MVC   295(1,R13),296(R13)                                      00000550
         NOPR  0                                                        00000560
         LA    R0,288(,R13)                                             00000570
         L     R1,A0000E0                                               00000580
         B     A0000E4                                                  00000590
A0000E0  DC    XL4'80000000'                                            00000600
A0000E4  SVC   8                                                        00000610
         LTR   R15,R15                                                  00000620
         BNE   A000152                                                  00000630
         MVC   296(36,R13),297(R13)                                     00000640
         LR    R12,R0                                                   00000650
         ST    R12,280(,R13)                                            00000660
         SLL   R1,3                                                     00000670
         LA    R1,0(R1,R12)                                             00000680
         ST    R1,284(,R13)                                             00000690
         NI    80(R13),28                                               00000700
         MVI   81(R13),0                                                00000710
         XC    216(64,R13),216(R13)                                     00000720
         LM    R2,R8,216(R13)                                           00000730
         ST    R12,272(,R13)                                            00000740
         MVI   214(R13),12                                              00000750
         B     A00017C                                                  00000760
A000122  BAL   R4,A000C5C                                               00000770
         L     R1,8(,R10)                                               00000780
         MVC   0(28,R1),A000CC0                                         00000790
         BAL   R4,A000C5C                                               00000800
         LA    R0,333                                                   00000810
         ICM   R0,8,6(R10)                                              00000820
         LR    R1,R13                                                   00000830
         L     R13,4(,R13)                                              00000840
         LA    R1,0(,R1)                                                00000850
         SVC   10                                                       00000860
         LM    R14,R12,12(R13)                                          00000870
         LA    R15,0                                                    00000880
         BR    R14                                                      00000890
A000152  BAL   R4,A000C5C                                               00000900
         L     R1,8(,R10)                                               00000910
         MVC   0(34,R1),A000CDC                                         00000920
         MVC   34(8,R1),288(R13)                                        00000930
         BAL   R4,A000C5C                                               00000940
         TM    80(R13),24                                               00000950
         BNO   A000122                                                  00000960
         MVC   296(36,R13),297(R13)                                     00000970
         B     A0000CC                                                  00000980
A00017C  BAL   R4,A00091C                                               00000990
A000180  TM    81(R13),64                                               00001000
         BO    A00056C                                                  00001010
         TM    0(R12),192                                               00001020
         BE    A00031C                                                  00001030
         BO    A00027C                                                  00001040
         TM    0(R12),64                                                00001050
         BO    A0001A0                                                  00001060
         B     A000202                                                  00001070
A0001A0  TM    80(R13),2                                                00001080
         BO    A0001F8                                                  00001090
         TM    80(R13),1                                                00001100
         BE    A0001D4                                                  00001110
         L     R1,248(,R13)                                             00001120
         LTR   R1,R1                                                    00001130
         BNE   A0001C2                                                  00001140
         ST    R12,248(,R13)                                            00001150
         B     A0001FE                                                  00001160
A0001C2  L     R1,252(,R13)                                             00001170
         LTR   R1,R1                                                    00001180
         BNE   A0001FE                                                  00001190
         ST    R12,252(,R13)                                            00001200
         B     A0001FE                                                  00001210
A0001D4  L     R1,220(,R13)                                             00001220
         LTR   R1,R1                                                    00001230
         BNE   A0001E6                                                  00001240
         ST    R12,220(,R13)                                            00001250
         B     A0001FE                                                  00001260
A0001E6  L     R1,224(,R13)                                             00001270
         LTR   R1,R1                                                    00001280
         BNE   A0001FE                                                  00001290
         ST    R12,224(,R13)                                            00001300
         B     A0001FE                                                  00001310
A0001F8  LR    R1,R12                                                   00001320
         BAL   R4,A000B20                                               00001330
A0001FE  B     A00017C                                                  00001340
A000202  TM    80(R13),2                                                00001350
         BO    A000222                                                  00001360
         TM    80(R13),1                                                00001370
         BO    A00021A                                                  00001380
         ST    R12,228(,R13)                                            00001390
         B     A00017C                                                  00001400
A00021A  ST    R12,256(,R13)                                            00001410
         B     A00017C                                                  00001420
A000222  SR    R2,R2                                                    00001430
         IC    R2,1(,R12)                                               00001440
         LTR   R2,R2                                                    00001450
         BE    A000250                                                  00001460
         SR    R1,R1                                                    00001470
         LH    R1,2(,R12)                                               00001480
         LA    R0,0(R1,R8)                                              00001490
         LR    R1,R10                                                   00001500
         L     R15,20(,R10)                                             00001510
         BALR  R14,R15                                                  00001520
         LTR   R15,R15                                                  00001530
         BNE   A00017C                                                  00001540
         LR    R5,R0                                                    00001550
         EX    R2,X000BBA                                               00001560
         BNO   A00017C                                                  00001570
A000250  LH    R2,4(,R12)                                               00001580
         LA    R3,0(R2,R12)                                             00001590
         CLC   0(4,R3),A000F1A                                          00001600
         BE    A00026A                                                  00001610
         C     R3,284(,R13)                                             00001620
         BL    A000272                                                  00001630
A00026A  OI    81(R13),64                                               00001640
         B     A000180                                                  00001650
A000272  LR    R12,R3                                                   00001660
         ST    R12,272(,R13)                                            00001670
         B     A000180                                                  00001680
A00027C  TM    80(R13),2                                                00001690
         BE    A0002BA                                                  00001700
         TM    0(R12),3                                                 00001710
         BNE   A00056C                                                  00001720
         TM    80(R13),1                                                00001730
         BO    A0002E8                                                  00001740
         OI    80(R13),1                                                00001750
         NI    80(R13),253                                              00001760
         SR    R1,R1                                                    00001770
         ST    R1,248(,R13)                                             00001780
         ST    R1,252(,R13)                                             00001790
         ST    R1,256(,R13)                                             00001800
         ST    R1,260(,R13)                                             00001810
         ST    R12,244(,R13)                                            00001820
         ST    R8,240(,R13)                                             00001830
         B     A00017C                                                  00001840
A0002BA  TM    80(R13),1                                                00001850
         BO    A0002E8                                                  00001860
         TM    0(R12),3                                                 00001870
         BE    A0002E8                                                  00001880
         IC    R1,278(,R13)                                             00001890
         LA    R1,1(,R1)                                                00001900
         STC   R1,278(,R13)                                             00001910
         L     R1,216(,R13)                                             00001920
         LTR   R1,R1                                                    00001930
         BNE   A00017C                                                  00001940
         ST    R12,216(,R13)                                            00001950
         B     A00017C                                                  00001960
A0002E8  BAL   R4,A000C5C                                               00001970
         L     R1,8(,R10)                                               00001980
         MVC   0(49,R1),A000D64                                         00001990
         MVC   49(8,R1),2(R12)                                          00002000
         BAL   R4,A000C5C                                               00002010
         BAL   R4,A000C5C                                               00002020
         L     R1,8(,R10)                                               00002030
         MVC   0(40,R1),A000D95                                         00002040
         MVC   40(8,R1),288(R13)                                        00002050
         BAL   R4,A000C5C                                               00002060
         B     A000122                                                  00002070
A00031C  TM    80(R13),2                                                00002080
         BO    A000402                                                  00002090
         OI    80(R13),2                                                00002100
         NI    80(R13),223                                              00002110
         TM    80(R13),1                                                00002120
         BE    A000340                                                  00002130
         ST    R12,260(,R13)                                            00002140
         L     R1,244(,R13)                                             00002150
         B     A000348                                                  00002160
A000340  ST    R12,232(,R13)                                            00002170
         L     R1,216(,R13)                                             00002180
A000348  BAL   R4,A00099C                                               00002190
         LTR   R1,R1                                                    00002200
         BE    A000394                                                  00002210
         CLI   278(R13),1                                               00002220
         BH    A0005BC                                                  00002230
A00035A  BAL   R4,A00091C                                               00002240
         TM    81(R13),64                                               00002250
         BO    A0000BE                                                  00002260
         TM    0(R12),192                                               00002270
         BNO   A00035A                                                  00002280
         TM    0(R12),3                                                 00002290
         BE    A00035A                                                  00002300
         NI    80(R13),28                                               00002310
         MVI   81(R13),0                                                00002320
         XC    216(64,R13),216(R13)                                     00002330
         LM    R2,R8,216(R13)                                           00002340
         ST    R12,272(,R13)                                            00002350
         ST    R12,268(,R13)                                            00002360
         B     A00027C                                                  00002370
A000394  XC    104(4,R13),104(R13)                                      00002380
         NI    81(R13),191                                              00002390
         TM    80(R13),1                                                00002400
         BO    A0003D4                                                  00002410
         LTR   R8,R8                                                    00002420
         BE    A00056C                                                  00002430
         L     R1,220(,R13)                                             00002440
         LTR   R1,R1                                                    00002450
         BE    A0003BA                                                  00002460
         BAL   R4,A000B20                                               00002470
A0003BA  L     R0,216(,R13)                                             00002480
         BAL   R4,A000522                                               00002490
         L     R1,224(,R13)                                             00002500
         LTR   R1,R1                                                    00002510
         BE    A000416                                                  00002520
         BAL   R4,A000B20                                               00002530
         B     A000416                                                  00002540
A0003D4  LTR   R8,R8                                                    00002550
         BE    A00056C                                                  00002560
         L     R1,248(,R13)                                             00002570
         LTR   R1,R1                                                    00002580
         BE    A0003E8                                                  00002590
         BAL   R4,A000B20                                               00002600
A0003E8  L     R0,244(,R13)                                             00002610
         BAL   R4,A000522                                               00002620
         L     R1,252(,R13)                                             00002630
         LTR   R1,R1                                                    00002640
         BE    A000416                                                  00002650
         BAL   R4,A000B20                                               00002660
         B     A000416                                                  00002670
A000402  LA    R4,A000416                                               00002680
         TM    0(R12),32                                                00002690
         BO    A000C92                                                  00002700
         TM    0(R12),16                                                00002710
         BO    A000C5C                                                  00002720
A000416  TM    0(R12),4                                                 00002730
         BE    A00046C                                                  00002740
         LR    R5,R8                                                    00002750
         AH    R5,12(,R12)                                              00002760
         LR    R0,R5                                                    00002770
         LR    R1,R10                                                   00002780
         L     R15,20(,R10)                                             00002790
         BALR  R14,R15                                                  00002800
         LTR   R15,R15                                                  00002810
         BNE   A000450                                                  00002820
         LR    R5,R0                                                    00002830
         ICM   R2,12,0(R5)                                              00002840
         SRL   R2,16                                                    00002850
         LTR   R2,R2                                                    00002860
         BE    A00051A                                                  00002870
         SH    R2,10(,R12)                                              00002880
         BE    A00051A                                                  00002890
         BH    A000472                                                  00002900
A000450  BAL   R4,A000C5C                                               00002910
         L     R1,8(,R10)                                               00002920
         MVC   0(82,R1),A000E1A                                         00002930
         MVC   82(8,R1),2(R12)                                          00002940
         BAL   R4,A000C5C                                               00002950
         B     A00051A                                                  00002960
A00046C  SR    R2,R2                                                    00002970
         LH    R2,12(,R12)                                              00002980
A000472  LR    R0,R8                                                    00002990
         AH    R0,10(,R12)                                              00003000
A000478  LR    R1,R2                                                    00003010
         BAL   R4,A000656                                               00003020
         LTR   R1,R1                                                    00003030
         BE    A000502                                                  00003040
         LR    R5,R0                                                    00003050
         TM    80(R13),24                                               00003060
         BO    A0004EA                                                  00003070
         CLC   2(8,R12),A000F88                                         00003080
         BE    A0004CC                                                  00003090
         TM    80(R13),8                                                00003100
         BO    A0004EA                                                  00003110
         CLC   2(8,R12),A000F90                                         00003120
         BE    A0004DA                                                  00003130
         CLC   2(8,R12),A000F98                                         00003140
         BNE   A0004EA                                                  00003150
         CLC   84(4,R13),88(R13)                                        00003160
         BNE   A0004EA                                                  00003170
         MVC   96(4,R13),0(R5)                                          00003180
         OI    80(R13),8                                                00003190
         B     A0004EA                                                  00003200
A0004CC  MVC   100(4,R13),0(R5)                                         00003210
         OI    80(R13),16                                               00003220
         B     A0004EA                                                  00003230
A0004DA  CLC   84(4,R13),0(R5)                                          00003240
         BNE   A0004EA                                                  00003250
         MVC   88(4,R13),0(R5)                                          00003260
A0004EA  SR    R2,R1                                                    00003270
         BAL   R4,A0006C2                                               00003280
         LTR   R2,R2                                                    00003290
         BE    A00051A                                                  00003300
         L     R0,104(,R13)                                             00003310
         OI    80(R13),128                                              00003320
         B     A000478                                                  00003330
A000502  BAL   R4,A000C5C                                               00003340
         L     R1,8(,R10)                                               00003350
         MVC   0(47,R1),A000D35                                         00003360
         MVC   47(8,R1),2(R12)                                          00003370
         BAL   R4,A000C5C                                               00003380
A00051A  NI    80(R13),127                                              00003390
         B     A00017C                                                  00003400
A000522  STM   R2,R4,176(R13)                                           00003410
         LR    R2,R0                                                    00003420
         LTR   R1,R1                                                    00003430
         BNE   A00053E                                                  00003440
         TM    0(R2),32                                                 00003450
         BE    A00053E                                                  00003460
         BAL   R4,A000C92                                               00003470
         B     A000542                                                  00003480
A00053E  BAL   R4,A000C5C                                               00003490
A000542  L     R1,8(,R10)                                               00003500
         MVC   0(8,R1),2(R2)                                            00003510
         XC    72(8,R13),72(R13)                                        00003520
         ST    R8,72(,R13)                                              00003530
         UNPK  9(7,R1),73(4,R13)                                        00003540
         TR    9(6,R1),A000DBD+43                                       00003550
         BAL   R4,A000C5C                                               00003560
         LM    R2,R4,176(R13)                                           00003570
         BR    R4                                                       00003580
A00056C  OI    80(R13),32                                               00003590
         TM    80(R13),1                                                00003600
         BE    A0005A0                                                  00003610
         L     R1,244(,R13)                                             00003620
         BAL   R4,A00099C                                               00003630
         TM    81(R13),128                                              00003640
         BO    A000594                                                  00003650
         L     R12,260(,R13)                                            00003660
         ST    R12,272(,R13)                                            00003670
         B     A000394                                                  00003680
A000594  NI    80(R13),254                                              00003690
         NI    81(R13),127                                              00003700
         L     R8,240(,R13)                                             00003710
A0005A0  L     R1,216(,R13)                                             00003720
         BAL   R4,A00099C                                               00003730
         TM    81(R13),128                                              00003740
         BO    A0005BC                                                  00003750
         L     R12,232(,R13)                                            00003760
         ST    R12,272(,R13)                                            00003770
         B     A000394                                                  00003780
A0005BC  SR    R1,R1                                                    00003790
         IC    R1,278(,R13)                                             00003800
         BCTR  R1,0                                                     00003810
         STC   R1,278(,R13)                                             00003820
         LTR   R1,R1                                                    00003830
         BNE   A0005F0                                                  00003840
         NI    80(R13),28                                               00003850
         NI    81(R13),127                                              00003860
         XC    216(64,R13),216(R13)                                     00003870
         ST    R12,268(,R13)                                            00003880
         ST    R12,272(,R13)                                            00003890
         TM    81(R13),64                                               00003900
         BO    A0000BE                                                  00003910
         B     A000180                                                  00003920
A0005F0  L     R12,216(,R13)                                            00003930
         NI    81(R13),191                                              00003940
A0005F8  BAL   R4,A00091C                                               00003950
         TM    81(R13),64                                               00003960
         BO    A000636                                                  00003970
         TM    0(R12),192                                               00003980
         BO    A00061C                                                  00003990
         TM    0(R12),64                                                00004000
         BNO   A0005F8                                                  00004010
         ST    R12,224(,R13)                                            00004020
         B     A0005F8                                                  00004030
A00061C  NI    80(R13),222                                              00004040
         NI    81(R13),127                                              00004050
         LR    R1,R12                                                   00004060
         ST    R12,216(,R13)                                            00004070
         L     R12,232(,R13)                                            00004080
         ST    R12,272(,R13)                                            00004090
         B     A000348                                                  00004100
A000636  L     R12,216(,R13)                                            00004110
         BAL   R4,A000C5C                                               00004120
         L     R1,8(,R10)                                               00004130
         MVC   0(93,R1),A000DBD                                         00004140
         MVC   93(8,R1),2(R12)                                          00004150
         BAL   R4,A000C5C                                               00004160
         B     A0000BE                                                  00004170
A000656  STM   R2,R5,192(R13)                                           00004180
         LR    R5,R0                                                    00004190
         LR    R2,R1                                                    00004200
         C     R5,104(,R13)                                             00004210
         BNL   A00066C                                                  00004220
         CR    R5,R7                                                    00004230
         BNL   A00069A                                                  00004240
A00066C  LR    R7,R0                                                    00004250
         LR    R1,R10                                                   00004260
         L     R15,20(,R10)                                             00004270
         BALR  R14,R15                                                  00004280
         LTR   R15,R15                                                  00004290
         BNE   A0006BC                                                  00004300
         LR    R6,R0                                                    00004310
         LR    R1,R7                                                    00004320
         SRL   R1,11                                                    00004330
         SLL   R1,11                                                    00004340
         LA    R1,2048(,R1)                                             00004350
         ST    R1,104(,R13)                                             00004360
         SR    R1,R7                                                    00004370
         LA    R1,0(R1,R6)                                              00004380
         ST    R1,108(,R13)                                             00004390
A00069A  LR    R1,R2                                                    00004400
         SR    R5,R7                                                    00004410
         LA    R5,0(R5,R6)                                              00004420
         LA    R3,0(R1,R5)                                              00004430
         C     R3,108(,R13)                                             00004440
         BL    A0006B4                                                  00004450
         S     R3,108(,R13)                                             00004460
         SR    R1,R3                                                    00004470
A0006B4  LR    R0,R5                                                    00004480
         LM    R2,R5,192(R13)                                           00004490
         BR    R4                                                       00004500
A0006BC  SR    R1,R1                                                    00004510
         B     A0006B4                                                  00004520
A0006C2  STM   R2,R8,112(R13)                                           00004530
         LR    R5,R1                                                    00004540
         LR    R6,R0                                                    00004550
         SR    R8,R8                                                    00004560
         IC    R8,212(,R13)                                             00004570
         L     R7,208(,R13)                                             00004580
         TM    80(R13),128                                              00004590
         BO    A00076A                                                  00004600
         CLI   212(R13),1                                               00004610
         BNE   A0006FC                                                  00004620
         MVI   214(R13),12                                              00004630
         TM    0(R12),3                                                 00004640
         BO    A000704                                                  00004650
         CH    R5,A000FA0                                               00004660
         BNL   A000704                                                  00004670
         B     A000718                                                  00004680
A0006FC  CH    R5,A000FA0                                               00004690
         BL    A000718                                                  00004700
A000704  BAL   R4,A000C5C                                               00004710
         IC    R8,212(,R13)                                             00004720
         L     R7,208(,R13)                                             00004730
         MVI   214(R13),9                                               00004740
         B     A00073A                                                  00004750
A000718  TM    212(R13),1                                               00004760
         BO    A00073A                                                  00004770
         BAL   R4,A0008F6                                               00004780
         CLC   212(1,R13),214(R13)                                      00004790
         BNH   A00073A                                                  00004800
         BAL   R4,A000C5C                                               00004810
         IC    R8,212(,R13)                                             00004820
         L     R7,208(,R13)                                             00004830
A00073A  OI    80(R13),128                                              00004840
         MVC   0(8,R7),2(R12)                                           00004850
         BAL   R4,A0008F6                                               00004860
         TM    0(R12),3                                                 00004870
         BC    9,A0007D6                                                00004880
         BCTR  R7,0                                                     00004890
         MVI   0(R7),96                                                 00004900
         TM    0(R12),1                                                 00004910
         BO    A000762                                                  00004920
         MVI   0(R7),126                                                00004930
A000762  LA    R7,1(,R7)                                                00004940
         B     A00077E                                                  00004950
A00076A  CLI   212(R13),1                                               00004960
         BNE   A000776                                                  00004970
         BAL   R4,A0008F6                                               00004980
A000776  TM    0(R12),3                                                 00004990
         BC    9,A0007D6                                                00005000
A00077E  TM    0(R12),2                                                 00005010
         BO    A000856                                                  00005020
         LA    R3,8                                                     00005030
         CH    R5,A000FA0+2                                             00005040
         BNL   A000794                                                  00005050
         LR    R3,R5                                                    00005060
A000794  SR    R5,R3                                                    00005070
         BCTR  R3,0                                                     00005080
         EX    R3,X0007D0                                               00005090
         LA    R6,1(R3,R6)                                              00005100
         BAL   R4,A0008F6                                               00005110
         CLC   212(1,R13),214(R13)                                      00005120
         BNH   A0007BA                                                  00005130
         BAL   R4,A000C5C                                               00005140
         IC    R8,212(,R13)                                             00005150
         L     R7,208(,R13)                                             00005160
A0007BA  LTR   R5,R5                                                    00005170
         BE    A0008EC                                                  00005180
         CLI   212(R13),1                                               00005190
         BNE   A00077E                                                  00005200
         BAL   R4,A0008F6                                               00005210
         B     A00077E                                                  00005220
X0007D0  MVC   0(1,R7),0(R6)                                            00005230
A0007D6  LA    R3,4                                                     00005240
         CH    R5,A000FA4                                               00005250
         BNL   A0007E4                                                  00005260
         LR    R3,R5                                                    00005270
A0007E4  SR    R5,R3                                                    00005280
         LR    R2,R3                                                    00005290
         AR    R2,R2                                                    00005300
         BCTR  R3,0                                                     00005310
         SLL   R2,4                                                     00005320
         OR    R2,R3                                                    00005330
         EX    R3,X000844                                               00005340
         LA    R2,1(R2)                                                 00005350
         EX    R2,X00084A                                               00005360
         SRL   R2,4                                                     00005370
         AR    R7,R2                                                    00005380
         MVI   0(R7),64                                                 00005390
         SR    R7,R2                                                    00005400
         BCTR  R2,0                                                     00005410
         EX    R2,X000850                                               00005420
         LA    R6,1(R3,R6)                                              00005430
         BAL   R4,A0008F6                                               00005440
         CLC   212(1,R13),214(R13)                                      00005450
         BNH   A00082E                                                  00005460
         BAL   R4,A000C5C                                               00005470
         IC    R8,212(,R13)                                             00005480
         L     R7,208(,R13)                                             00005490
A00082E  LTR   R5,R5                                                    00005500
         BE    A0008EC                                                  00005510
         CLI   212(R13),1                                               00005520
         BNE   A0007D6                                                  00005530
         BAL   R4,A0008F6                                               00005540
         B     A0007D6                                                  00005550
X000844  MVC   72(1,R13),0(R6)                                          00005560
X00084A  UNPK  0(1,R7),72(1,R13)                                        00005570
X000850  TR    0(1,R7),A000DBD+43                                       00005580
A000856  LA    R3,4                                                     00005590
         CH    R5,A000FA4                                               00005600
         BNL   A000864                                                  00005610
         LR    R3,R5                                                    00005620
A000864  SR    R5,R3                                                    00005630
         LR    R1,R3                                                    00005640
         SR    R2,R2                                                    00005650
         XC    72(8,R13),72(R13)                                        00005660
A000870  SLL   R2,8                                                     00005670
         IC    R2,0(,R6)                                                00005680
         LA    R6,1(,R6)                                                00005690
         BCT   R1,A000870                                               00005700
         CVD   R2,72(,R13)                                              00005710
         LA    R1,3                                                     00005720
         LA    R2,76(,R13)                                              00005730
A00088C  CLI   0(R2),0                                                  00005740
         BNE   A00089C                                                  00005750
         LA    R2,1(,R2)                                                00005760
         BCT   R1,A00088C                                               00005770
A00089C  AR    R3,R3                                                    00005780
         BCTR  R3,0                                                     00005790
         SLL   R3,4                                                     00005800
         OR    R1,R3                                                    00005810
         EX    R1,X0008E6                                               00005820
         SRL   R3,4                                                     00005830
         AR    R7,R3                                                    00005840
         OI    0(R7),240                                                00005850
         SR    R7,R3                                                    00005860
         BAL   R4,A0008F6                                               00005870
         CLC   212(1,R13),214(R13)                                      00005880
         BNH   A0008D0                                                  00005890
         BAL   R4,A000C5C                                               00005900
         IC    R8,212(,R13)                                             00005910
         L     R7,208(,R13)                                             00005920
A0008D0  LTR   R5,R5                                                    00005930
         BE    A0008EC                                                  00005940
         CLI   212(R13),1                                               00005950
         BNE   A000856                                                  00005960
         BAL   R4,A0008F6                                               00005970
         B     A000856                                                  00005980
X0008E6  UNPK  0(1,R7),0(1,R2)                                          00005990
A0008EC  NI    80(R13),127                                              00006000
         LM    R2,R8,112(R13)                                           00006010
         BR    R4                                                       00006020
A0008F6  L     R7,208(,R13)                                             00006030
         LA    R7,9(,R7)                                                00006040
         IC    R8,212(,R13)                                             00006050
         LA    R8,1(,R8)                                                00006060
         STC   R8,212(,R13)                                             00006070
         TM    212(R13),1                                               00006080
         BE    A000916                                                  00006090
         LA    R7,1(,R7)                                                00006100
A000916  ST    R7,208(,R13)                                             00006110
         BR    R4                                                       00006120
A00091C  STM   R2,R5,144(R13)                                           00006130
         L     R2,268(,R13)                                             00006140
         LTR   R2,R2                                                    00006150
         BE    A000964                                                  00006160
         TM    0(R12),192                                               00006170
         BE    A00096C                                                  00006180
         BO    A000974                                                  00006190
         TM    0(R12),64                                                00006200
         BO    A000986                                                  00006210
         LA    R3,6(,R12)                                               00006220
A000942  C     R3,284(,R13)                                             00006230
         BNL   A000994                                                  00006240
         CLC   0(4,R3),A000F1A                                          00006250
         BE    A000994                                                  00006260
         ST    R12,268(,R13)                                            00006270
         ST    R3,272(,R13)                                             00006280
         LR    R12,R3                                                   00006290
A00095E  LM    R2,R5,144(R13)                                           00006300
         BR    R4                                                       00006310
A000964  ST    R12,268(,R13)                                            00006320
         B     A00095E                                                  00006330
A00096C  LA    R3,14(,R12)                                              00006340
         B     A000942                                                  00006350
A000974  SR    R3,R3                                                    00006360
         IC    R3,1(,R12)                                               00006370
         SLL   R3,1                                                     00006380
         LA    R3,12(R3,R12)                                            00006390
         B     A000942                                                  00006400
A000986  SR    R3,R3                                                    00006410
         IC    R3,1(,R12)                                               00006420
         LA    R3,2(R3,R12)                                             00006430
         B     A000942                                                  00006440
A000994  OI    81(R13),64                                               00006450
         B     A00095E                                                  00006460
A00099C  STM   R2,R5,144(R13)                                           00006470
         LR    R12,R1                                                   00006480
         TM    80(R13),32                                               00006490
         BO    A000A3C                                                  00006500
         XC    104(4,R13),104(R13)                                      00006510
         TM    0(R12),3                                                 00006520
         BO    A0009E2                                                  00006530
         BE    A000A1A                                                  00006540
         TM    0(R12),1                                                 00006550
         BO    A000A26                                                  00006560
         TM    80(R13),8                                                00006570
         BE    A000B04                                                  00006580
         L     R8,96(,R13)                                              00006590
         LTR   R8,R8                                                    00006600
         BE    A000B04                                                  00006610
         BAL   R4,A000BC2                                               00006620
         ST    R8,236(,R13)                                             00006630
         B     A000AFA                                                  00006640
A0009E2  TM    80(R13),16                                               00006650
         BE    A000B04                                                  00006660
         L     R8,100(,R13)                                             00006670
         LTR   R8,R8                                                    00006680
         BE    A000B04                                                  00006690
         LR    R2,R8                                                    00006700
         BAL   R4,A000BC2                                               00006710
         LA    R2,4095(,R2)                                             00006720
         CR    R8,R2                                                    00006730
         BH    A000A12                                                  00006740
         C     R8,100(,R13)                                             00006750
         BNH   A000A12                                                  00006760
         SR    R8,R8                                                    00006770
         LA    R1,4                                                     00006780
A000A12  ST    R8,236(,R13)                                             00006790
         B     A000AFA                                                  00006800
A000A1A  BAL   R4,A000BC2                                               00006810
         ST    R8,264(,R13)                                             00006820
         B     A000AFA                                                  00006830
A000A26  L     R8,16(,R10)                                              00006840
         BAL   R4,A000BC2                                               00006850
         LTR   R1,R1                                                    00006860
         BNE   A000AFA                                                  00006870
         ST    R8,236(,R13)                                             00006880
         B     A000AFA                                                  00006890
A000A3C  LTR   R8,R8                                                    00006900
         BE    A000AF6                                                  00006910
         SR    R1,R1                                                    00006920
         LH    R1,10(,R12)                                              00006930
         TM    0(R12),8                                                 00006940
         BE    A000A88                                                  00006950
         LA    R8,0(R1,R8)                                              00006960
         SR    R1,R1                                                    00006970
         LH    R1,276(,R13)                                             00006980
         BCTR  R1,0                                                     00006990
         STH   R1,276(,R13)                                             00007000
         LTR   R1,R1                                                    00007010
         BE    A000AF6                                                  00007020
         SR    R0,R0                                                    00007030
         TM    80(R13),1                                                00007040
         BO    A000A7C                                                  00007050
         ST    R0,220(,R13)                                             00007060
         ST    R0,224(,R13)                                             00007070
         B     A000AFA                                                  00007080
A000A7C  ST    R0,248(,R13)                                             00007090
         ST    R0,252(,R13)                                             00007100
         B     A000AFA                                                  00007110
A000A88  LTR   R1,R1                                                    00007120
         BE    A000AF6                                                  00007130
         LA    R0,0(R1,R8)                                              00007140
         LR    R1,R10                                                   00007150
         L     R15,20(,R10)                                             00007160
         BALR  R14,R15                                                  00007170
         LTR   R15,R15                                                  00007180
         BNE   A000ADE                                                  00007190
         LR    R5,R0                                                    00007200
         LR    R2,R8                                                    00007210
         L     R8,0(,R5)                                                00007220
         LA    R8,0(,R8)                                                00007230
         LTR   R8,R8                                                    00007240
         BE    A000AF6                                                  00007250
         CR    R8,R2                                                    00007260
         BE    A000AF6                                                  00007270
         L     R1,236(,R13)                                             00007280
         TM    80(R13),1                                                00007290
         BE    A000AC8                                                  00007300
         L     R1,264(,R13)                                             00007310
A000AC8  CR    R8,R1                                                    00007320
         BE    A000AF6                                                  00007330
         BAL   R4,A000B62                                               00007340
         TM    80(R13),64                                               00007350
         BO    A000A3C                                                  00007360
         B     A000AFA                                                  00007370
A000ADE  BAL   R4,A000C5C                                               00007380
         L     R1,8(,R10)                                               00007390
         MVC   0(56,R1),A000E6C                                         00007400
         MVC   56(8,R1),2(R12)                                          00007410
         BAL   R4,A000C5C                                               00007420
A000AF6  OI    81(R13),128                                              00007430
A000AFA  LM    R2,R5,144(R13)                                           00007440
         L     R12,272(,R13)                                            00007450
         BR    R4                                                       00007460
A000B04  BAL   R4,A000C5C                                               00007470
         L     R1,8(,R10)                                               00007480
         MVC   0(51,R1),A000EA4                                         00007490
         MVC   51(8,R1),2(R12)                                          00007500
         BAL   R4,A000C5C                                               00007510
         B     A000122                                                  00007520
A000B20  STM   R2,R5,160(R13)                                           00007530
         LR    R2,R1                                                    00007540
         LA    R4,A000B3E                                               00007550
         TM    0(R2),32                                                 00007560
         BO    A000C92                                                  00007570
         CLI   213(R13),51                                              00007580
         BNL   A000C92                                                  00007590
         B     A000C5C                                                  00007600
A000B3E  BAL   R4,A000C5C                                               00007610
         L     R3,8(,R10)                                               00007620
         SR    R1,R1                                                    00007630
         IC    R1,1(,R2)                                                00007640
         BCTR  R1,0                                                     00007650
         EX    R1,X000B5C                                               00007660
         BAL   R4,A000C5C                                               00007670
         LM    R2,R5,160(R13)                                           00007680
         BR    R4                                                       00007690
X000B5C  MVC   4(1,R3),2(R2)                                            00007700
A000B62  STM   R2,R5,176(R13)                                           00007710
         NI    80(R13),191                                              00007720
         L     R3,228(,R13)                                             00007730
         TM    80(R13),1                                                00007740
         BE    A000B7A                                                  00007750
         L     R3,256(,R13)                                             00007760
A000B7A  LTR   R3,R3                                                    00007770
         BE    A000BB4                                                  00007780
         LH    R1,2(,R3)                                                00007790
         LA    R0,0(R1,R8)                                              00007800
         LR    R1,R10                                                   00007810
         L     R15,20(,R10)                                             00007820
         BALR  R14,R15                                                  00007830
         LTR   R15,R15                                                  00007840
         BNE   A000BB4                                                  00007850
         LR    R5,R0                                                    00007860
         SR    R1,R1                                                    00007870
         SR    R2,R2                                                    00007880
         IC    R2,1(,R3)                                                00007890
         IC    R1,4(,R3)                                                00007900
         SLL   R1,4                                                     00007910
         EX    R2,X000BBA                                               00007920
         EX    R1,X000BBE                                               00007930
         OI    80(R13),64                                               00007940
A000BB4  LM    R2,R5,176(R13)                                           00007950
         BR    R4                                                       00007960
X000BBA  TM    0(R5),0                                                  00007970
X000BBE  NOP   A000BB4                                                  00007980
A000BC2  STM   R2,R5,176(R13)                                           00007990
         LA    R3,12(,R12)                                              00008000
         SR    R2,R2                                                    00008010
         IC    R2,1(,R12)                                               00008020
         TM    0(R12),8                                                 00008030
         BE    A000BFE                                                  00008040
         SR    R5,R5                                                    00008050
         LH    R5,12(,R12)                                              00008060
         LA    R0,0(R5,R8)                                              00008070
         LR    R1,R10                                                   00008080
         L     R15,20(,R10)                                             00008090
         BALR  R14,R15                                                  00008100
         LTR   R15,R15                                                  00008110
         BNE   A000C3A                                                  00008120
         LR    R5,R0                                                    00008130
         MVC   276(2,R13),0(R5)                                         00008140
         LA    R3,2(,R3)                                                00008150
         BCTR  R2,0                                                     00008160
A000BFE  LTR   R2,R2                                                    00008170
         BE    A000C34                                                  00008180
A000C04  SR    R1,R1                                                    00008190
         LH    R1,0(,R3)                                                00008200
         LA    R0,0(R1,R8)                                              00008210
         LR    R1,R10                                                   00008220
         L     R15,20(,R10)                                             00008230
         BALR  R14,R15                                                  00008240
         LTR   R15,R15                                                  00008250
         BNE   A000C3A                                                  00008260
         LR    R8,R0                                                    00008270
         L     R8,0(,R8)                                                00008280
         LA    R8,0(,R8)                                                00008290
         LTR   R8,R8                                                    00008300
         BE    A000C56                                                  00008310
         LA    R3,2(,R3)                                                00008320
         BCT   R2,A000C04                                               00008330
A000C34  SR    R1,R1                                                    00008340
         B     A000C56                                                  00008350
A000C3A  BAL   R4,A000C5C                                               00008360
         L     R1,8(,R10)                                               00008370
         MVC   0(55,R1),A000CFE                                         00008380
         MVC   55(8,R1),2(R12)                                          00008390
         BAL   R4,A000C5C                                               00008400
         LA    R1,4                                                     00008410
A000C56  LM    R2,R5,176(R13)                                           00008420
         BR    R4                                                       00008430
A000C5C  STM   R2,R5,192(R13)                                           00008440
         CLI   213(R13),55                                              00008450
         BNL   A000C96                                                  00008460
         LR    R1,R10                                                   00008470
         L     R15,12(,R10)                                             00008480
         BALR  R14,R15                                                  00008490
         IC    R3,213(,R13)                                             00008500
         LA    R3,1(,R3)                                                00008510
         STC   R3,213(,R13)                                             00008520
A000C7C  L     R2,8(,R10)                                               00008530
         LA    R2,7(,R2)                                                00008540
         ST    R2,208(,R13)                                             00008550
         MVI   212(R13),1                                               00008560
         LM    R2,R5,192(R13)                                           00008570
         BR    R4                                                       00008580
A000C92  STM   R2,R5,192(R13)                                           00008590
A000C96  SR    R3,R3                                                    00008600
         IC    R3,213(,R13)                                             00008610
         LA    R2,55                                                    00008620
         SR    R2,R3                                                    00008630
         BH    A000CA8                                                  00008640
         SR    R2,R2                                                    00008650
A000CA8  LA    R2,6(,R2)                                                00008660
A000CAC  LR    R1,R10                                                   00008670
         L     R15,12(,R10)                                             00008680
         BALR  R14,R15                                                  00008690
         BCT   R2,A000CAC                                               00008700
         STC   R2,213(,R13)                                             00008710
         B     A000C7C                                                  00008720
A000CC0  DC    CL28'HASPBLKS 01 PROCESSING ENDED'                       00008730
A000CDC  EQU *,34                                                       00008740
         DC    CL32'HASPBLKS 02 UNABLE TO LOAD MODUL'                   00008750
         DC    CL2'E '                                                  00008760
A000CFE  EQU *,55                                                       00008770
         DC    CL32'HASPBLKS 03 UNABLE TO ACCESS STO'                   00008780
         DC    CL23'RAGE FOR CONTROL BLOCK '                            00008790
A000D35  EQU *,47                                                       00008800
         DC    CL32'HASPBLKS 04 UNABLE TO ACCESS STO'                   00008810
         DC    CL15'RAGE FOR FIELD '                                    00008820
A000D64  EQU *,49                                                       00008830
         DC    CL32'HASPBLKS 05 FORMAT TABLE ERROR F'                   00008840
         DC    CL17'OR CONTROL BLOCK '                                  00008850
A000D95  EQU *,40                                                       00008860
         DC    CL32'HASPBLKS 05 ABOVE TABLE ERROR IN'                   00008870
         DC    CL8' MODULE '                                            00008880
A000DBD  EQU *,93                                                       00008890
         DC    CL32'HASPBLKS 07 UNEXPECTED END OF TA'                   00008900
         DC    CL11'BLE MODULE '                                        00008910
A000DE8  DC    CL6'REACHE'                                              00008920
         DC    CL32'D REPROCESSING THE FORMAT CONTRO'                   00008930
         DC    CL12'L TABLE FOR '                                       00008940
A000E1A  EQU *,82                                                       00008950
         DC    CL32'HASPBLKS 08 UNABLE TO ACCESS STO'                   00008960
         DC    CL32'RAGE OR CONTENTS INVALID FOR THE'                   00008970
         DC    CL18' LENGTH FIELD FOR '                                 00008980
A000E6C  EQU *,56                                                       00008990
         DC    CL32'HASPBLKS 09 UNABLE TO ACCESS STO'                   00009000
         DC    CL24'RAGE FOR CHAIN FIELD IN '                           00009010
A000EA4  EQU *,51                                                       00009020
         DC    CL32'HASPBLKS 10 BASE ADDRESS INVALID'                   00009030
         DC    CL19' FOR CONTROL BLOCK '                                00009040
         DC    XL1'00'                                                  00009050
         DC    CL16'0123456789ABCDEF'                                   00009060
A000EE8  DC    CL8'HASPFMT0'                                            00009070
A000EF0  DC    CL4'JES2'                                                00009080
         DC    CL1'0'                                                   00009090
A000EF5  EQU *,37                                                       00009100
         DC    CL6'012345'                                              00009110
         DC    XL1'FF'                                                  00009120
         DC    XL4'FFFFFFFF'                                            00009130
         DC    XL4'FFFFFFFF'                                            00009140
         DC    XL4'FFFFFFFF'                                            00009150
         DC    XL4'FFFFFFFF'                                            00009160
         DC    XL4'FFFFFFFF'                                            00009170
         DC    XL4'FFFFFFFF'                                            00009180
         DC    XL4'FFFFFFFF'                                            00009190
         DC    XL2'FFFF'                                                00009200
A000F1A  EQU *,4                                                        00009210
         DC    XL2'FFFF'                                                00009220
         DC    XL4'FFFF0000'                                            00009230
         DC    F'0'                                                     00009240
         DC    F'0'                                                     00009250
         DC    F'0'                                                     00009260
         DC    F'0'                                                     00009270
         DC    F'0'                                                     00009280
         DC    F'0'                                                     00009290
         DC    F'0'                                                     00009300
         DC    F'0'                                                     00009310
         DC    F'0'                                                     00009320
         DC    F'0'                                                     00009330
         DC    F'0'                                                     00009340
         DC    F'0'                                                     00009350
         DC    F'0'                                                     00009360
         DC    F'0'                                                     00009370
         DC    F'0'                                                     00009380
         DC    F'0'                                                     00009390
         DC    F'0'                                                     00009400
         DC    F'0'                                                     00009410
         DC    F'0'                                                     00009420
         DC    F'0'                                                     00009430
         DC    F'0'                                                     00009440
         DC    F'0'                                                     00009450
         DC    F'0'                                                     00009460
         DC    F'0'                                                     00009470
         DC    F'0'                                                     00009480
         DC    F'0'                                                     00009490
A000F88  DC    CL8'$SVHCT  '                                            00009500
A000F90  DC    CL8'SSCTSNAM'                                            00009510
A000F98  DC    CL8'SSCTSSVT'                                            00009520
A000FA0  DC    XL4'00200008'                                            00009530
A000FA4  EQU *,4                                                        00009540
         DC    H'0004'                                                  00009550
R0       EQU   0                                                        00009560
R1       EQU   1                                                        00009570
R2       EQU   2                                                        00009580
R3       EQU   3                                                        00009590
R4       EQU   4                                                        00009600
R5       EQU   5                                                        00009610
R6       EQU   6                                                        00009620
R7       EQU   7                                                        00009630
R8       EQU   8                                                        00009640
R9       EQU   9                                                        00009650
R10      EQU   10                                                       00009660
R11      EQU   11                                                       00009670
R12      EQU   12                                                       00009680
R13      EQU   13                                                       00009690
R14      EQU   14                                                       00009700
R15      EQU   15                                                       00009710
         END                                                            00009720
