*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
HASPFMT2 CSECT                                                          00000060
         DC    CL1'-'                                                   00000070
         DC    XL1'1E'                                                  00000080
         DC    CL31'HASP MODULE DIRECTORY (MODMAP)C'                    00000090
         DC    XL1'01'                                                  00000100
         DC    CL8'MAP     '                                            00000110
         DC    H'0'                                                     00000120
         DC    XL4'00081000'                                            00000130
         DC    CL8'HASPACCT'                                            00000140
         DC    XL4'00180004'                                            00000150
         DC    H'0'                                                     00000160
         DC    CL8'HASPCOMM'                                            00000170
         DC    H'0056'                                                  00000180
         DC    XL4'00040000'                                            00000190
         DC    CL8'HASPCON '                                            00000200
         DC    XL4'00480004'                                            00000210
         DC    H'0'                                                     00000220
         DC    CL8'HASPINIT'                                            00000230
         DC    H'0088'                                                  00000240
         DC    XL4'00040000'                                            00000250
         DC    CL8'HASPMISC'                                            00000260
         DC    XL4'00680004'                                            00000270
         DC    H'0'                                                     00000280
         DC    CL8'HASPNUC '                                            00000290
         DC    H'0120'                                                  00000300
         DC    XL4'00040000'                                            00000310
         DC    CL8'HASPPRPU'                                            00000320
         DC    XL1'00'                                                  00000330
         DC    CL1'h'                                                   00000340
         DC    H'0004'                                                  00000350
         DC    H'0'                                                     00000360
         DC    CL8'HASPRDR '                                            00000370
         DC    XL1'00'                                                  00000380
         DC    CL1'q'                                                   00000390
         DC    XL4'00040000'                                            00000400
         DC    CL8'HASPRTAM'                                            00000410
         DC    XL1'00'                                                  00000420
         DC    CL1'H'                                                   00000430
         DC    H'0004'                                                  00000440
         DC    H'0'                                                     00000450
         DC    CL8'HASPSSSM'                                            00000460
         DC    XL1'00'                                                  00000470
         DC    CL1'Q'                                                   00000480
         DC    XL4'00040000'                                            00000490
         DC    CL8'HASPSSVT'                                            00000500
         DC    XL1'00'                                                  00000510
         DC    CL1'Y'                                                   00000520
         DC    H'0004'                                                  00000530
         DC    CL1' '                                                   00000540
         DC    XL1'1E'                                                  00000550
         DC    CL31'HASP COMMUNICATION TABLE (HCT)C'                    00000560
         DC    XL1'00'                                                  00000570
         DC    CL8'HCT     '                                            00000580
         DC    H'0'                                                     00000590
         DC    H'4352'                                                  00000600
         DC    CL8'$VERSION'                                            00000610
         DC    H'0'                                                     00000620
         DC    XL4'00080000'                                            00000630
         DC    CL8'$HASPMAP'                                            00000640
         DC    XL4'00080004'                                            00000650
         DC    H'0'                                                     00000660
         DC    CL8'$PTFMAP '                                            00000670
         DC    H'0012'                                                  00000680
         DC    H'0004'                                                  00000690
         DC    CL1' '                                                   00000700
         DC    XL1'20'                                                  00000710
         DC    CL32'ENTRIES TO HASP SERVICE ROUTINES'                   00000720
         DC    H'4096'                                                  00000730
         DC    CL8'$GETBUF '                                            00000740
         DC    H'0032'                                                  00000750
         DC    XL4'00040000'                                            00000760
         DC    CL8'$FREEBUF'                                            00000770
         DC    XL4'00240004'                                            00000780
         DC    H'0'                                                     00000790
         DC    CL8'$DYNADDR'                                            00000800
         DC    H'0048'                                                  00000810
         DC    XL4'00040000'                                            00000820
         DC    CL8'$XMPOST '                                            00000830
         DC    XL4'00340004'                                            00000840
         DC    H'0'                                                     00000850
         DC    CL8'$JCAN   '                                            00000860
         DC    H'0056'                                                  00000870
         DC    XL4'00040000'                                            00000880
         DC    CL8'$BFRBLD '                                            00000890
         DC    XL4'003C0004'                                            00000900
         DC    H'0'                                                     00000910
         DC    CL8'$VFL    '                                            00000920
         DC    XL1'00'                                                  00000930
         DC    CL1' '                                                   00000940
         DC    XL4'00040000'                                            00000950
         DC    CL8'$JCTRDR '                                            00000960
         DC    XL1'00'                                                  00000970
         DC    CL1'%'                                                   00000980
         DC    H'0004'                                                  00000990
         DC    H'0'                                                     00001000
         DC    CL8'$JCTWTR '                                            00001010
         DC    H'0112'                                                  00001020
         DC    XL4'00040000'                                            00001030
         DC    CL8'$JCTFRE '                                            00001040
         DC    XL4'00740004'                                            00001050
         DC    H'0'                                                     00001060
         DC    CL8'$JOECKPA'                                            00001070
         DC    H'0120'                                                  00001080
         DC    XL4'00040000'                                            00001090
         DC    CL8'$JOEOFFA'                                            00001100
         DC    XL1'00'                                                  00001110
         DC    CL1'@'                                                   00001120
         DC    H'0004'                                                  00001130
         DC    H'0'                                                     00001140
         DC    CL8'$JOEADD '                                            00001150
         DC    H'0128'                                                  00001160
         DC    XL4'00040000'                                            00001170
         DC    CL8'$JOEBLD '                                            00001180
         DC    XL1'00'                                                  00001190
         DC    CL1'd'                                                   00001200
         DC    H'0004'                                                  00001210
         DC    H'0'                                                     00001220
         DC    CL8'$JOECAN '                                            00001230
         DC    XL1'00'                                                  00001240
         DC    CL1'h'                                                   00001250
         DC    XL4'00040000'                                            00001260
         DC    CL8'$JOEGET '                                            00001270
         DC    XL4'008C0004'                                            00001280
         DC    H'0'                                                     00001290
         DC    CL8'$JOEPUT '                                            00001300
         DC    H'0144'                                                  00001310
         DC    XL4'00040000'                                            00001320
         DC    CL8'$JOEREM '                                            00001330
         DC    XL1'00'                                                  00001340
         DC    CL1'm'                                                   00001350
         DC    H'0004'                                                  00001360
         DC    H'0'                                                     00001370
         DC    CL8'$TRACK  '                                            00001380
         DC    H'0156'                                                  00001390
         DC    XL4'00040000'                                            00001400
         DC    CL8'$WTO    '                                            00001410
         DC    XL1'00'                                                  00001420
         DC    CL1'u'                                                   00001430
         DC    H'0004'                                                  00001440
         DC    H'0'                                                     00001450
         DC    CL8'$WTOC   '                                            00001460
         DC    XL1'00'                                                  00001470
         DC    CL1'y'                                                   00001480
         DC    XL4'00040000'                                            00001490
         DC    CL8'$$WTO   '                                            00001500
         DC    XL4'00AC0004'                                            00001510
         DC    H'0'                                                     00001520
         DC    CL8'$DOM    '                                            00001530
         DC    H'0176'                                                  00001540
         DC    XL4'00040000'                                            00001550
         DC    CL8'$GETCMB '                                            00001560
         DC    XL4'00B40004'                                            00001570
         DC    H'0'                                                     00001580
         DC    CL8'$FRECMB '                                            00001590
         DC    H'0184'                                                  00001600
         DC    XL4'00040000'                                            00001610
         DC    CL8'$RESERVA'                                            00001620
         DC    XL4'00BC0004'                                            00001630
         DC    H'0'                                                     00001640
         DC    CL8'$RELEASA'                                            00001650
         DC    H'0192'                                                  00001660
         DC    XL4'00040000'                                            00001670
         DC    CL8'$EXTP   '                                            00001680
         DC    XL1'00'                                                  00001690
         DC    CL1'H'                                                   00001700
         DC    H'0004'                                                  00001710
         DC    H'0'                                                     00001720
         DC    CL8'$STIMERA'                                            00001730
         DC    XL1'00'                                                  00001740
         DC    CL1'M'                                                   00001750
         DC    XL4'00040000'                                            00001760
         DC    CL8'$TTIMERA'                                            00001770
         DC    XL1'00'                                                  00001780
         DC    CL1'Q'                                                   00001790
         DC    H'0004'                                                  00001800
         DC    H'0'                                                     00001810
         DC    CL8'$IOERROR'                                            00001820
         DC    H'0220'                                                  00001830
         DC    XL4'00040000'                                            00001840
         DC    CL8'$ERROR  '                                            00001850
         DC    XL4'00E00004'                                            00001860
         DC    H'0'                                                     00001870
         DC    CL8'$DISTERR'                                            00001880
         DC    XL1'00'                                                  00001890
         DC    CL1'U'                                                   00001900
         DC    XL4'00040000'                                            00001910
         DC    CL8'$GETCEL '                                            00001920
         DC    XL1'00'                                                  00001930
         DC    CL1'Y'                                                   00001940
         DC    H'0004'                                                  00001950
         DC    H'0'                                                     00001960
         DC    CL8'$FRECEL '                                            00001970
         DC    H'0236'                                                  00001980
         DC    XL4'00040000'                                            00001990
         DC    CL8'$GETLOK '                                            00002000
         DC    XL1'00'                                                  00002010
         DC    CL1'0'                                                   00002020
         DC    H'0004'                                                  00002030
         DC    H'0'                                                     00002040
         DC    CL8'$FRELOK '                                            00002050
         DC    XL1'00'                                                  00002060
         DC    CL1'4'                                                   00002070
         DC    XL4'00040000'                                            00002080
         DC    CL8'$PGRLSE '                                            00002090
         DC    XL1'00'                                                  00002100
         DC    CL1'8'                                                   00002110
         DC    H'0004'                                                  00002120
         DC    H'0'                                                     00002130
         DC    CL8'$PGFREE '                                            00002140
         DC    H'0252'                                                  00002150
         DC    XL4'00040000'                                            00002160
         DC    CL8'$PGFIX  '                                            00002170
         DC    XL4'01000004'                                            00002180
         DC    CL1' '                                                   00002190
         DC    XL1'1C'                                                  00002200
         DC    CL28'HASP SUB-TASK CONTROL BLOCKS'                       00002210
         DC    H'4096'                                                  00002220
         DC    CL8'$WTOTCBA'                                            00002230
         DC    XL4'01040004'                                            00002240
         DC    H'0'                                                     00002250
         DC    CL8'$WTOPECB'                                            00002260
         DC    H'0264'                                                  00002270
         DC    XL4'00040000'                                            00002280
         DC    CL8'$WTOECB '                                            00002290
         DC    XL4'010C0004'                                            00002300
         DC    H'0'                                                     00002310
         DC    CL8'$CNVTCBA'                                            00002320
         DC    H'0272'                                                  00002330
         DC    XL4'00040000'                                            00002340
         DC    CL8'$PCNVECB'                                            00002350
         DC    XL4'01140004'                                            00002360
         DC    H'0'                                                     00002370
         DC    CL8'$CNVECB '                                            00002380
         DC    H'0280'                                                  00002390
         DC    XL4'00040000'                                            00002400
         DC    CL8'$SMFTCBA'                                            00002410
         DC    XL4'011C0004'                                            00002420
         DC    H'0'                                                     00002430
         DC    CL8'$PSMFECB'                                            00002440
         DC    H'0288'                                                  00002450
         DC    XL4'00040000'                                            00002460
         DC    CL8'$ACCTECB'                                            00002470
         DC    XL4'01240004'                                            00002480
         DC    H'0'                                                     00002490
         DC    CL8'$IMAGTCB'                                            00002500
         DC    H'0296'                                                  00002510
         DC    XL4'00040000'                                            00002520
         DC    CL8'$PIMGECB'                                            00002530
         DC    XL4'012C0004'                                            00002540
         DC    H'0'                                                     00002550
         DC    CL8'$IMAGECB'                                            00002560
         DC    H'0304'                                                  00002570
         DC    XL4'00040000'                                            00002580
         DC    CL8'$SNATCBA'                                            00002590
         DC    XL4'01340004'                                            00002600
         DC    H'0'                                                     00002610
         DC    CL8'$PSNAECB'                                            00002620
         DC    H'0312'                                                  00002630
         DC    XL4'00040000'                                            00002640
         DC    CL8'$SNAECB '                                            00002650
         DC    XL4'013C0004'                                            00002660
         DC    H'0'                                                     00002670
         DC    CL8'$DYNTCBA'                                            00002680
         DC    XL1'01'                                                  00002690
         DC    CL1' '                                                   00002700
         DC    XL4'00040000'                                            00002710
         DC    CL8'$PDYNECB'                                            00002720
         DC    XL4'01440004'                                            00002730
         DC    H'0'                                                     00002740
         DC    CL8'$DYNECB '                                            00002750
         DC    H'0328'                                                  00002760
         DC    H'0004'                                                  00002770
         DC    CL1' '                                                   00002780
         DC    XL1'1C'                                                  00002790
         DC    CL28'HASP CONTROL BLOCK DIRECTORY'                       00002800
         DC    H'4096'                                                  00002810
         DC    CL8'$SSVT   '                                            00002820
         DC    XL1'01'                                                  00002830
         DC    CL1'&&'                                                  00002840
         DC    XL4'00040000'                                            00002850
         DC    CL8'$HASPTCB'                                            00002860
         DC    XL4'01540004'                                            00002870
         DC    H'0'                                                     00002880
         DC    CL8'$HASPECB'                                            00002890
         DC    H'0344'                                                  00002900
         DC    XL4'00040000'                                            00002910
         DC    CL8'$RSVECBA'                                            00002920
         DC    XL1'01'                                                  00002930
         DC    CL1'*'                                                   00002940
         DC    H'0001'                                                  00002950
         DC    H'0'                                                     00002960
         DC    CL8'$HASCB  '                                            00002970
         DC    XL1'01'                                                  00002980
         DC    CL1'-'                                                   00002990
         DC    XL4'00040000'                                            00003000
         DC    CL8'$HASPDCB'                                            00003010
         DC    XL4'01640004'                                            00003020
         DC    H'0'                                                     00003030
         DC    CL8'$DADEBAD'                                            00003040
         DC    H'0360'                                                  00003050
         DC    XL4'00040000'                                            00003060
         DC    CL8'$JOBQBUF'                                            00003070
         DC    XL1'01'                                                  00003080
         DC    CL1'%'                                                   00003090
         DC    H'0004'                                                  00003100
         DC    H'0'                                                     00003110
         DC    CL8'$TEDADDR'                                            00003120
         DC    H'0368'                                                  00003130
         DC    XL4'00040000'                                            00003140
         DC    CL8'$PCEORG '                                            00003150
         DC    XL4'01740004'                                            00003160
         DC    H'0'                                                     00003170
         DC    CL8'$PCELAST'                                            00003180
         DC    H'0376'                                                  00003190
         DC    XL4'00040000'                                            00003200
         DC    CL8'$BFRMAP '                                            00003210
         DC    XL1'01'                                                  00003220
         DC    CL1'@'                                                   00003230
         DC    H'0004'                                                  00003240
         DC    H'0'                                                     00003250
         DC    CL8'$TPBFMAP'                                            00003260
         DC    H'0384'                                                  00003270
         DC    XL4'00040000'                                            00003280
         DC    CL8'$PGBFMAP'                                            00003290
         DC    XL1'01'                                                  00003300
         DC    CL1'd'                                                   00003310
         DC    H'0004'                                                  00003320
         DC    H'0'                                                     00003330
         DC    CL8'$PPBFMAP'                                            00003340
         DC    XL1'01'                                                  00003350
         DC    CL1'h'                                                   00003360
         DC    XL4'00040000'                                            00003370
         DC    CL8'$DCTPOOL'                                            00003380
         DC    XL4'018C0004'                                            00003390
         DC    H'0'                                                     00003400
         DC    CL8'$RDRDCT '                                            00003410
         DC    H'0400'                                                  00003420
         DC    XL4'00040000'                                            00003430
         DC    CL8'$PRTDCT '                                            00003440
         DC    XL1'01'                                                  00003450
         DC    CL1'm'                                                   00003460
         DC    H'0004'                                                  00003470
         DC    H'0'                                                     00003480
         DC    CL8'$PUNDCT '                                            00003490
         DC    XL1'01'                                                  00003500
         DC    CL1'q'                                                   00003510
         DC    XL4'00040000'                                            00003520
         DC    CL8'$LNEDCT '                                            00003530
         DC    XL4'019C0004'                                            00003540
         DC    H'0'                                                     00003550
         DC    CL8'$LOGNDCT'                                            00003560
         DC    H'0416'                                                  00003570
         DC    XL4'00040000'                                            00003580
         DC    CL8'$XEQDCT '                                            00003590
         DC    XL1'01'                                                  00003600
         DC    CL1'u'                                                   00003610
         DC    H'0004'                                                  00003620
         DC    H'0'                                                     00003630
         DC    CL8'$INRDCT '                                            00003640
         DC    H'0428'                                                  00003650
         DC    XL4'00040000'                                            00003660
         DC    CL8'$SMFFREE'                                            00003670
         DC    XL4'01B40004'                                            00003680
         DC    H'0'                                                     00003690
         DC    CL8'$SMFBUSY'                                            00003700
         DC    H'0440'                                                  00003710
         DC    XL4'00040000'                                            00003720
         DC    CL8'$#JCTQ  '                                            00003730
         DC    XL4'01BC0004'                                            00003740
         DC    H'0'                                                     00003750
         DC    CL8'$JOBQPTR'                                            00003760
         DC    H'0448'                                                  00003770
         DC    XL4'00040000'                                            00003780
         DC    CL8'$JQB    '                                            00003790
         DC    XL1'01'                                                  00003800
         DC    CL1'D'                                                   00003810
         DC    H'0004'                                                  00003820
         DC    H'0'                                                     00003830
         DC    CL8'$MASTER '                                            00003840
         DC    XL1'01'                                                  00003850
         DC    CL1'H'                                                   00003860
         DC    XL4'00040000'                                            00003870
         DC    CL8'$MASTERI'                                            00003880
         DC    XL4'01CC0004'                                            00003890
         DC    H'0'                                                     00003900
         DC    CL8'$RQSE   '                                            00003910
         DC    H'0464'                                                  00003920
         DC    XL4'00040000'                                            00003930
         DC    CL8'$JOBQIO '                                            00003940
         DC    XL1'01'                                                  00003950
         DC    CL1'M'                                                   00003960
         DC    H'0004'                                                  00003970
         DC    H'0'                                                     00003980
         DC    CL8'$JOTIO  '                                            00003990
         DC    XL1'01'                                                  00004000
         DC    CL1'Q'                                                   00004010
         DC    XL4'00040000'                                            00004020
         DC    CL8'$QSE1   '                                            00004030
         DC    XL4'01DC0004'                                            00004040
         DC    H'0'                                                     00004050
         DC    CL8'$TGMAP  '                                            00004060
         DC    XL1'01'                                                  00004070
         DC    CL1'U'                                                   00004080
         DC    XL4'00040000'                                            00004090
         DC    CL8'$RATABLE'                                            00004100
         DC    XL1'01'                                                  00004110
         DC    CL1'0'                                                   00004120
         DC    H'0004'                                                  00004130
         DC    H'0'                                                     00004140
         DC    CL8'$RMTSON '                                            00004150
         DC    XL1'01'                                                  00004160
         DC    CL1'4'                                                   00004170
         DC    XL4'00040000'                                            00004180
         DC    CL8'$ICETRAY'                                            00004190
         DC    XL1'01'                                                  00004200
         DC    CL1'8'                                                   00004210
         DC    H'0004'                                                  00004220
         DC    H'0'                                                     00004230
         DC    CL8'$CPTPOOL'                                            00004240
         DC    H'0508'                                                  00004250
         DC    XL4'00040000'                                            00004260
         DC    CL8'$MSPOOLQ'                                            00004270
         DC    XL4'02040004'                                            00004280
         DC    H'0'                                                     00004290
         DC    CL8'$MCONMSG'                                            00004300
         DC    H'0520'                                                  00004310
         DC    XL4'00040000'                                            00004320
         DC    CL8'$DACKPT '                                            00004330
         DC    XL4'02100004'                                            00004340
         DC    H'0'                                                     00004350
         DC    CL8'$RTIMTAB'                                            00004360
         DC    H'0532'                                                  00004370
         DC    XL4'00040000'                                            00004380
         DC    CL8'$XPRITAB'                                            00004390
         DC    XL4'02180004'                                            00004400
         DC    H'0'                                                     00004410
         DC    CL8'$AQSE   '                                            00004420
         DC    H'0544'                                                  00004430
         DC    XL4'00040000'                                            00004440
         DC    CL8'$ESYSQSE'                                            00004450
         DC    XL4'02240004'                                            00004460
         DC    H'0'                                                     00004470
         DC    CL8'$OQUEUE '                                            00004480
         DC    H'0552'                                                  00004490
         DC    XL4'00040000'                                            00004500
         DC    CL8'$ACTABLE'                                            00004510
         DC    XL4'02340004'                                            00004520
         DC    H'0'                                                     00004530
         DC    CL8'$PITABLE'                                            00004540
         DC    H'0568'                                                  00004550
         DC    XL4'00040000'                                            00004560
         DC    CL8'$JOTABLE'                                            00004570
         DC    XL4'023C0004'                                            00004580
         DC    H'0'                                                     00004590
         DC    CL8'$TQEQUE '                                            00004600
         DC    XL1'02'                                                  00004610
         DC    CL1' '                                                   00004620
         DC    XL4'00040000'                                            00004630
         DC    CL8'$ASYNCQ '                                            00004640
         DC    XL4'02440004'                                            00004650
         DC    H'0'                                                     00004660
         DC    CL8'$ASYPCIQ'                                            00004670
         DC    H'0584'                                                  00004680
         DC    XL4'00040000'                                            00004690
         DC    CL8'$RJECHEQ'                                            00004700
         DC    XL1'02'                                                  00004710
         DC    CL1'<'                                                   00004720
         DC    H'0004'                                                  00004730
         DC    H'0'                                                     00004740
         DC    CL8'$VLOGQUE'                                            00004750
         DC    XL1'02'                                                  00004760
         DC    CL1'&&'                                                  00004770
         DC    XL4'00040000'                                            00004780
         DC    CL8'$CTLB   '                                            00004790
         DC    XL4'02540004'                                            00004800
         DC    H'0'                                                     00004810
         DC    CL8'$CTLBIO '                                            00004820
         DC    H'0600'                                                  00004830
         DC    XL4'00040000'                                            00004840
         DC    CL8'$CATABLE'                                            00004850
         DC    XL1'02'                                                  00004860
         DC    CL1'*'                                                   00004870
         DC    H'0004'                                                  00004880
         DC    H'0'                                                     00004890
         DC    CL8'$CCAREA '                                            00004900
         DC    XL1'02'                                                  00004910
         DC    CL1'-'                                                   00004920
         DC    XL4'00040000'                                            00004930
         DC    CL8'$CSAREA '                                            00004940
         DC    XL4'02640004'                                            00004950
         DC    H'0'                                                     00004960
         DC    CL8'$BUSYRQ '                                            00004970
         DC    H'0616'                                                  00004980
         DC    XL4'00040000'                                            00004990
         DC    CL8'$BUSYQUE'                                            00005000
         DC    XL1'02'                                                  00005010
         DC    CL1'%'                                                   00005020
         DC    H'0004'                                                  00005030
         DC    H'0'                                                     00005040
         DC    CL8'$CONWKQ '                                            00005050
         DC    H'0624'                                                  00005060
         DC    XL4'00040000'                                            00005070
         DC    CL8'$COMMQUE'                                            00005080
         DC    XL4'02740004'                                            00005090
         DC    H'0'                                                     00005100
         DC    CL8'$DOMQUE '                                            00005110
         DC    H'0632'                                                  00005120
         DC    XL4'00040000'                                            00005130
         DC    CL8'$DOMQUEA'                                            00005140
         DC    XL1'02'                                                  00005150
         DC    CL1'@'                                                   00005160
         DC    H'0004'                                                  00005170
         DC    H'0'                                                     00005180
         DC    CL8'$WCOMRES'                                            00005190
         DC    H'0640'                                                  00005200
         DC    XL4'00040000'                                            00005210
         DC    CL8'$MWORK  '                                            00005220
         DC    XL1'02'                                                  00005230
         DC    CL1'd'                                                   00005240
         DC    H'0004'                                                  00005250
         DC    CL1' '                                                   00005260
         DC    XL1'1E'                                                  00005270
         DC    CL30'HASP CONFIGURATION CONSTRAINTS'                     00005280
         DC    H'4608'                                                  00005290
         DC    CL8'$NUMRDRS'                                            00005300
         DC    XL1'02'                                                  00005310
         DC    CL1'h'                                                   00005320
         DC    F'66048'                                                 00005330
         DC    CL8'$NUMPRTS'                                            00005340
         DC    XL1'02'                                                  00005350
         DC    CL1'i'                                                   00005360
         DC    H'0001'                                                  00005370
         DC    H'0512'                                                  00005380
         DC    CL8'$NUMPUNS'                                            00005390
         DC    H'0650'                                                  00005400
         DC    F'66048'                                                 00005410
         DC    CL8'$NUMINRS'                                            00005420
         DC    XL4'028B0001'                                            00005430
         DC    H'0512'                                                  00005440
         DC    CL8'$NUMTPRD'                                            00005450
         DC    H'0652'                                                  00005460
         DC    XL4'00020200'                                            00005470
         DC    CL8'$NUMTPPR'                                            00005480
         DC    XL4'028E0002'                                            00005490
         DC    H'0512'                                                  00005500
         DC    CL8'$NUMTPPU'                                            00005510
         DC    H'0656'                                                  00005520
         DC    XL4'00020200'                                            00005530
         DC    CL8'$NUMLNES'                                            00005540
         DC    XL1'02'                                                  00005550
         DC    CL1'k'                                                   00005560
         DC    H'0002'                                                  00005570
         DC    H'0512'                                                  00005580
         DC    CL8'$NUMLOGS'                                            00005590
         DC    XL1'02'                                                  00005600
         DC    CL1'm'                                                   00005610
         DC    XL4'00020200'                                            00005620
         DC    CL8'$NUMCPTS'                                            00005630
         DC    XL1'02'                                                  00005640
         DC    CL1'o'                                                   00005650
         DC    H'0002'                                                  00005660
         DC    CL1' '                                                   00005670
         DC    XL1'1A'                                                  00005680
         DC    CL26'HASP OPERATING CONSTRAINTS'                         00005690
         DC    H'4608'                                                  00005700
         DC    CL8'$PRIRATE'                                            00005710
         DC    H'0670'                                                  00005720
         DC    XL4'00020200'                                            00005730
         DC    CL8'$PRIHIGH'                                            00005740
         DC    XL4'02A00001'                                            00005750
         DC    H'0512'                                                  00005760
         DC    CL8'$PRILOW '                                            00005770
         DC    H'0673'                                                  00005780
         DC    F'66048'                                                 00005790
         DC    CL8'$BLBTGBA'                                            00005800
         DC    XL1'02'                                                  00005810
         DC    CL1's'                                                   00005820
         DC    H'0001'                                                  00005830
         DC    H'0'                                                     00005840
         DC    CL8'$BLBFLAG'                                            00005850
         DC    XL1'02'                                                  00005860
         DC    CL1't'                                                   00005870
         DC    F'66048'                                                 00005880
         DC    CL8'$SYNCTOL'                                            00005890
         DC    XL1'02'                                                  00005900
         DC    CL1'u'                                                   00005910
         DC    H'0004'                                                  00005920
         DC    H'0512'                                                  00005930
         DC    CL8'$CKPTIME'                                            00005940
         DC    XL1'02'                                                  00005950
         DC    CL1'y'                                                   00005960
         DC    XL4'00040000'                                            00005970
         DC    CL8'$DELAYTM'                                            00005980
         DC    XL4'02AC0004'                                            00005990
         DC    H'0'                                                     00006000
         DC    CL8'$WARNTIM'                                            00006010
         DC    H'0688'                                                  00006020
         DC    XL4'00040000'                                            00006030
         DC    CL8'$MINHOLD'                                            00006040
         DC    XL4'02B40004'                                            00006050
         DC    H'0'                                                     00006060
         DC    CL8'$MINDORM'                                            00006070
         DC    H'0696'                                                  00006080
         DC    XL4'00040000'                                            00006090
         DC    CL8'$MAXDORM'                                            00006100
         DC    XL4'02BC0004'                                            00006110
         DC    H'0'                                                     00006120
         DC    CL8'$OPTSTAT'                                            00006130
         DC    XL1'02'                                                  00006140
         DC    CL1'H'                                                   00006150
         DC    F'65536'                                                 00006160
         DC    CL8'$RUNOPTS'                                            00006170
         DC    XL1'02'                                                  00006180
         DC    CL1'I'                                                   00006190
         DC    H'0001'                                                  00006200
         DC    H'0'                                                     00006210
         DC    CL8'$PRTOPTS'                                            00006220
         DC    H'0714'                                                  00006230
         DC    F'65536'                                                 00006240
         DC    CL8'$RJEOPTS'                                            00006250
         DC    XL4'02CB0001'                                            00006260
         DC    H'0'                                                     00006270
         DC    CL8'$RJOBOPT'                                            00006280
         DC    H'0716'                                                  00006290
         DC    F'65536'                                                 00006300
         DC    CL8'$OUTPOPT'                                            00006310
         DC    XL4'02CD0001'                                            00006320
         DC    H'0'                                                     00006330
         DC    CL8'$NUMTGBE'                                            00006340
         DC    H'0718'                                                  00006350
         DC    F'66048'                                                 00006360
         DC    CL8'$LINECT '                                            00006370
         DC    XL4'02CF0001'                                            00006380
         DC    H'0512'                                                  00006390
         DC    CL8'$ESTIME '                                            00006400
         DC    H'0720'                                                  00006410
         DC    XL4'00020200'                                            00006420
         DC    CL8'$ESTLNCT'                                            00006430
         DC    XL1'02'                                                  00006440
         DC    CL1'K'                                                   00006450
         DC    H'0002'                                                  00006460
         DC    H'0512'                                                  00006470
         DC    CL8'$ESTPUN '                                            00006480
         DC    XL1'02'                                                  00006490
         DC    CL1'M'                                                   00006500
         DC    XL4'00040200'                                            00006510
         DC    CL8'$OUTXS  '                                            00006520
         DC    XL1'02'                                                  00006530
         DC    CL1'Q'                                                   00006540
         DC    H'0004'                                                  00006550
         DC    H'0512'                                                  00006560
         DC    CL8'$WAITIME'                                            00006570
         DC    H'0732'                                                  00006580
         DC    XL4'00020200'                                            00006590
         DC    CL8'$TGWARN '                                            00006600
         DC    XL4'02DE0001'                                            00006610
         DC    H'0512'                                                  00006620
         DC    CL8'$TIMEXS '                                            00006630
         DC    H'0735'                                                  00006640
         DC    H'0001'                                                  00006650
         DC    CL1' '                                                   00006660
         DC    XL1'1A'                                                  00006670
         DC    CL26'HASP INTERNAL CONSTRAINTS '                         00006680
         DC    H'4352'                                                  00006690
         DC    CL8'$DSNPRFX'                                            00006700
         DC    XL4'02E00008'                                            00006710
         DC    H'0256'                                                  00006720
         DC    CL8'$XBATCHN'                                            00006730
         DC    XL1'02'                                                  00006740
         DC    CL1'Y'                                                   00006750
         DC    XL4'00050100'                                            00006760
         DC    CL8'$CCOMCHR'                                            00006770
         DC    XL4'02ED0001'                                            00006780
         DC    H'0256'                                                  00006790
         DC    CL8'$RCOMCHR'                                            00006800
         DC    H'0750'                                                  00006810
         DC    F'65536'                                                 00006820
         DC    CL8'$BSPACE '                                            00006830
         DC    XL4'02EF0001'                                            00006840
         DC    H'0256'                                                  00006850
         DC    CL8'$STDFORM'                                            00006860
         DC    XL1'02'                                                  00006870
         DC    CL1'0'                                                   00006880
         DC    XL4'00040100'                                            00006890
         DC    CL8'$PRTFCB '                                            00006900
         DC    XL1'02'                                                  00006910
         DC    CL1'4'                                                   00006920
         DC    H'0004'                                                  00006930
         DC    H'0256'                                                  00006940
         DC    CL8'$PRTUCS '                                            00006950
         DC    XL1'02'                                                  00006960
         DC    CL1'8'                                                   00006970
         DC    XL4'00040100'                                            00006980
         DC    CL8'$NIPFCB '                                            00006990
         DC    XL4'02FC0004'                                            00007000
         DC    H'0256'                                                  00007010
         DC    CL8'$NIPUCS '                                            00007020
         DC    H'0768'                                                  00007030
         DC    XL4'00040200'                                            00007040
         DC    CL8'$NUMBUF '                                            00007050
         DC    XL4'03040002'                                            00007060
         DC    H'0512'                                                  00007070
         DC    CL8'$NUMTPBF'                                            00007080
         DC    H'0774'                                                  00007090
         DC    XL4'00020200'                                            00007100
         DC    CL8'$TPBFSIZ'                                            00007110
         DC    XL4'03080002'                                            00007120
         DC    H'0512'                                                  00007130
         DC    CL8'$MLBFSIZ'                                            00007140
         DC    H'0778'                                                  00007150
         DC    XL4'00020200'                                            00007160
         DC    CL8'$BFSZBSC'                                            00007170
         DC    XL4'030C0002'                                            00007180
         DC    H'0512'                                                  00007190
         DC    CL8'$BFSZSNA'                                            00007200
         DC    H'0782'                                                  00007210
         DC    XL4'00020000'                                            00007220
         DC    CL8'$MAXSESS'                                            00007230
         DC    XL4'03100002'                                            00007240
         DC    H'0512'                                                  00007250
         DC    CL8'$NUMCMBS'                                            00007260
         DC    H'0786'                                                  00007270
         DC    XL4'00020200'                                            00007280
         DC    CL8'$NUMSMFB'                                            00007290
         DC    XL4'03140001'                                            00007300
         DC    H'0512'                                                  00007310
         DC    CL8'$NOPRCCW'                                            00007320
         DC    H'0789'                                                  00007330
         DC    F'66048'                                                 00007340
         DC    CL8'$NOPUCCW'                                            00007350
         DC    XL4'03160001'                                            00007360
         DC    H'0512'                                                  00007370
         DC    CL8'$PRIDCT '                                            00007380
         DC    H'0791'                                                  00007390
         DC    F'66048'                                                 00007400
         DC    CL8'$TPIDCT '                                            00007410
         DC    XL4'03180001'                                            00007420
         DC    H'0512'                                                  00007430
         DC    CL8'$NUMCLAS'                                            00007440
         DC    H'0793'                                                  00007450
         DC    F'66048'                                                 00007460
         DC    CL8'$BSPGCT '                                            00007470
         DC    XL4'031A0001'                                            00007480
         DC    H'0512'                                                  00007490
         DC    CL8'$BSPNTE '                                            00007500
         DC    H'0795'                                                  00007510
         DC    F'66048'                                                 00007520
         DC    CL8'$BSPSIZ '                                            00007530
         DC    XL4'031C0002'                                            00007540
         DC    H'0512'                                                  00007550
         DC    CL8'$#JCTQCT'                                            00007560
         DC    H'0798'                                                  00007570
         DC    XL4'00020200'                                            00007580
         DC    CL8'$JCOPYLM'                                            00007590
         DC    XL4'03200001'                                            00007600
         DC    H'0512'                                                  00007610
         DC    CL8'$MAXCLAS'                                            00007620
         DC    H'0801'                                                  00007630
         DC    F'65536'                                                 00007640
         DC    CL8'$HTDIST '                                            00007650
         DC    XL4'03220002'                                            00007660
         DC    H'0512'                                                  00007670
         DC    CL8'$NUMACE '                                            00007680
         DC    H'0804'                                                  00007690
         DC    XL4'00020200'                                            00007700
         DC    CL8'$MAXPART'                                            00007710
         DC    XL4'03260002'                                            00007720
         DC    H'0512'                                                  00007730
         DC    CL8'$LIRCT  '                                            00007740
         DC    H'0808'                                                  00007750
         DC    XL4'00020200'                                            00007760
         DC    CL8'$DPXRATE'                                            00007770
         DC    XL4'032A0002'                                            00007780
         DC    H'0512'                                                  00007790
         DC    CL8'$RETRYCT'                                            00007800
         DC    H'0812'                                                  00007810
         DC    H'0002'                                                  00007820
         DC    CL1' '                                                   00007830
         DC    XL1'22'                                                  00007840
         DC    CL32'MISCELLANEOUS HASP CONTROL FIELD'                   00007850
         DC    CL2'S '                                                  00007860
         DC    H'4096'                                                  00007870
         DC    CL8'$REGSAVE'                                            00007880
         DC    XL3'033000'                                              00007890
         DC    CL1' '                                                   00007900
         DC    H'0'                                                     00007910
         DC    CL8'$MSAVE  '                                            00007920
         DC    H'0880'                                                  00007930
         DC    XL4'00141000'                                            00007940
         DC    CL8'$POSTSAV'                                            00007950
         DC    XL1'03'                                                  00007960
         DC    CL1'h'                                                   00007970
         DC    H'0024'                                                  00007980
         DC    H'0'                                                     00007990
         DC    CL8'$CSAVREG'                                            00008000
         DC    H'0928'                                                  00008010
         DC    XL1'00'                                                  00008020
         DC    CL1' '                                                   00008030
         DC    H'4096'                                                  00008040
         DC    CL8'$OWNSYS '                                            00008050
         DC    XL4'04240001'                                            00008060
         DC    H'0'                                                     00008070
         DC    CL8'$SIDTIME'                                            00008080
         DC    H'1040'                                                  00008090
         DC    XL4'00080100'                                            00008100
         DC    CL8'$SID    '                                            00008110
         DC    XL4'04180004'                                            00008120
         DC    H'0256'                                                  00008130
         DC    CL8'$RELSE  '                                            00008140
         DC    H'1052'                                                  00008150
         DC    XL4'00020100'                                            00008160
         DC    CL8'$LEVEL  '                                            00008170
         DC    XL4'041E0002'                                            00008180
         DC    H'0'                                                     00008190
         DC    CL8'$SIDBUSY'                                            00008200
         DC    H'1061'                                                  00008210
         DC    F'65536'                                                 00008220
         DC    CL8'$SIDAFF '                                            00008230
         DC    XL4'04260001'                                            00008240
         DC    H'0'                                                     00008250
         DC    CL8'$STATUS '                                            00008260
         DC    H'1063'                                                  00008270
         DC    F'65536'                                                 00008280
         DC    CL8'$IOTPDDB'                                            00008290
         DC    XL4'04280004'                                            00008300
         DC    H'0'                                                     00008310
         DC    CL8'$CYLMAPL'                                            00008320
         DC    H'1068'                                                  00008330
         DC    XL4'00040000'                                            00008340
         DC    CL8'$JOBQSIZ'                                            00008350
         DC    XL4'04300004'                                            00008360
         DC    H'0'                                                     00008370
         DC    CL8'$JOTSIZE'                                            00008380
         DC    H'1076'                                                  00008390
         DC    XL4'00040000'                                            00008400
         DC    CL8'$RSVECB '                                            00008410
         DC    XL4'04380004'                                            00008420
         DC    H'0'                                                     00008430
         DC    CL8'$CKPTUCB'                                            00008440
         DC    H'1084'                                                  00008450
         DC    XL4'00040100'                                            00008460
         DC    CL8'$CKPTVOL'                                            00008470
         DC    XL1'04'                                                  00008480
         DC    CL1' '                                                   00008490
         DC    H'0008'                                                  00008500
         DC    H'0512'                                                  00008510
         DC    CL8'$BUFLENG'                                            00008520
         DC    H'1108'                                                  00008530
         DC    XL4'00020000'                                            00008540
         DC    CL8'$SONWORK'                                            00008550
         DC    XL4'04560002'                                            00008560
         DC    H'0512'                                                  00008570
         DC    CL8'$ACTIVE '                                            00008580
         DC    H'1112'                                                  00008590
         DC    F'65536'                                                 00008600
         DC    CL8'$ABENDSA'                                            00008610
         DC    XL4'04590003'                                            00008620
         DC    H'0512'                                                  00008630
         DC    CL8'$EXCPCT '                                            00008640
         DC    XL1'04'                                                  00008650
         DC    CL1'*'                                                   00008660
         DC    XL4'00020200'                                            00008670
         DC    CL8'$WTRWTCT'                                            00008680
         DC    XL1'04'                                                  00008690
         DC    CL1';'                                                   00008700
         DC    H'0001'                                                  00008710
         DC    H'0512'                                                  00008720
         DC    CL8'$MAXCMCT'                                            00008730
         DC    XL1'04'                                                  00008740
         DC    CL1'¬'                                                   00008750
         DC    F'65536'                                                 00008760
         DC    CL8'$RESHORT'                                            00008770
         DC    XL4'04640002'                                            00008780
         DC    CL1' '                                                   00008790
         DC    XL1'18'                                                  00008800
         DC    CL24'HASP SPECIAL PROCESSORS '                           00008810
         DC    H'4096'                                                  00008820
         DC    CL8'$COMMPCE'                                            00008830
         DC    XL4'04680004'                                            00008840
         DC    H'0'                                                     00008850
         DC    CL8'$PSOPCE '                                            00008860
         DC    XL1'04'                                                  00008870
         DC    CL1'%'                                                   00008880
         DC    XL4'00040000'                                            00008890
         DC    CL8'$EXECPCE'                                            00008900
         DC    XL4'04700004'                                            00008910
         DC    H'0'                                                     00008920
         DC    CL8'$JCLPCE '                                            00008930
         DC    H'1140'                                                  00008940
         DC    XL4'00040000'                                            00008950
         DC    CL8'$ASYNCP '                                            00008960
         DC    XL4'04780004'                                            00008970
         DC    H'0'                                                     00008980
         DC    CL8'$XTIMPCE'                                            00008990
         DC    XL1'04'                                                  00009000
         DC    CL1'@'                                                   00009010
         DC    XL4'00040000'                                            00009020
         DC    CL8'$TIMEPCE'                                            00009030
         DC    XL4'04800004'                                            00009040
         DC    H'0'                                                     00009050
         DC    CL8'$MLLMPCE'                                            00009060
         DC    XL1'04'                                                  00009070
         DC    CL1'h'                                                   00009080
         DC    XL4'00040000'                                            00009090
         DC    CL8'$MCONPCE'                                            00009100
         DC    XL4'048C0004'                                            00009110
         DC    H'0'                                                     00009120
         DC    CL8'$OUTPCE '                                            00009130
         DC    H'1168'                                                  00009140
         DC    XL4'00040000'                                            00009150
         DC    CL8'$HOLDPCE'                                            00009160
         DC    XL1'04'                                                  00009170
         DC    CL1'm'                                                   00009180
         DC    H'0004'                                                  00009190
         DC    H'0'                                                     00009200
         DC    CL8'$PRGPCE '                                            00009210
         DC    XL1'04'                                                  00009220
         DC    CL1'q'                                                   00009230
         DC    XL4'00040000'                                            00009240
         DC    CL8'$WARMPCE'                                            00009250
         DC    XL4'049C0004'                                            00009260
         DC    H'0'                                                     00009270
         DC    CL8'$CKPTPCE'                                            00009280
         DC    H'1184'                                                  00009290
         DC    XL4'00040000'                                            00009300
         DC    CL8'$PRAGPCE'                                            00009310
         DC    XL1'04'                                                  00009320
         DC    CL1'u'                                                   00009330
         DC    H'0004'                                                  00009340
         DC    CL1' '                                                   00009350
         DC    XL1'1E'                                                  00009360
         DC    CL30'PROCESSOR DISPATCHING CONTROL '                     00009370
         DC    H'4096'                                                  00009380
         DC    CL8'$CURPCE '                                            00009390
         DC    H'1196'                                                  00009400
         DC    XL4'00040000'                                            00009410
         DC    CL8'$HASPECF'                                            00009420
         DC    XL4'04B00004'                                            00009430
         DC    H'0'                                                     00009440
         DC    CL8'MHASPECF'                                            00009450
         DC    H'1204'                                                  00009460
         DC    H'0004'                                                  00009470
         DC    CL1' '                                                   00009480
         DC    XL1'10'                                                  00009490
         DC    CL16'PROCESSOR QUEUES'                                   00009500
         DC    H'4096'                                                  00009510
         DC    CL8'$EWQALOC'                                            00009520
         DC    H'1208'                                                  00009530
         DC    XL4'00080000'                                            00009540
         DC    CL8'$EWQIMAG'                                            00009550
         DC    XL4'04C00008'                                            00009560
         DC    H'0'                                                     00009570
         DC    CL8'$EWQBUF '                                            00009580
         DC    XL1'04'                                                  00009590
         DC    CL1'H'                                                   00009600
         DC    XL4'00080000'                                            00009610
         DC    CL8'$EWQJOT '                                            00009620
         DC    XL4'04D00008'                                            00009630
         DC    H'0'                                                     00009640
         DC    CL8'$EWQTRAK'                                            00009650
         DC    XL1'04'                                                  00009660
         DC    CL1'Q'                                                   00009670
         DC    XL4'00080000'                                            00009680
         DC    CL8'$EWQJOB '                                            00009690
         DC    XL4'04E00008'                                            00009700
         DC    H'0'                                                     00009710
         DC    CL8'$EWQUNIT'                                            00009720
         DC    XL1'04'                                                  00009730
         DC    CL1'Y'                                                   00009740
         DC    XL4'00080000'                                            00009750
         DC    CL8'$EWQCKPT'                                            00009760
         DC    XL1'04'                                                  00009770
         DC    CL1'0'                                                   00009780
         DC    H'0008'                                                  00009790
         DC    H'0'                                                     00009800
         DC    CL8'$EWQCMB '                                            00009810
         DC    XL1'04'                                                  00009820
         DC    CL1'8'                                                   00009830
         DC    XL4'00080000'                                            00009840
         DC    CL8'$EWQSMF '                                            00009850
         DC    XL4'05000008'                                            00009860
         DC    H'0'                                                     00009870
         DC    CL8'$EWQCKPW'                                            00009880
         DC    H'1288'                                                  00009890
         DC    XL4'00080000'                                            00009900
         DC    CL8'$EWQCKPP'                                            00009910
         DC    XL4'05100008'                                            00009920
         DC    H'0'                                                     00009930
         DC    CL8'$EWQRSV '                                            00009940
         DC    H'1304'                                                  00009950
         DC    XL4'00080000'                                            00009960
         DC    CL8'$EWQABIT'                                            00009970
         DC    XL4'05200008'                                            00009980
         DC    H'0'                                                     00009990
         DC    CL8'$READY  '                                            00010000
         DC    H'1320'                                                  00010010
         DC    H'0008'                                                  00010020
         DC    CL1' '                                                   00010030
         DC    XL1'24'                                                  00010040
         DC    CL32'HCT VARIABLES REGULARLY CHECKPOI'                   00010050
         DC    CL4'NTED'                                                00010060
         DC    H'4608'                                                  00010070
         DC    CL8'$JOBRECN'                                            00010080
         DC    H'1332'                                                  00010090
         DC    XL4'00020200'                                            00010100
         DC    CL8'$JOTRECN'                                            00010110
         DC    XL4'05360002'                                            00010120
         DC    H'0'                                                     00010130
         DC    CL8'$WCHECK '                                            00010140
         DC    H'1342'                                                  00010150
         DC    F'65536'                                                 00010160
         DC    CL8'$CKPTFLG'                                            00010170
         DC    XL4'053F0001'                                            00010180
         DC    H'0'                                                     00010190
         DC    CL8'$CKPUSER'                                            00010200
         DC    XL1'05'                                                  00010210
         DC    CL1' '                                                   00010220
         DC    XL4'00080000'                                            00010230
         DC    CL8'$UNSPUNQ'                                            00010240
         DC    XL4'05480004'                                            00010250
         DC    H'0'                                                     00010260
         DC    CL8'$NEWSIOT'                                            00010270
         DC    XL1'05'                                                  00010280
         DC    CL1'<'                                                   00010290
         DC    XL4'00040000'                                            00010300
         DC    CL8'$NEWSTTR'                                            00010310
         DC    XL1'05'                                                  00010320
         DC    CL1'&&'                                                  00010330
         DC    H'0004'                                                  00010340
         DC    H'0'                                                     00010350
         DC    CL8'$JQFREE '                                            00010360
         DC    H'1364'                                                  00010370
         DC    XL4'00020000'                                            00010380
         DC    CL8'$JQHEADS'                                            00010390
         DC    XL4'05560068'                                            00010400
         DC    H'4096'                                                  00010410
         DC    CL8'$DATAKEY'                                            00010420
         DC    H'1460'                                                  00010430
         DC    XL4'00040000'                                            00010440
         DC    CL8'$JOBNO  '                                            00010450
         DC    XL4'05B80002'                                            00010460
         DC    H'0'                                                     00010470
         DC    CL8'$STCNO  '                                            00010480
         DC    H'1466'                                                  00010490
         DC    XL4'00020000'                                            00010500
         DC    CL8'$TSUNO  '                                            00010510
         DC    XL4'05BC0002'                                            00010520
         DC    H'0256'                                                  00010530
         DC    CL8'$HASPID '                                            00010540
         DC    H'1482'                                                  00010550
         DC    XL4'00040100'                                            00010560
         DC    CL8'$CHKPT  '                                            00010570
         DC    XL4'05CE0006'                                            00010580
         DC    H'0256'                                                  00010590
         DC    CL8'$CHKPT2 '                                            00010600
         DC    XL1'05'                                                  00010610
         DC    CL1'M'                                                   00010620
         DC    XL4'00060100'                                            00010630
         DC    CL8'$SPOOL  '                                            00010640
         DC    XL4'05DA0006'                                            00010650
         DC    H'0512'                                                  00010660
         DC    CL8'$BUFSIZE'                                            00010670
         DC    H'1504'                                                  00010680
         DC    XL4'00020200'                                            00010690
         DC    CL8'$MAXJOBS'                                            00010700
         DC    XL1'05'                                                  00010710
         DC    CL1'S'                                                   00010720
         DC    H'0002'                                                  00010730
         DC    H'0512'                                                  00010740
         DC    CL8'$NUMJOES'                                            00010750
         DC    XL1'05'                                                  00010760
         DC    CL1'U'                                                   00010770
         DC    XL4'00020200'                                            00010780
         DC    CL8'$MINJOES'                                            00010790
         DC    XL1'05'                                                  00010800
         DC    CL1'W'                                                   00010810
         DC    H'0002'                                                  00010820
         DC    H'0512'                                                  00010830
         DC    CL8'$NUMRJE '                                            00010840
         DC    XL1'05'                                                  00010850
         DC    CL1'Y'                                                   00010860
         DC    XL4'00020200'                                            00010870
         DC    CL8'$NUMTGV '                                            00010880
         DC    XL4'05EA0002'                                            00010890
         DC    H'0512'                                                  00010900
         DC    CL8'$QSENO  '                                            00010910
         DC    H'1516'                                                  00010920
         DC    XL4'00020200'                                            00010930
         DC    CL8'$NUMDA  '                                            00010940
         DC    XL4'05EE0001'                                            00010950
         DC    H'0512'                                                  00010960
         DC    CL8'$SPOLMSG'                                            00010970
         DC    H'1519'                                                  00010980
         DC    F'65536'                                                 00010990
         DC    CL8'$RECINCR'                                            00011000
         DC    XL1'05'                                                  00011010
         DC    CL1'2'                                                   00011020
         DC    H'0001'                                                  00011030
         DC    H'0512'                                                  00011040
         DC    CL8'$TCELSIZ'                                            00011050
         DC    XL1'05'                                                  00011060
         DC    CL1'3'                                                   00011070
         DC    XL4'0001FFFF'                                            00011080
         DC    XL4'FFFF0000'                                            00011090
R0       EQU   0                                                        00011100
R1       EQU   1                                                        00011110
R2       EQU   2                                                        00011120
R3       EQU   3                                                        00011130
R4       EQU   4                                                        00011140
R5       EQU   5                                                        00011150
R6       EQU   6                                                        00011160
R7       EQU   7                                                        00011170
R8       EQU   8                                                        00011180
R9       EQU   9                                                        00011190
R10      EQU   10                                                       00011200
R11      EQU   11                                                       00011210
R12      EQU   12                                                       00011220
R13      EQU   13                                                       00011230
R14      EQU   14                                                       00011240
R15      EQU   15                                                       00011250
         END                                                            00011260
