*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000010
*=                                                                   =* 00000020
*=                                                                   =* 00000030
*=                                                                   =* 00000040
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00000050
HASPFMT3 CSECT                                                          00000060
         DC    CL1'C'                                                   00000070
         DC    XL1'01'                                                  00000080
         DC    CL8'QSE     '                                            00000090
         DC    H'0'                                                     00000100
         DC    H'0476'                                                  00000110
         DC    CL1'-'                                                   00000120
         DC    XL1'2E'                                                  00000130
         DC    CL32'FIRST HASP SHARED QUEUE CONTROL '                   00000140
         DC    CL14'ELEMENT (QSE) '                                     00000150
         DC    H'4096'                                                  00000160
         DC    CL8'QSESITIM'                                            00000170
         DC    F'00008'                                                 00000180
         DC    H'0256'                                                  00000190
         DC    CL8'QSESID  '                                            00000200
         DC    H'0008'                                                  00000210
         DC    XL4'00040000'                                            00000220
         DC    CL8'QSESIBSY'                                            00000230
         DC    XL4'000C0001'                                            00000240
         DC    H'0'                                                     00000250
         DC    CL8'QSESIAFF'                                            00000260
         DC    H'0013'                                                  00000270
         DC    F'65536'                                                 00000280
         DC    CL8'QSEOPJNO'                                            00000290
         DC    XL4'000E0002'                                            00000300
         DC    H'0'                                                     00000310
         DC    CL8'QSEOPCKP'                                            00000320
         DC    H'0016'                                                  00000330
         DC    XL4'00020000'                                            00000340
         DC    CL8'QSEFLAGS'                                            00000350
         DC    XL4'00120001'                                            00000360
         DC    H'0'                                                     00000370
         DC    CL8'QSESTAT '                                            00000380
         DC    H'0019'                                                  00000390
         DC    H'0001'                                                  00000400
         DC    CL1'C'                                                   00000410
         DC    XL1'01'                                                  00000420
         DC    CL8'QSE     '                                            00000430
         DC    F'00544'                                                 00000440
         DC    CL1' '                                                   00000450
         DC    XL1'34'                                                  00000460
         DC    CL32'THIS SYSTEMS HASP SHARED QUEUE C'                   00000470
         DC    CL20'ONTROL ELEMENT (QSE)'                               00000480
         DC    H'4096'                                                  00000490
         DC    CL8'QSESITIM'                                            00000500
         DC    F'00008'                                                 00000510
         DC    H'0256'                                                  00000520
         DC    CL8'QSESID  '                                            00000530
         DC    H'0008'                                                  00000540
         DC    XL4'00040000'                                            00000550
         DC    CL8'QSESIBSY'                                            00000560
         DC    XL4'000C0001'                                            00000570
         DC    H'0'                                                     00000580
         DC    CL8'QSESIAFF'                                            00000590
         DC    H'0013'                                                  00000600
         DC    F'65536'                                                 00000610
         DC    CL8'QSEOPJNO'                                            00000620
         DC    XL4'000E0002'                                            00000630
         DC    H'0'                                                     00000640
         DC    CL8'QSEOPCKP'                                            00000650
         DC    H'0016'                                                  00000660
         DC    XL4'00020000'                                            00000670
         DC    CL8'QSEFLAGS'                                            00000680
         DC    XL4'00120001'                                            00000690
         DC    H'0'                                                     00000700
         DC    CL8'QSESTAT '                                            00000710
         DC    H'0019'                                                  00000720
         DC    XL4'0001FFFF'                                            00000730
         DC    XL4'FFFF0000'                                            00000740
R0       EQU   0                                                        00000750
R1       EQU   1                                                        00000760
R2       EQU   2                                                        00000770
R3       EQU   3                                                        00000780
R4       EQU   4                                                        00000790
R5       EQU   5                                                        00000800
R6       EQU   6                                                        00000810
R7       EQU   7                                                        00000820
R8       EQU   8                                                        00000830
R9       EQU   9                                                        00000840
R10      EQU   10                                                       00000850
R11      EQU   11                                                       00000860
R12      EQU   12                                                       00000870
R13      EQU   13                                                       00000880
R14      EQU   14                                                       00000890
R15      EQU   15                                                       00000900
         END                                                            00000910
